webpackJsonp([4], {
    "/klP": function(e, l, t) {
        "use strict";
        var o = {
            name: "riverMap",
            props: ["activeItem", "activeCityItem", "hiddenCity"],
            data: function() {
                return {
                    riverData: [{
                        name: "通惠河",
                        top: "-5%",
                        left: "30%",
                        visible: !1
                    }, {
                        name: "北运河",
                        top: "0",
                        left: "35%",
                        visible: !1
                    }, {
                        name: "南运河",
                        top: "29%",
                        left: "36%",
                        visible: !1
                    }, {
                        name: "会通河",
                        top: "50%",
                        left: "55%",
                        visible: !1
                    }, {
                        name: "中运河",
                        top: "55%",
                        left: "60%",
                        visible: !1
                    }, {
                        name: "淮扬运河",
                        top: "60%",
                        left: "65%",
                        visible: !1
                    }, {
                        name: "江南运河",
                        top: "70%",
                        left: "71%",
                        visible: !1
                    }, {
                        name: "浙东运河",
                        top: "73%",
                        left: "75%",
                        visible: !1
                    }, {
                        name: "永济渠",
                        top: "38%",
                        left: "31%",
                        visible: !1
                    }, {
                        name: "通济渠",
                        top: "40%",
                        left: "41%",
                        visible: !1
                    }],
                    cityData: [{
                        name: "北京",
                        top: "-5%",
                        left: "26%",
                        visible: !1
                    }, {
                        name: "通州",
                        top: "-3%",
                        left: "30%",
                        visible: !1
                    }, {
                        name: "西安",
                        top: "0%",
                        left: "30%",
                        visible: !1
                    }, {
                        name: "天津",
                        top: "1%",
                        left: "35%",
                        visible: !1
                    }, {
                        name: "德州",
                        top: "4%",
                        left: "36%",
                        visible: !1
                    }, {
                        name: "沧州",
                        top: "6%",
                        left: "28%",
                        visible: !1
                    }, {
                        name: "商丘",
                        top: "8%",
                        left: "27%",
                        visible: !1
                    }, {
                        name: "洛阳",
                        top: "10%",
                        left: "28%",
                        visible: !1
                    }, {
                        name: "郑州",
                        top: "10%",
                        left: "34%",
                        visible: !1
                    }, {
                        name: "宿州",
                        top: "10%",
                        left: "35%",
                        visible: !1
                    }, {
                        name: "聊城",
                        top: "8%",
                        left: "32%",
                        visible: !1
                    }, {
                        name: "济宁",
                        top: "6%",
                        left: "38%",
                        visible: !1
                    }, {
                        name: "徐州",
                        top: "10%",
                        left: "48%",
                        visible: !1
                    }, {
                        name: "淮安",
                        top: "12%",
                        left: "52%",
                        visible: !1
                    }, {
                        name: "扬州",
                        top: "14%",
                        left: "53%",
                        visible: !1
                    }, {
                        name: "无锡",
                        top: "15%",
                        left: "58%",
                        visible: !1
                    }, {
                        name: "镇江",
                        top: "15%",
                        left: "56%",
                        visible: !1
                    }, {
                        name: "苏州",
                        top: "16%",
                        left: "63%",
                        visible: !1
                    }, {
                        name: "嘉兴",
                        top: "16%",
                        left: "67%",
                        visible: !1
                    }, {
                        name: "湖州",
                        top: "18%",
                        left: "65%",
                        visible: !1
                    }, {
                        name: "绍兴",
                        top: "17%",
                        left: "68%",
                        visible: !1
                    }, {
                        name: "杭州",
                        top: "18%",
                        left: "72%",
                        visible: !1
                    }, {
                        name: "宁波",
                        top: "21%",
                        left: "72%",
                        visible: !1
                    }]
                }
            },
            watch: {
                activeItem: function(e) {
                    e.name && (this.cityData.forEach(function(e) {
                        e.visible = !1
                    }),
                    this.riverData.map(function(l) {
                        "江南运河段" != e.name && "南运河段" != e.name ? e.name.indexOf(l.name) >= 0 ? l.visible = !0 : l.visible = !1 : 0 == e.name.indexOf(l.name) ? l.visible = !0 : l.visible = !1
                    }))
                },
                activeCityItem: function(e) {
                    e.name && (this.riverData.forEach(function(e) {
                        e.visible = !1
                    }),
                    this.cityData.map(function(l) {
                        e.name == l.name ? window.setTimeout(function() {
                            l.visible = !0
                        }, 10) : l.visible = !1
                    }))
                }
            },
            methods: {
                closePop: function() {
                    this.riverData.forEach(function(e) {
                        e.visible = !1
                    }),
                    this.cityData.forEach(function(e) {
                        e.visible = !1
                    })
                },
                riverClick: function(e) {
                    this.$emit("riverClick", e)
                },
                cityClick: function(e) {
                    this.$emit("cityClick", e)
                },
                toGraph: function(e) {
                    /河$/.test(e.name) || /渠$/.test(e.name) ? this.$router.push({
                        name: "graph",
                        query: {
                            activeName: "first",
                            active: e.name
                        }
                    }) : this.$router.push({
                        name: "graph",
                        query: {
                            activeName: "second",
                            active: e.name
                        }
                    })
                }
            }
        }
          , r = {
            render: function() {
                var e = this
                  , l = e.$createElement
                  , t = e._self._c || l;
                return t("div", {
                    staticClass: "riverMap",
                    on: {
                        click: e.closePop
                    }
                }, [t("div", {
                    staticClass: "riverBottom"
                }), e._v(" "), t("div", {
                    staticClass: "riverMiddle"
                }, [t("div", {
                    staticClass: "riverNameContent"
                }, e._l(e.riverData, function(l) {
                    return t("el-popover", {
                        key: l.name,
                        attrs: {
                            placement: "top",
                            width: "300",
                            offset: 50,
                            trigger: "manual"
                        },
                        model: {
                            value: l.visible,
                            callback: function(t) {
                                e.$set(l, "visible", t)
                            },
                            expression: "item.visible"
                        }
                    }, [t("div", {
                        staticClass: "popoverContent"
                    }, [t("p", [e._v(e._s(e.activeItem.cardIntro))]), e._v(" "), t("div", {
                        staticClass: "toGraphBtn",
                        on: {
                            click: function(t) {
                                return e.toGraph(l)
                            }
                        }
                    }, [e._v("点击跳转[" + e._s(e.activeItem.name) + "]知识图谱>")])]), e._v(" "), t("p", {
                        staticClass: "riverName",
                        style: {
                            top: l.top,
                            left: l.left
                        },
                        attrs: {
                            slot: "reference"
                        },
                        on: {
                            click: function(t) {
                                return e.riverClick(l)
                            }
                        },
                        slot: "reference"
                    }, [e._v(e._s(l.name))])])
                }), 1)]), e._v(" "), !e.activeItem.name || e.activeCityItem.name ? t("div", {
                    staticClass: "riverCityContent"
                }, e._l(e.cityData, function(l, o) {
                    return e.hiddenCity && -1 != e.hiddenCity.indexOf(l.name) ? e._e() : t("div", {
                        key: l.name,
                        staticClass: "riverCity",
                        style: {
                            top: l.top,
                            left: l.left,
                            height: 50 - o % 3 * 3 + "%",
                            marginTop: o % 3 * 3 + "%",
                            zIndex: o % 3 * 3
                        },
                        attrs: {
                            title: l.name
                        }
                    }, [t("el-popover", {
                        attrs: {
                            placement: "right",
                            width: "300",
                            trigger: "manual"
                        },
                        model: {
                            value: l.visible,
                            callback: function(t) {
                                e.$set(l, "visible", t)
                            },
                            expression: "item.visible"
                        }
                    }, [t("div", {
                        staticClass: "popoverContent"
                    }, [t("p", [e._v(e._s(e.activeCityItem.cardIntro))])]), e._v(" "), t("p", {
                        attrs: {
                            slot: "reference"
                        },
                        on: {
                            click: function(t) {
                                return e.cityClick(l)
                            }
                        },
                        slot: "reference"
                    }, [e._v(e._s(l.name))])])], 1)
                }), 0) : e._e()])
            },
            staticRenderFns: []
        };
        var a = t("VU/8")(o, r, !1, function(e) {
            t("hel6"),
            t("izfE")
        }, "data-v-5d02e842", null);
        l.a = a.exports
    },
    "1jin": function(e, l) {
        e.exports = {
            name: "徐州",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "中运河",
                    value: "至淮阴段借黄河行运，形成“漕行河道”的格局，但黄河易淤易徙的特点为漕运管理带来巨大的隐患。至明中期，黄河决溢频繁，水运条件日益复杂。嘉靖末年开南阳新河，移运道于诸湖之东，黄水东来可以湖泊缓冲。隆庆四年（1570），河决邳州，筹划开泇河。自此，借黄行运之观念渐变，指导思想由之前的“借黄行运”“引黄济运”等转变为“避黄行运”。万历三十二年（1604），开泇运河成功，既避开了黄河另得新水源，又避开了徐、吕二洪之险滩。清康熙十八年（1679），总河靳辅用陈潢计，开董口西二十里之皂河口，开河筑堤通运。至康熙二十七年，中运河开凿完成。中运河是由筑黄河堤的运料小河开扩而成，在原河之北再挑河一道，所以这条河叫中河。中运河稳定后，黄运交叉之清口成为黄、淮、运三大河汇合点。中运河西起苏鲁交界的台儿庄二级坝，东迄淮阴船闸与里运河相接处，沿线经沛县、铜山、邳州、新沂、宿迁、泗阳、淮阴等地。中运河是在明清两代开挖的泇运河和中河基础上拓浚改建而成，河段地处黄淮平原，上起山东台儿庄区，东南流经邳州，在新沂县二湾至皂河闸与骆马湖相通，皂河闸以下基本上与废黄河平行，流经宿迁、泗阳，至淮阴杨庄，全长186千米，区间流域面积6800平方千米。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "宋伯颜不花",
                    value: "宋伯颜不花（生卒年不详），字国英，元代阜城（今属河北）人。元世祖至元二十六年（1289），会通河开凿完成，北抵临清南到徐州，在河中修建闸坝调节水量，以积水行舟，极大便利了漕运、官民船只往来。然而会通河作为人工运河，并没有一般河流具有的上游源头，需要借助泗水、汶水及支流洸河的水济运。顺帝至元五年（1339），洸河暴发洪灾，从堽城闸口到石剌碛，蔓延长达18里。洪水造成泥沙淤塞，减少了运河水量，造成运河水浅，漕运几乎陷于停顿。是年冬十月，朝廷任命宋伯颜不花为都水监丞，前往治理会通河河道。"
                }, {
                    name: "贾鲁",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "贾鲁（1297～1353），字友恒，元代河东高平（今属山西）人。他自幼熟读经书，谋略过人。在仁宗延祐与英宗至治年间，两度以明经考试名列乡贡前茅。泰定帝时，先后担任东平路儒学教授、宪史、行省掾、潞城县尹、丞相东曹掾、户部主事等职。顺帝至正年间，起用为太医院都事。中书右丞相脱脱主修辽、金、宋三史，诏贾鲁为《宋史》撰修官。书成后，任燕南山东道奉使宣抚幕官、中书省检校官、监察御史、台都事、迁山北廉访副使、工部郎中等职。至正八年（1348），任行都水监，后任工部尚书、总治河防使，筹备并治理黄河。治河结束后，贾鲁以功拜中书左丞。至正十二年八月，贾鲁随从丞相脱脱攻徐州芝麻李。是年冬，贾鲁奉命与总兵月可察儿围濠州（今安徽凤阳）。十三年五月，因病卒于军中，终年57岁。"
                }, {
                    name: "王銮",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "王銮（生卒年不详），字廷和，江西大庾（今江西大余）人。明正德三年（1508）进士，授官邵武知县，改任赞皇知县。入京任都水主事，出京管理徐沛河闸，负责大运河从徐州到沛县间的河务，后分司南旺。又任陕西右参政、湖广布政使、武昌知府等。"
                }, {
                    name: "孔毓珣",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "孔毓珣（1666～1730），字东美，山东曲阜人，孔子六十七世孙。清康熙二十三年（1684），康熙到曲阜行释奠礼，孔毓珣以诸生的身份陪同祭祀，赐予恩贡生的身份。后历任武昌通判、徐州知州、邳睢同知、顺宁知州、湖广上荆南道、广西按察使、四川布政使、广西巡抚、两广总督、江南河道总督等职。雍正八年（1730）六月去世，赐祭葬如例，谥号“温僖”。"
                }, {
                    name: "严烺",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "严烺（1774～1840），字小农，浙江仁和（今杭州）人。清嘉庆二年（1797），以监生身份出资捐纳，获主簿衔，分发南河。后再次捐纳，获通判职衔。后署邳北通判。嘉庆十七年，补外河北岸通判。后任徐州道、河南河北道、河东河道总督、江南河道总督。道光二十年（1840），卒于家。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "徐州三洪",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "徐州三洪两条河流交汇是古代徐州城外的一大景观。南宋以前是汴泗交流，泗水受两侧山地所限，冲击水中巨石，形成了秦梁洪、徐州洪、吕梁洪三处险滩。秦梁洪之险成就了汉画像石中最常见的历史题材—泗水捞鼎。秦梁洪很早就湮废，如今只能从秦梁洪村、秦洪港、秦洪桥、秦洪立交等地名追寻历史的踪迹。南宋黄河夺淮后，河道上的徐州洪、吕梁洪险滩更为湍急险恶。徐州洪位于徐州城东南2里处，又称百步洪。吕梁洪位于徐州城东南50多里处的吕梁山下，因处在古吕城南，且水中有石梁，故而称吕梁洪。《水经注》有记载：“泗水之上有石梁焉，故曰吕梁也。”吕梁洪分吕梁上洪和吕梁下洪，上下洪之间是一片绵延7里多的乱石滩，比徐州洪更为险恶。元朝京杭运河开凿竣工，吕梁洪为必经之道，故建有更多的保佑船只过洪的神庙。明代为保证运道畅通，专门设置了徐州洪工部分司和吕梁洪工部分司进行管理。成化年间对二洪进行了局部治理，管河主事郭升凿去徐州外洪翻船恶石300余块。到万历时，洪中怪石基本被开凿完毕，故万历十八年《河防一览》附图中，吕梁洪处明确标注“已削平”。尽管这样，仍不能根绝黄河二洪之险，泥沙经常淤浅，妨碍行船，黄河汛期更是困难，因此不得不于万历年间开凿泇河，避黄行运。从此，运河直接从微山湖经台儿庄、邳州、宿迁至淮安，不再经过徐州。今徐州和平桥以南至显红岛间的黄河故道，大约是徐州洪的位置，挖开河床泥沙，或许能在地下10多米处发现徐州洪遗址。不过现在仅能从河边所立的刻有“百步洪”三字的巨石上，想象徐州洪“九里山前百步洪，河流如箭石当空”“胥涛鲸浪中崔巍，百步九折势不回”的壮观景象。"
                }, {
                    name: "广运仓遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "广运仓遗址明初为方便转运漕粮，在运河沿线设置了德州、临清、徐州、淮安4座水次仓，其中徐州广运仓设于明永乐十三年（1415）。宣德五年（1430）时增置仓廒百余座，计1000多间，长宽分别是309步和110步，储存粮食100万石。景泰五年（1454），将城外的广运仓扩建进城内，徐州城南部规模扩大，促进了城市发展。天启四年（1624），黄河在奎山决口，广运仓被大水吞噬，成为一片废墟。广运仓的具体位置，据1989年疏浚奎河时发现的广运仓碑记载，在徐州城南2里处，黄河在其东，云龙山在其西，南北分别是军屯和市肆，置大使、副使各1员。就今地图而言，广运仓遗址位于徐州市云龙区彭城街道办事处晓光社区居委会引洪路、奎河与溢洪道之间。在今徐州市博物馆内，还有一块残损的明成化十三年（1477）的“徐州广运仓记”碑，碑文记述了广运仓的位置、周围环境、内部结构、历史兴衰、各级官员及整修广运仓的原因、整修情况等，是运河沿线重要的漕运仓储文物。据碑文可知，广运仓形状为西南缺一角的长方形。"
                }, {
                    name: "奎山塔遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "奎山塔遗址徐州城东南的奎山塔建于明万历三十四年（1606），因位于奎山主峰而得名。塔身七层，平面正八边形，塔体为砖木结构，飞檐翘首，高约60米，最大直径约20米。“奎山塔影”为古代著名的徐州八景之一，登临塔顶，山川形胜一览无余。奎山塔还是广运仓城乃至整个徐州城的地标建筑，运河上往来的船只远远望见奎山塔，便知到达徐州了。在古代的河工地图中，常绘有奎山塔作为地理标志，例如绘制于清康熙四十一年（1702）的《运河图》、绘制于康熙四十二年以后的《全黄图》、绘制于康熙年间的《黄河图》、绘制于乾隆五十年至嘉庆二十五年间（1785～1820）的《黄河图》以及绘制于嘉庆二十五年前后的《六省黄河埽坝河道全图》等，均标有奎山塔。遗憾的是，该塔清末民初毁于雷击，1949年后遭拆除，今仅存塔基。"
                }, {
                    name: "黄楼",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "黄楼位于徐州市故黄河公园内故黄河南岸大堤上的黄楼，是徐州五大名楼之一，因北宋苏轼而闻名遐迩。北宋时苏轼任徐州知州，拆除西楚故宫，建造黄楼，位于泗水岸边，故苏轼答范纯甫诗中有“重瞳遗址已尘埃，惟有黄楼临泗水”的描写。苏辙《黄楼赋》记载了建造黄楼的原因及经过：北宋熙宁十年（1077）秋七月，黄河在澶州决口，洪水东南流夺淮入海。时任徐州知州苏轼预先派人“具畚锸，畜土石，积刍茭，完窒隙穴”，等到洪水淹至城下时，苏轼又身先士卒，誓与城存亡，鼓舞全城军民斗志，在城东南修筑了护城大堤，“故水至而民不溃”。洪水退后，苏轼上疏请求免除徐州赋税，增筑徐州城，并在城东门筑楼。根据“土实胜水”的五行理论，特将楼涂抹黄土泥浆，故名“黄楼”。《黄楼赋》由苏轼亲自书丹，并刻四方石柱上。宋碑已毁，现存为明代摹刻碑，青石质，高2米，每面宽0.54米，文33行，满行35字，楷体。北宋著名词人秦观《黄楼赋》中有“惟黄楼之瑰玮兮，冠雉堞之左方。挟光晷以横出兮，千云气而上征。既要眇以有度兮，又洞达而无旁”的描写。后代文人墨客来徐州，均要登临黄楼，赋诗作文，“黄楼赏月”成为徐州著名古八景之一。1987年重建黄楼，遗存的20多块碑刻皆镶嵌在楼内。今天所见到的黄楼，是2007年徐州市政府改造后的成果。"
                }, {
                    name: "荆山桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "荆山桥在徐州城东北约10千米处的荆山南面，位于今徐州市鼓楼区大黄山镇荆山村南，因横跨荆山河上，故名。荆河源于微山湖，荆山以下叫不老河，至邳州入京杭运河。原桥年久倒塌，清康熙二十一年（1682），徐州人张胆重建，桥长约1158米，宽约6米。乾隆十一年（1746）重修，桥长增至1599米，大孔19个，小孔145个。桥上有乾隆御笔“万世津梁”石刻横匾。同治年间，捻军同清军战斗时，荆山桥遭受严重损坏。现尚存北端一段，长约250米，宽6米，桥首石牌坊刻有“荆山桥”“利涉大川”横匾，石柱上刻有乾隆御赐楹联。"
                }, {
                    name: "徐州古城墙",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "徐州城始建于春秋时期，称彭城邑，此后历代有重建或迁建。现城址为明洪武初年重建，平面呈半圆形，周长9里多，以砖石垒砌。有角楼3座，城门4座，门外均有半圆形的瓮城，水门1座。明天启四年（1624），徐州城被大水浸泡，三年始退。崇祯元年（1628），兵备道唐焕在原址重建徐州城，清代多次维修。1928年，徐州城墙被拆除变卖。现地表以上仅在快哉亭、开明街、后井沿等处有残留。其中，西门、南门仍可寻其遗迹。西门位于徐州市泉山区王陵街道办事处二眼井社区居委会西安南路东侧，原称通汴门，也称忠义门，后称威远门、武安门，俗称西门。2000年对西门遗址进行了探掘，据报道，遗址由城墙、城门、瓮城及石板路面等部分组成，城墙南北向，宽11.5米，内外包砖，中间填黄土，长300米。主城门西向，瓮门南向，主城门外的瓮城呈半圆形，面积约600平方米，城墙宽10.5米，比主城墙窄1米，构筑方法与主城墙相同，这种布局可使敌兵或洪水进入瓮城后不能直达主城门，有利于主城的防护。南门位于奎河与彭城路交叉口北侧，原称迎恩门，后改称奎光门，俗称南门。在徐州内城四门中，南门是惟一一座主城门与瓮城门分布在一条直线上的城门。徐州外城略呈椭圆形，开6门，东西各1门，南北各2门，每座城门外不设瓮城，规格较内城城门简单。由于徐州城东、北两面临黄河，故外城东、北两面城墙都建于护城堤上，与内城墙毗邻。今存夹河后街一段长200米的东西向城墙，高4～5米，顶宽10米，内外由巨大的条石砌成，以便发挥防御与防洪的双重作用。"
                }, {
                    name: "徐州卫镇抚司遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "徐州卫镇抚司遗址位于徐州市云龙区彭城街道办事处钟鼓楼社区大同街天成国贸大厦西部。2005年发掘，发掘面积约2000平方米。遗址位于地表以下３米左右，上面有一层黄河淤泥。发现房屋遗址10余间以及汉代水井等重要遗迹，出土铜炮、铁炮、手铳、铠甲、头盔、弓箭、子弹、炮弹、桌案、瓷器、紫砂器等数百件。从出土的碑刻铭文可知，所发掘的为明代徐州的漕运卫所—徐州卫镇抚司遗址，该衙署因天启四年（1624）黄河决口而被淹没。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋战国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "春秋战国时，彭城属宋，后归楚，秦统一后设彭城县。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "西汉设彭城郡，东汉设彭城国、建都彭城。东汉时，州名。辖郡、国五，县六十二。治所郯县，在今山东郯城县。汉末移治下邳，在今江苏邳县东。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋时设徐州，后改彭城郡，治彭城。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐初，徐州与彭城郡名称多次互易，中后期徐州为节度使驻地。"
                }, {
                    name: "宋元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "宋、元两朝都置徐州，隶属和辖领变化较频。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明初徐州曾直隶京师，后属南京。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清初，徐州先后为江南省和江苏省所属直隶州，雍正末年升为徐州府，辖领1州7县。"
                }]
            }]
        }
    },
    "5yi4": function(e, l) {
        e.exports = {
            name: "宿州",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "通济渠",
                    value: "通济渠（汴河）是中国内陆两条最重要的江河——黄河和淮河之间的运河，它的建设和运用使隋唐宋三代拥有了统一帝国强大的经济纽带，同时这条600 年来连续运用的水路大动脉更是见证了中国最重要的隋唐宋三代王朝的兴衰与更迭。通济渠（汴河）的运用正值中国最富庶的朝代——唐宋时期， 唐代日本遣唐使、宋代日本僧人北上朝佛都是经由江南运河和通济渠北上，大运河因此为唐宋时期中国与日本的文化交流提供了条件。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "刘晏",
                    value: "刘晏（715～780），字士安，曹州南华（今山东菏泽南）人，仕肃宗、代宗、德宗三朝，曾任度支郎中、京兆尹、户部侍郎、吏部尚书、同中书门下平章事等官，多次充任东都、河南、江淮、山南等道转运使、盐铁使，总领天下财赋。"
                }, {
                    name: "武行德",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "武行德（908～979），五代时并州榆次（今属山西）人，幼时家境贫困，以砍柴维持生计。因体伟力大，被后晋高祖石敬瑭召入帐下。天福初，授奉国都头，后任指挥使、宁国军都虞候等职。开运中，契丹侵犯中原，兵至开封，武行德战败被擒，假装归降契丹，后自称河阳都部署，奉表归顺后汉刘知远，先后担任同平章事、真定尹、成德军节度等职。后周广顺初，又先后担任侍中、忠武军节度、河南尹、西京留守。宋太平兴国三年（978），因年老致仕，次年去世。"
                }, {
                    name: "楼钥",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "楼钥（1137～1213），字大防，又字启伯，号攻媿主人，南宋明州鄞县（今属浙江宁波）人。隆兴元年（1163），楼钥参加礼部考试，中举后，先后出任温州州学教授、敕令所删定官、宗正寺主簿、太庙宗正寺丞、温州知州等职，曾受令编修《淳熙法》。光宗即位后，官拜考功郎兼礼部，后改任国子司业、起居郎兼中书舍人等官职。宁宗即位后，升任吏部尚书，后以显谟阁学士身份提举江州太平兴国宫，不久又任命为婺州知州、宁国府知府。因受到韩侂胄迫害，被罢免了所任官职，楼钥再三上书请求告老还乡，得到了皇帝准许。韩侂胄被杀后，楼钥起任为翰林学士，又升礼部尚书兼翰林侍讲。因办事干练，又升任端明殿学士、签书枢密院事、同知枢密院事，直至官拜参知政事（副相）。楼钥任职5年后，因年老屡次上书请求去职，朝廷允他以大学士、提举万寿观的名衔退休。嘉定六年（1213）因病去世。朝廷追赠少师，谥号“宣献”。"
                }, {
                    name: "齐澣",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "齐澣（675～746），字洗心，唐代诗人。历武则天、唐睿宗、唐玄宗三朝，曾任蒲州司法参军、中书舍人、汴州刺史、尚书右丞、吏部侍郎、江南东道采访使、河南道采访使、平阳太守等职，《全唐诗》《全唐文》均存其作品。"
                }, {
                    name: "蒋之奇",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "蒋之奇（1031～1104），字颖叔，北宋常州宜兴（今属江苏无锡）人。以伯父蒋堂任枢密直学士，得以恩荫得官。嘉祐二年（1057），中“春秋三传”科，赐进士及第，官至太常博士；随后又选拔贤良方正，在廷对中深得英宗赞赏，提升为监察御史。神宗即位，任殿中侍御史、道州监税、宣州监税等职。熙宁间，王安石推行新法，蒋之奇任福建路转运判官，不久改任淮南东路转运副使。哲宗即位，蒋之奇担任直龙图阁，后升发运使，再任天章阁待制、潭州知州等职。徽宗即位，蒋之奇回朝担任翰林学士，不久又升为同知枢密院事。崇宁元年（1102），蒋之奇任观文殿学士、杭州知州。崇宁三年病逝，终年74岁。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "瞻宸楼",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "瞻宸楼。南宋建炎之后，宿州归金国。金朝管辖时期，官府曾对宿州的城池有过修缮。金大定二十六年（1186）重建宿州北城楼，实际负责城楼修建事宜的是宿州符离县丞窦宇，竣工之后，宣威将军、宿州州守耶律公将其命名为“瞻宸楼”，并立《瞻宸楼记》碑以记之。"
                }, {
                    name: "宿州古城",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "宿州城筑于唐元和四年（809），其时的具体情形不详，宋朝曾有过扩城之议，但被苏轼所阻止。据明嘉靖《宿州志》言：“宿之故城莫详，创始原惟筑之以土，迨国（明）朝十年始叠石为址，加以大甓，高二丈四尺，厚二丈五尺，周回六里三十步，辟四门，东曰望淮，西曰连汴，南曰阜财，北曰拱辰，每门上建戍楼以严更鼓，外筑月墙以加隄防，内构屋俾守门者居之，以察非常。城上每八里铺，总四十九铺。城下周围有濠，总八里一百八十八步”宿州治所在城西北隅。今宿州古城仅存州北一小段古城墙，称为“子城”，城墙上有“扶疏亭”一座。"
                }, {
                    name: "临涣古城",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "临涣古城位于安徽省濉溪县西南35千米的临涣镇，古城南临浍河，东、西、北方向均为平原，古城呈正方形，东西为1409米，南北约1400米。古城遗址至今保存完好，四周城垣基本完整。现存有古城墙、山西会馆、文昌宫、城隍庙、蹇叔墓、嵇康旧居、传统老街、特色古茶馆、淮海战役总前委旧址等。古城内外出土有数量众多的文物，周秦汉唐的陶器砖瓦，隋唐的青瓷、黄釉瓷等②②2006年被列为第六批全国重点文物保护单位。"
                }, {
                    name: "蕲县古城",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "蕲县古城位于宿州市南22.5千米的埇桥区蕲县镇。古城濒临浍河北岸，为秦朝所筑，如今城垣尚存，其规划呈南北走向，长约1.5千米，东西约1千米，周长5千米，夯土筑成。古城有四座城门，东门与西门为旱门，南北各有一座水门，运粮河自浍河从南门穿城而过。古城原有八景：紫金城、观景台、桥上阁、二龙戏珠、仙人桥、浍光五色、隐王庙、象窝"
                }, {
                    name: "花石纲遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "花石纲遗址。北宋崇宁四年（1105），徽宗修艮岳，大肆搜罗奇珍异石，并专门设置应奉局，派朱勔负责此事。花石多以纲运的形式经由汴河水路从江淮发运京师开封，是为“花石纲”。宣和年间，朱勔的花石纲船队行至灵璧，与淮南转运使陈遘所率之漕船相遇，朱勔阻道而不相让，引发冲突，陈遘下令捉拿朱勔，并将花石纲掀翻于沿河坡岸。此事《宋史陈遘传》有载：“朝廷方督纲饷，运渠壅涩，遘使决吕城、陈公两塘达于渠。漕路甫通，而朱勔花石纲塞道，官舟不得行。遘捕系其人，而上章自劾。帝为黥勔人，进遘徽猷阁待制”。据楼钥《北行日录》所记，运河“两岸皆奇石，近灵璧东岸尤多，皆宣（和）政（和）‘花石纲’所遗也”。花石纲遗址如今位于灵璧县西娄庄镇蒋圩村，南北宽约40米，东西长约1000米，整体地形呈带状凸起。"
                }, {
                    name: "东林草堂遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "东林草堂遗址即白居易故居，在宿州城北20里古符离东菜园，当地百姓称这里为“白堆村”。前人曾在这里建白公祠，后毁，东林草堂遗址犹存。唐建中三年（782），11岁的白居易随父白季庚居住符离。贞元三年（787），少年白居易年在符离写下了名扬四海的《赋得古原草送别》诗句：“离离原上草，一岁一枯荣。野火烧不尽，春风吹又生”。白居易青年时代是在符离东林草堂度过的。长庆四年（824），白居易从杭州刺史离任沿大运河北上，途经宿州符离的故园，目睹家业的败落，写下《埇桥旧业》：“别业埇城北，抛来二十春。改移新径路，变换旧村邻。有税田畴薄，无官弟侄贫。田园何用问，强半属他人”。1986年，东林草堂遗址被列为文物保护单位。"
                }, {
                    name: "灵璧张氏园亭",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "灵璧张氏园亭。张氏园又称兰皋园，坐落于宿州灵璧县城西关，该遗址地表遗存有一块重达数吨的怪石。北宋时期，张氏园亭的主人致仕后，在灵璧汴河岸边建园，引水入园，并布置奇花异草与假山怪石，使其成为一处颇有名气的人文景观。北宋元丰二年（1079），苏轼路经灵璧时曾题《灵璧张氏园亭记》，其文曰：“道京师而东，水浮浊流，陆走黄尘，陂天苍莽，行者倦厌。凡八百里，始得灵璧张氏之园于汴之阳。其外修竹森然以高，乔木蓊然以深。其中因汴之余浸，以为陂池;取山之怪石，以为岩阜。蒲苇莲芡，有江湖之思;椅桐桧柏，有山林之气;奇花美草，有京洛之态；华堂厦屋有吴蜀之巧。其深可以隐，其富可以养，果蔬可以饱邻里，鱼鳖笋菇可以馈四方之客”。欧阳修曾与友人张参相约游览张氏园亭，“庚戌，过宿州，与张参约泊零壁镇游损之园会，余有客，住宿州。参先发檥零壁待余，不至乃行，晩次零壁，独游损之园，舟失水道败柂”。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "隋唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋唐时期通济渠开凿以后，埇桥的区位发生了巨大的变化，成为交通动脉的咽喉之地，这使得埇桥地区很快兴盛发展起来，成为漕运重镇。《元和郡县图志》载：“自隋氏凿汴以来，彭城南控埇桥，以扼汴路，故其镇尤重”②。埇桥路扼彭城，西接睢阳，南临淮甸，很快成为汴河的咽喉，所谓“江淮漕运，自淮入汴，以埇桥为咽喉者是也”。隋唐运河开凿后，独特的地理位置和水文条件，使得埇桥很快成为南北交通要道。埇桥也称“埇口”，是来往船只出入淮河的水口，此处水势平缓，适合漕船及商旅船只停泊，当时大小各色船只都集散于此，商旅云集，异常繁忙。沿岸遍布客栈、货栈、饭馆和茶楼，为过往人群提供食宿之便利。随着漕运的增加，埇桥迅速发展，成为一座“舳舻之会，舟车之要”的商业城镇。"
                }, {
                    name: "五代十国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "五代十国时期，宿州除虹县在吴、南唐的控制下，其余地区都在后梁、后唐、后晋、后汉政权统治之下，《宿州志》称“后唐晋汉周，同唐制”。而梁、唐、晋、汉等政权对汴河河道始终未加在意，任其荒芜破败。直到后周显德二年（955）伐唐之际，才发现“汴水自唐末溃决，自埇桥东南，悉为污泽”。于是，周世宗“先命武宁节度使武行德发民夫，因故堤疏导之，东至泗上”。周世宗坚信，疏浚汴河，数年之后必能获其利。后周显德五年，“浚汴口，导河流，达於淮，于是江淮舟楫始通”。"
                }, {
                    name: "北宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "北宋建都开封，京师物资供应仍旧以汴河为主。宿州作为汴河的咽喉，战略地位更加突出。建隆元年（960）升宿州为防御，开宝五年（972）建为保靖军节度，属淮南路。熙宁五年（1072）分属淮南东路。这一时期，全国经济重心已经完成南移，汴河在南北经济交流中的作用愈发凸显，所谓“唐以宿为要镇，宋以宿为运道”。宿州地区逐渐由唐代的军镇转换为商业重镇，其周边的城镇也随之逐渐发展。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元朝初年，由于黄河夺淮，江淮地区水患严重，宿州地区一度遭到废弃。据光绪《宿州志》载：“元泰定初，黄河行故汴渠，仍于徐州合泗水至清口入淮。而泗州之汴口遂废，汴水湮塞，埇桥亦废”。元至正末年，宿州城先后为张士诚和西吴军所据。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明洪武十年（1377），朝廷在原唐宋故城的基础上对宿州城进行修葺，据嘉靖《宿州志》载：“创始原惟筑之以土，迨国朝十年始叠石为址，加以大甓，高二丈四尺，厚二丈五尺，周回六里三十步，辟四门，东曰望淮，西曰连汴，南曰阜财，北曰拱辰，每门上建戍楼以严更鼓，外筑月墙以加隄防，内构屋俾守门者居之，以察非常。城上每八里铺，总四十九铺。城下周围有濠，总八里一百八十八步”。"
                }]
            }]
        }
    },
    "6gh7": function(e, l) {
        e.exports = {
            name: "北京",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "于成龙",
                    value: "于成龙（1638～1700），字振甲，号如山，汉军镶红旗人。他与清顺治、康熙朝名臣于成龙同名，因此又被称为“小于成龙”，先后历任乐亭知县、滦州知州、通州知州、直隶巡抚、河道总督等职。康熙三十九年（1700）去世，赐祭葬，谥“襄勤”。"
                }, {
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "郭守敬",
                    value: "郭守敬（1231～1316），字若思，河北邢台人，元代著名科学家，在天文、水利、数学等方面都有杰出成就。郭守敬自幼从刘秉忠学天文、地理等知识，中统三年（1262），郭守敬向元世祖忽必烈陈述水利六事，深得忽必烈赞许。至元二年（1265），郭守敬即被任命为都水少监，协助都水监掌管河渠、堤防、桥梁、闸坝等的修治工程。至元八年升任都水监，主管全国水利事务。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "澄清闸",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "澄清闸位于北京市西城区万宁桥西侧，仅存遗址。金朝时设置闸座，引水灌溉周边村庄农田。元至元二十九年（1292），郭守敬修浚通惠河，河道上设24座闸维持河道水量。澄清闸初名海子闸，上、中、下3闸为1组，初为木闸，延祐年间改为石闸。明代中期修复通惠河时，因澄清闸位处通惠河上游河段，不在漕粮运段之上，故未被修复。现存澄清上、中两闸座的遗址。"
                }, {
                    name: "平津上闸",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "平津上闸位于北京市朝阳区高碑店村外通惠河岸旁。元至元二十九年（1292），郭守敬修浚通惠河建，初为木闸，延祐年间改为石闸。平津闸初名郊亭闸，元贞元年（1295）改名为平津闸，为上下两闸为一组，两闸之间相距7里，平津上闸距离庆丰闸15里。明朝中期吴仲重修通惠河，北京至通州运段修复5闸，其中包括平津上闸。原闸座两边各有一块绞关石，现仅保留一块。闸座遗址不远处为今人所塑郭守敬像。"
                }, {
                    name: "南新仓",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "南新仓位于北京市东四十条22号。俗称东门仓，始建于元代，原贮米、黑豆饲料等。明永乐七年（1409）在原有基础上修复并增置仓廒。清初时南新仓为30廒，后屡有增建，到乾隆时增至76廒，是元明清三朝国家都城的太仓之一，存放从东南地区运来的漕粮，供应在京百官俸禄、军事粮饷，并作为北京城市常平仓，以储备粮米应对灾荒年份。清乾隆中期以后，储粮数量减少。民国时，该仓改为军火库。现代曾为北京市百货公司仓库。现今街区占地面积2.6万平方米，建筑面积3.2万平方米，由南新仓古仓群、仿古建筑群和南新仓商务大厦底层商铺组成，步行街总长千余米。现有30余家商户进驻经营，业态分为文化、休闲两大类，涉及艺术文化、演出文化、美食文化等。"
                }, {
                    name: "禄米仓",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "禄米仓位于北京禄米仓胡同71、73号。原为明清两代储存漕运粮米仓廒中的一座大型粮仓，专以发放京官俸米。仓内原有明代历任仓场监督题名碑，其中著名人物有名臣海瑞。该仓始建于明嘉靖四十年（1561）。清初有30廒，康熙二十二年（1683）增至57廒，光绪末年减为43廒。由于储存粮食的需要，该仓围墙及仓廒均由大城砖砌，房顶为合瓦，顶开气窗。民国时改为军服厂。现存3廒，为北京市文物保护单位。"
                }, {
                    name: "永定河神祠碑",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "永定河神祠碑永定河即明代的浑河、卢沟河，因其河水浑浊，摇摆不定，夏秋间多发水灾，而又被称为“无定河”。“永定河”的名称始于清康熙年间，清廷在卢沟桥以下修河筑堤后，为使河道永久安定，造福民众，将其命名为“永定河”。元明清时期屡修北京与通州之间的漕运河道，永定河时有作为其水量的补给系统，其水流汇入颐和园昆明湖，成为运河水量储备来源之一。永定河神祠碑在大兴区庞各庄镇赵村龙王庙遗址，碑上浮雕二龙戏珠纹，边有夔龙纹。乾隆三十八年（1773）夏，永定河决口，碑经修复后，由皇帝手书，碑上阴阳两面均篆刻“御制”。"
                }, {
                    name: "汇通祠",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "汇通祠位于积水潭中小岛，始建于明永乐年间，由朱棣靖难之时的军师姚广孝所建，旧称法华寺。该祠所处小岛因德胜门西设水关在此地堆土而成，水从岛两旁流入积水潭。据《日下旧闻考》所载，该祠后改名镇水观音寺，清乾隆二十六年（1761）改建，御赐名为“汇通祠”，并亲书二匾，一为“潮音普觉”，一为“功兼利济”。又亲书《积水潭汇通祠诗》，御制碑文，立于祠中，诗曰：“储蓄长流济大通，澄潭积水映遥空。为关溯涧应垂制，因葺崇祠喜毕工。海寺月桥率难考，灯船歌馆漫教同。纪吟权当留碑记，殷鉴恒深惕若衷。”下小字注：“通潞转漕藉玉泉引流，汇济是潭，在都城西北隅入皇城，为太液池。东南出经大通桥为运河，以岁久淤垫，命重加挑浚，并葺新旧祠，名曰汇通。河流分闸灌输，纡余储蓄，前人经理实善。旗民夹岸而居，人烟辐辏，因筑墙为之限制，以禁污秽。是潭为前明游之所。”乾隆帝又有诗言咏积水潭，言及汇通祠：“一座湖亭倚大堤，两边水自别高低。片时济胜浮烟舫，春树人家望转迷。烟中遥见庙垣红，瞬息灵祠抵汇通。雨意溟蒙犹未止，出郊即看麦苗芃。”原祠坐北朝南。山门一间，歇山调大脊筒瓦顶，石券门，棋盘大门两扇。前殿三间，硬山调大脊筒瓦顶，配房东西各三间，硬山调瓦顶。后楼面阔三间，二层楼前出轩，硬山调大脊筒瓦顶，出轩部分为悬山箍头脊四檩卷棚，配殿东西各三间，硬山调大脊筒瓦顶。祠内有巨石一块，纹如鸡狮，称鸡狮石，鸡左向右走式，狮右向下伏式。附近有水关，镇水石螭在南岸。民国时期，汇通祠被作为私人药店。20世纪60年代，汇通祠改为居民大院。后北京修建地铁，将该祠拆除。现在原址建筑为郭守敬纪念馆。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "东汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "东汉末年，曹操开泉州渠，南接平虏渠，北经泉州、雍奴等县之东，沟通沽河、鲍丘水等水道，是这一地区最早见于记载的运河。"
                }, {
                    name: "三国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "坝河的开凿历史久远，起源于三国时期。景元三年（262）曹魏派谒者樊晨进一步引高梁河东流。这条人工河流从三国时期至元代命名为“坝河”以前，一直通流不废。这条河流河床坡度大，水量难以存留，用于灌溉田地尚可，要载重的漕舟通行则非常勉强，漕运难以为继。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋大业四年（608）开永济渠，北通涿郡，是京津段最早的运河。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐代，在幽燕一带，有过大规模的水运。"
                }, {
                    name: "金",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "金王朝在华北平原的政治、军事统治相对稳定，第四任皇帝海陵王为控制“地远而事繁”的南部汉地和解决“供馈困于转输”的经济问题，遂下诏将首都从会宁府迁至原北宋的燕山府。金朝将国都定于此地之后，开始了以转运贡赋漕粮为目的的运河修凿以及作为国都的城市营建。金天德三年（1151），海陵王对中都城的营建是在辽南京的基础上进行的，扩展东、南、西三面城墙，北墙未动，参照北宋汴京的规制设计，取真定府潭园材木营建宫室。这是依托莲花池水系在蓟城故址上兴建的最后一座大城。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元太祖十年（1215），元军攻克燕地，改燕京路总管大兴府。元太宗七年（1235），置版籍。元世祖至元元年（1264），改名中都；四年，在中都东北建城并迁都；九年，改名大都。二十一年，置大都路总管府，后升总管府为都总管府，以大兴、宛平为附郭，另直辖良乡、永清、宝坻、昌平四县；领右警巡院、左警巡院二院及涿、霸、通、蓟、漷、顺、檀、东安、固安九州。到元世祖驻扎中都，准备挥军南下时，燕京宫阙已成废墟，只能驻跸中都城郊外湖水环绕的琼华岛离宫上。该片湖泊是高梁河故道储留天然洼地，金人在岛中营建成大宁离宫。元世祖驻跸之时，着手重建宫殿，并准备营建新都。吸取金中都屡次引漕失败的教训，他放弃在金朝原址上筑城。与金朝闸河引水方式的区别在于，元人以高梁河水系作为坝河水源，而弃用水量不足的莲花池水系。修筑坝河后，元朝漕舟可改经行潞水、温榆河北上，然后借坝河转漕。与之相配合的，是此前两年便开始营建的千斯仓，位于坝河近旁，主要为兴建新都城作准备，用以收储漕粮，供应营建都城工匠的口粮，并作为常平仓的基础。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明洪武元年（1368），大将军信国公徐达、副将军鄂国公常遇春及傅友德、康茂才等人攻克元大都。明太祖定都金陵，在此地改设北平府，设北平行中书省，并置燕山、大兴、永清等6卫，隶兵3万。后八年、九年间，分别改都卫为北平都指挥使司，革设行省并设承宣布政使司。永乐年间，因北平为“龙潜之地”，迁都于此，建北京于顺天府，称为“行在”。随即罢布政司及都指挥使司，直隶北京行部及后军都督府。明初定都金陵，北平府成为北方边境所在，功能主要集中在军事战略方面。为利于防守，将较少人居住的北城城墙向南内移5里余（约2900米）；同时将南城墙向南移动1.5里（约700米），仍保留三门规制，扩大城南区域，安排官署机构。北城墙南移位置的选定，与坝河位置有关。北城墙南移至坝河南侧，将河道让出城外并以其作为北城的护城濠，从而又使明清北京城西北角受河流走向的约束，形成向东北弯曲的自然弧形。长距离的漕运制度恢复，但洪武年间停航的通惠河的修复面临困境。北京南城的城址向外延展，将通惠河河道截断。“自明初改筑京城，与运河截而为二，积土日高，舟楫不至。”由于对北京城城墙的改筑，致使通惠河河身被截，河床淤积，无法通航。宣德七年（1432），“以东安门外缘河居人逼近黄墙，喧嚣之声彻于大内，命行在工部改筑黄墙于（通惠）河东”。营建北京城时，皇城建设与南城扩展，使得通惠河一部分被圈入皇城内，另一部分则被南城墙隔截。被圈入皇城的河段，属于皇家内廷，一般河工的维护无法施展，明廷难以控制和改造该段通惠河，漕船也不可能停泊于已被圈入皇城的积水潭。河道被城墙隔断，漕船也不能沿着元时的通惠河故道驶入北京城。城市格局改变带来的影响，无法确保作为漕粮运道的通惠河下游运载河段水量充足。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清朝取代明朝后，仍以北京为京师，对城市基本形态未作大的改动。主要的改动为：以八旗居址取代街坊，重新划分街区；移出部分仓场，改建王府；废除卫所与五军都督府，将其地改建民居和移置三法司等。同时，着力于北京西郊皇家园林，使其成为另一处政治活动中心。"
                }]
            }]
        }
    },
    Cifp: function(e, l) {
        e.exports = {
            name: "济宁",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "会通河",
                    value: "会通河北起山东省临清市与南运河相接，南至山东省枣庄市台儿庄接中运河。会通河形成于元代，兴盛于明清，咸丰五年（1855）黄河改道后开始衰落。其中，元代初年，济宁以北至大清河（今黄河）称济州河，从大清河至临清称会通河；济宁以南则利用泗水河道至江苏徐州，与当时的黄河汇合。元中叶以后，从徐州至临清的运道全线通称为会通河。明代，会通河常受黄河侵扰，为避开今徐州至淮安一段黄河浅涩阻运之弊，明后期将运河河道由昭阳湖西移至湖东，并相继开挖了南阳新河、泇河。历史上有关会通河的称呼有山东运河、鲁运河、闸河、闸漕、泉河。其中，元明时期的会通河，南段至沛县东南的沽头。清代，山东正式称“省”，从康熙开始，会通河之称见诸文献记载。又因山东简称“鲁”，因此又有鲁运河之称。明清时期，会通河因沿途修建众多闸坝，故有闸河、闸漕之称。又因水源匮乏，多靠泉水补给，故又称泉河。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "普哈丁",
                    value: "普哈丁（？～1275），民间又称“补哈丁”或“补好丁”，阿拉伯人，相传为穆罕默德十六世孙，南宋时来到中国，通过运河到达扬州，并游历济宁、津沽等地，对运河区域社会文化有着深刻的认识。南宋德祐元年（1275）病逝于扬州并埋葬于此，其墓地自南宋以来受到了历代政府的修缮、扩展，明初永乐皇帝命地方官员予以保护，以纪念这位国际友人。"
                }, {
                    name: "毕辅国",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "毕辅国（生卒年不详），元代奉符人（今山东泰安）。元宪宗七年（1257），任济宁佐贰官，时蒙古军与南宋在两淮地区作战，蒙古东平路行军万户严忠济调军南下戍守。为运输军需，毕辅国向东平行台严忠范建议在宁阳县境堽城汶水上置汶水东闸（又名堽城坝），截汶水入洸河。"
                }, {
                    name: "张楷",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "张楷（1243～1324），字道宁，元代河中猗氏（今山西临猗）人。，15岁时因辞赋才能被朝廷选中，任范县、寿张县教谕。世祖至元初，朝廷设立太常寺，下辖翰林、国史两院，张楷被任命管理两院，后被举荐任户部令史。不久张楷以父母年老屡次请求外任，先后担任济阳主簿和济州（今山东济宁）判官等职。至元二十年（1283）出任济州、泗、汶等河都漕运使司，任满又先后担任泰安州判官、河南行中书省架阁库管勾、杭州路临安县尹等职。至元二十八年，世祖命开会通河，因张楷精通水利，被任命为行都水监丞等职，负责开河事宜。皇庆二年（1313），担任朝列大夫、大司农丞，不久因年老请求退休。张楷致仕后在任城（今山东济宁）建屋居住，自号“克斋”，与同乡士大夫谈论诗词歌赋，自得其乐。泰定元年（1324），因病逝世。"
                }, {
                    name: "王宠",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "王宠（生卒年不详），字仲锡，号岩溪，明代南直隶歙县（今安徽歙县）人。明正德三年（1508）进士，曾以工部都水清吏司主事负责济宁河防，带管泉政。任职期间，历考山东济、兖、青三府所属州县泉源建置沿革，尤关注运河漕运。正德五年十月，刘六、刘七在霸州发动起义，很快波及南北直隶、山东、河南、湖广等广大地区。正德十二年秋，起义军在山东连破十城，攻济宁，焚毁朝廷漕船一千二百余艘，俘虏了时任工部主事的王宠。此后他的情况便不得而知。后世多将其与江苏吴县人、明代著名书画家王宠（1494～1533）相混淆。"
                }, {
                    name: "胡瓒",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "胡瓒（生卒年不详），字伯玉，号心泽，桐城人。明万历二十三年（1595）进士，授工部都水清吏司主事，分掌南旺分司，兼督泉闸，驻济宁。三十四年，胡瓒由工部郎中升调为江西布政使司右参政，负责督理粮储，曾三次亲自督运漕粮至淮安，保证漕运按期完成。后以左参政致仕归乡，多年后病逝家中。著有《泉河史》《禹贡备遗增注》《史奕》《尚书过庭雅言》《浮山志》《解温堂集》等书。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "铁塔寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "铁塔寺位于济宁市任城区中心古槐路东，又名崇觉寺，始建于南北朝时期的北齐皇建元年（560）。据文献记载：北宋崇宁四年（1105）郡人徐永安之妻常氏为还夫愿，出资在崇觉寺（今铁塔寺）内以铁浇铸释迦塔。建塔时，由于连年战乱，铁塔仅建七级而停工。到了明代，地方官署、士绅及民众都以铁塔“无顶未尽美”，而又把铁塔“譬作伟丈夫佩剑巍峨可惜冠冕不饰”。因之，于明万历九年（1581）由河道分府龚勉同郡守萧公倡议集资聚众动工，亦用铁浇铸，增高两级，塔顶又冠以铜质鎏金天门。铁铸塔身9层，计塔座在内共11层，通高23.8米，呈八角形，自下而上逐层递减。铁塔铭文分别铸在第一层塔身的东南和东北面壁上。塔基深1.9米，塔座设一西向塔室，为砖砌仿木建筑。室内供有大悲观音千手千眼佛，佛座三面刻有佛教神话、讲经、飞天等故事画面。1988年，寺内铁塔及周围古建筑被列为全国重点文物保护单位。"
                }, {
                    name: "太白楼",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "太白楼坐落于济宁市区古运河北岸。原是唐朝贺兰氏经营的酒楼，原址在古任城东门里（今小闸口附近）。诗人李白于唐开元二十四年（736）同夫人许氏及女儿平阳由湖北安陆移家至任城（济宁），居住在酒楼之前，“常在酒楼日与同志荒宴”。李白去世近百年时，咸通二年（861），吴兴人沈光过济宁时为该楼篆书“太白酒楼”匾额，作《李翰林酒楼记》，从此“太白酒楼”成名并传颂于后世。宋、金、元代对该楼都进行过重建和修葺。元至元十九年（1282）开凿济州河时，任城城池北移今址，明代初期城墙易土为砖。明洪武二十四年（1391），济宁左卫指挥使狄崇重建太白楼，以“谪仙”的寓意，依原楼的样式，移迁于南门城楼东城墙之上（就是现今的地址），并将“酒”字去掉，更名为“太白楼”，留传至今。太白楼建在3丈8尺高的城墙上，坐北朝南，十间两层，斗拱飞檐，雄伟壮观，系古楼阁式建筑。上有李白塑像，碑碣林立，楼门向西，环以围墙。"
                }, {
                    name: "西大寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "西大寺位于济宁市三筒碑街路西，创建年代未详，建筑史学家认为寺内建筑多为清前期风格。康熙年间，济宁伊斯兰教经堂教育兴盛，李延龄、常志美等著名经师讲经传教，形成“山东学派”，故西大寺创于清初较为可信。全寺占地11亩，围以6米高的院墙。寺门中大两小，均前出后廊。两边陪衬8间耳房，为掌教住室。南端5间罩子房，存殡葬用品。院内南北讲堂各5楹，北讲堂后为15间北屋，供阿訇、海里凡住宿。东屋3间为厨房。南北讲堂中间矗立两层六角尖顶邦克楼，25扇雕刻门窗式样别致，门上悬“天方正宗”匾，下层有“承先启后”匾及贴金阿文对联。寺内原有大量中阿文匾联，现已不存。"
                }, {
                    name: "天井闸",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "天井闸又名会源闸、济州中闸、分水闸，俗称“大闸”。位于今玉带桥下游处，即太白楼南偏东方向。元至元元年（1264）修建，建闸时挖出古井，相传为唐代尉迟敬德所凿，并有创井碑，故称“天井闸”。元代开凿济州河，以天井闸为起点，向北开挖至须城（今东平）。明永乐九年（1411）重开大运河，万历十六年（1588）重修天井闸，金门6米，方石砌基，木架结构。设闸官1人、溜夫57人，在“南运门口，最关紧要”。1973年该闸被拆除，将桥东移至今秀水城以西，改称清平桥。"
                }, {
                    name: "草桥闸",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "通济闸俗称火头湾闸，始建于明万历十六年（1588）。位于济宁市任城区安居镇火头湾村旁，横跨在古运河之上，左与马场湖相接，素称“兖、曹交通之咽喉”。金门宽2丈，高2丈4尺。清光绪年间改为木桥，1917年改建石桥。闸基设施保护完好，两侧雁翅保存完整，1966年曾重修桥面。"
                }, {
                    name: "会通桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "会通桥位于济宁市城区草桥迤西的洸河和运河交汇处，始建于明洪武十年（1377），是当年引洸济运的重要水利设施和交通设施，为砖石结构的单孔拱形桥。清光绪三十一年（1905）重修，后因洸河西移，原河道被填平，该桥遂掩于地下。2006年，济宁城区河湖水系综合治理工程中发现该桥，按照文物部门的意见，对该桥实施整体保护并予以修复。"
                }, {
                    name: "夏桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "夏桥西关夏家桥，位于今济宁市任城区金城街道办事处西的洸河之上，清道光中叶（1835年左右）修建。因洸河济运阻断了济宁城西门向西的道路，时任山东盐务道台主管的夏氏之父母墓地亦被阻隔在洸河西侧，为方便百姓出入和夏氏祭祖，夏氏个人出资在洸河修建此桥，故名“夏桥”。桥面宽6米，长14米，为拱形三孔石桥。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "夏",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "境内设任国，也称“仍国”。"
                }, {
                    name: "商",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "商朝，境内除任国外，还有奄、厥、卞明等封国。其中，奄曾为商王南庚的都城。盘庚迁都于殷后，奄为商属国。"
                }, {
                    name: "周",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "西周，境内有任、厥、邾、极、茅、鲁国。其中，鲁乃为周武王灭商后，封其弟周公旦于奄的封国。东周，境内的任国，春秋时属鲁，战国时属宋又属齐。鲁国于公元前249年为楚所灭。此时，境内的封国还有茅、极、邹、方与、胡陵等。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦朝，废任国，置任城县、亢父县，属薛郡。曲阜还设有鲁郡。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "西汉，景帝中元六年（前144年）改属济东国，武帝元鼎元年（前116年）济东国改为大河郡，宣帝甘露二年（前52年）改为东平国。东汉，境仍属东平国。章帝元和元年（公元84年），析东平国置任城国（微山县鲁桥镇）。此外，还有鲁国。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋朝，境内先后置有高平郡、鲁郡。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐朝，境内设鲁郡，后又改为济州、又为济阳郡、泰宁军。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "宋朝，境内仍置济阳郡、济州。宋徽宗政和八年（1118年），境内的兖州升袭庆府。"
                }, {
                    name: "金",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "金朝，天德二年（1150年），原以巨野为治所的济州迁往境内的任城。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元朝，至元八年（1271年），境内的济州升济宁府。至元十六年（1279年）境内设济宁路，置总管府，领3州7县（州又领9县）。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明朝，洪武元年（1368年），改济宁路为济宁府，仍治任城，领3州12县。洪武十八年（1385年），又改府为州，只领3县。同时，兖州升兖州府，驻滋阳县，领27州县。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清朝，雍正二年（1724年），济宁州升为直隶州，领3县。雍正八年（1730年）改为散州，不领县。乾隆四十一年（1776年），又升为直隶州，仍领3县。当时的兖州府，辖10县；它和济宁直隶州同属兖沂曹济道。"
                }]
            }]
        }
    },
    EIFs: function(e, l) {
        e.exports = {
            name: "聊城",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "会通河",
                    value: "会通河北起山东省临清市与南运河相接，南至山东省枣庄市台儿庄接中运河。会通河形成于元代，兴盛于明清，咸丰五年（1855）黄河改道后开始衰落。其中，元代初年，济宁以北至大清河（今黄河）称济州河，从大清河至临清称会通河；济宁以南则利用泗水河道至江苏徐州，与当时的黄河汇合。元中叶以后，从徐州至临清的运道全线通称为会通河。明代，会通河常受黄河侵扰，为避开今徐州至淮安一段黄河浅涩阻运之弊，明后期将运河河道由昭阳湖西移至湖东，并相继开挖了南阳新河、泇河。历史上有关会通河的称呼有山东运河、鲁运河、闸河、闸漕、泉河。其中，元明时期的会通河，南段至沛县东南的沽头。清代，山东正式称“省”，从康熙开始，会通河之称见诸文献记载。又因山东简称“鲁”，因此又有鲁运河之称。明清时期，会通河因沿途修建众多闸坝，故有闸河、闸漕之称。又因水源匮乏，多靠泉水补给，故又称泉河。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "杨以增",
                    value: "杨以增（1787～1855），字益之，号至堂，亦号东樵。清山东东昌府聊城（今山东聊城）人。幼年丧母，由其祖母抚养成人，勤奋好读，长于经学，于名物、象数、音韵、训诂皆入门径，尤雅好藏书，筑“海源阁”庋藏海内珍籍二十余万卷。道光二年（1822）中进士，历任贵州荔波、贵筑知县，遵义、贵阳知府，广西左江道，湖北安襄郧荆道，湖北按察使，河南开归陈许道，甘肃按察使，甘肃布政使、陕西布政使、陕西巡抚。道光二十八年就任江南河道总督。咸丰五年（1855）底卒于清江浦。谥号“端勤”。"
                }, {
                    name: "康熙帝",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "康熙帝（1654～1722），名爱新觉罗玄烨，是清朝入关后的第二位皇帝。他八岁继位，15岁亲政，在位61年，是我国历代皇帝在位时间最长的一位。他继位以后，智擒鳌拜，平定三藩、驱逐沙俄、收复台湾，为维护国家主权、巩固国家统一做出了重要贡献，其在治理黄、运方面亦取得显著成效。清康熙六十一年（1722）十一月，康熙帝去世。"
                }, {
                    name: "乾隆帝",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "乾隆（1711～1799），清高宗爱新觉罗弘历，他在位六十年，传位于皇十五子颙琰后，又当了三年多太上皇。在位期间，清王朝国力鼎盛，经济繁荣、国库充裕、社会安定、边疆统一，政治、经济、军事、文化达到古代社会的顶峰。但盛世之下，深层危机也逐渐显露，晚年乾隆帝信任和珅，吏治腐败，社会矛盾逐渐尖锐，民众抗清斗争逐步高涨，外国资本主义势力也开始进入，清王朝走过全盛时期，开始迎来全面的挑战。"
                }, {
                    name: "李东阳",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "李东阳（1447～1516），字宾之，号西涯。祖籍湖广长沙府茶陵县，父祖辈以世袭军户入戍京师，隶属于金吾左卫籍。明天顺八年（1464），李东阳中二甲头名进士，入翰林院，选为庶吉士，授官编修。历任翰林院侍讲学士、左春坊左庶子、太常少卿等职。弘治八年（1495），以礼部右侍郎、侍读学士入内阁，参机务，同大学士刘健、谢迁等名臣一起在内阁辅政，君臣关系融洽，史称“弘治中兴”。官至特进光禄大夫、左柱国、少师兼太子太师、吏部尚书、华盖殿大学士。正德七年（1512）致仕。十一年七月二十日去世，朝廷赠官太师，谥号“文正”。李东阳为官期间曾参与英宗、宪宗、孝宗三朝“实录”以及《大明会典》《历代通鉴纂要》等官书的修纂，著有《怀麓堂稿》《怀麓堂诗话》《燕对录》等。"
                }, {
                    name: "归有光",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "归有光（1506～1571），字熙甫，又字开甫，别号震川、项脊生，苏州府昆山（今江苏昆山）人，人称震川先生。明嘉靖十九年（1540）举人，四十四年进士，授湖州长兴县知县。隆庆二年（1568），调任顺德府（今河北邢台）通判，专门管辖马政。四年升为南京太仆寺丞，故称“归太仆”。后来又在内阁，负责敕房的工作，参与编修《明世宗实录》，身列文学侍从之位。五年病逝。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "聊城铁塔",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "聊城铁塔位于聊城市东关京杭古运河西岸，原护国隆兴寺内东南角。建于北宋时期，是聊城市现存最古老的建筑，也是我国为数极少的金属古建筑，中国六大古铁塔之一。明永乐年间倒塌，成化二年（1466）由隆兴寺主持祖崇等僧众重新树立。为八角十三级仿木构楼阁式佛塔，塔高15.8米，由地宫、塔身、塔座、塔刹四部分组成。聊城有民谣：“东昌府有三宝，铁塔、古楼、玉皇皋”。2006年，聊城铁塔被列为第六批全国重点文物保护单位。"
                }, {
                    name: "光岳楼",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "光岳楼位于聊城市东昌府区古城中央，始建于明朝，木构楼阁，是宋元建筑向明清建筑过渡的代表作，在中国古代建筑史上有着重要地位。明洪武七年（1374），光岳楼由当时的东昌卫守御指挥佥事陈镛出于“严更漏而窥敌望远”的军事需要用修城所剩余的木料修建，称为“余木楼”。又因此楼有鼓声报时的功能，也称之为“鼓楼”。成化二十二年（1486），知府杨能在维修该楼时，因地而名，称之为“东昌楼”。弘治九年（1496），吏部考功员外郎李赞过东昌，与太守金天锡共登此楼，对该楼赞叹不已：“因叹斯楼，天下所无，虽黄鹤、岳阳亦当望拜。及今百年矣，尚寞落无名称，不亦屈乎。因与天锡评命之曰‘光岳楼’，取其近鲁有光于岱岳也”。此后，一直沿用“光岳楼”的名称。光岳楼外观为四重檐歇山十字脊过街式楼阁，从构造上可分为墩台和主楼两大部分，通高33米。墩台为砖石砌成的正四棱台，台的东、西、南、北四面中部各设有一半券拱门，券至台中心处成十字交叉拱。四个券门上方，各砌有方形门额，南曰“文明”，北曰“武定”，东曰“太平”，西曰“兴礼”。登上楼基，便可见四层主楼筑于高台之上，且全为木质结构：一楼门内北面，在明间檐柱与金柱穿插枋上设着鲁班神龛；二层楼内有文昌阁；第三层系暗层，实际它是光岳楼的结构层，横木穿插，梁枋扣合；第四层是楼的最高层，面阔进深皆为三间，平面呈正方形，明间有6扇窗，可以凭窗远眺。光岳楼有石碑7通，横条壁碑15方。石碑包括乾隆帝御诗碑1通，重修光岳楼记事碑6通；壁碑包括清代开国状元傅以渐书丹、海源阁创建人物杨以增撰文石碑1通。15方壁碑分别嵌于一楼四周内外墙壁上。沿河过往的帝王将相、文人学士多登临此楼，凭栏咏月，作诗赋词。《东昌府志》《聊城县志》及现存碑刻中就记载了120篇咏赞光岳楼的诗文。清康熙帝曾四次登楼，并题写“神光鍾瑛”匾；乾隆帝九过东昌，六登光岳楼，并题匾赋诗，将光岳楼列为南巡三十六行宫之一。1988年，光岳楼被列为全国重点文物保护单位。"
                }, {
                    name: "傅氏祠堂",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "傅氏祠堂位于聊城市城区闸口西、东关大街路北，系清代开国状元傅以渐家祠的正堂，20世纪90年代辟为傅斯年陈列馆。傅斯年是傅以渐的七世孙，我国近代史上著名的史学家、教育家和社会活动家。现仅存正堂，面阔三间，进深两间。1988年被列为市级文物保护单位。"
                }, {
                    name: "海源阁",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "海源阁位于聊城市东昌府区光岳楼南万寿观街路北杨氏宅院内，清代四大藏书楼之一，始建于道光二十年（1840）。其创始人杨以增，道光二年进士，道光十八年奔父丧归里，因藏书渐多，于道光二十年建藏书楼，题名曰“海源阁”，上下两层，下为杨氏家祠，供杨氏先人牌位。其跋语说：“先大夫欲立家庙未果，今于寝东先建此阁，以承祀事。取《学记》‘先河后海’语，颜曰‘海源’，盖寓追远之思，并仿鄞范氏‘天一’名阁云”。即下层祭祖，上层为书屋。藏书楼前有一长条状小院，东侧有两座长廊式高台读书亭。杨以增后来任职江南河道总督，趁职务之便，搜求了诸多江浙藏书之精华，太平天国时杨据守清江浦，当南北水路交通要道，购获甚多。杨以增以下，又经两代经营，至清末海源阁藏书已达3236种，计208300卷有余，其中宋元珍本逾万卷，与江苏常熟县瞿绍基的“铁琴铜剑楼”，浙江吴兴县陆心源的“皕宋楼”，浙江杭州丁申、丁丙的“八千卷楼”合称清代四大藏书楼。其中以瞿、杨两家所收藏的宋元刻本和抄本书为最多，因之又有“南瞿北杨”的美称。后历经战乱，迭遭破坏，尤其是1927～1930年的两次遭劫、多次外运，所藏图书大部散失，只有一小部分辗转收入北京图书馆和山东省图书馆。1956年12月，山东省人民政府将海源阁列为第一批省级文物保护单位。"
                }, {
                    name: "崇武驿大码头",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "崇武驿大码头聊城运河西岸，馆驿口街南边有一座驿亭，驿亭旁边就是崇武驿大码头。洪武时设置崇武驿，不几裁撤，开通会通河之后复设为水马驿，北通临清，南达济宁，设有驿丞。驿站是古代传递官府文书、军事情报的人或来往官员途中食宿、换马、换船的场所，分为驿、站、铺三部分，驿是官府接待宾客和安排官府物资运输所用，站用来传递重要文书和军事情报，铺则负责地方公文、信函的传达。今码头附近还有一通“大马头义井碑”。"
                }, {
                    name: "运河小码头",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "运河小码头位于聊城市东昌府区东关古运河西岸，原为富商在大码头之外修筑的私用码头。码头由青条石垒砌，平面呈凹形，宽8米，左右各有石砌台阶。台阶最上层青石上有圆形穿孔，为系舟船缆绳之用。运河码头现保存完整，系市级文物保护单位。"
                }, {
                    name: "周家店船闸遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "周家店船闸遗址位于聊城市东昌府区凤凰办事处周店村，俗称“周店闸”。始建于元大德四年（1300），包括南闸、北闸、月河和涵洞，是运河上保存的最完整的复式船闸。1936年山东省建设厅厅长张鸿烈曾题字“周家店船闸”，至今仍在。该遗址是研究运河水利发展历史的重要实证资料。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "春秋时期是齐国西境的聊国、摄国管辖区。"
                }, {
                    name: "战国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "战国时聊城是著名的“鲁仲连射书”这一历史事件的发生地。据吴师道《战国策校注齐卷》卷四记载，齐国田单率兵伐燕复国，途中攻打聊城，燕国将领固守城池，于是齐国高士鲁仲连向城内射书信劝降，陈情利害。燕将见信不忍被屠城，哭泣三天后自杀，聊城复归齐。"
                }, {
                    name: "秦汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦代置聊城县，属于东郡，汉朝因之。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "聊城与运河交织的历史始自元代。元至元二十六年（1289），开挖会通河，接续济州河的北端安山，经东昌（聊城）至临清入卫河，长25里。元贞二年（1296）修建李海务闸，大德四年（1300）建周家店闸。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "洪武时黄河决口，运道淤绝，明永乐九年（1411）重新开通。聊城从此成为沿河九大商埠之一，也是明清山东运河直接经过的惟一的府级政治中心城市。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清顺治七年（1650）秋九月，黄河又在荆隆口决金堤，冲入漕河并淹入东昌城西南角内，房屋被吞没，直到十二年（1655）才退去⑧。咸丰四年（1854），黄河在丰县漫口，潜入运河，漕船不能顺利返航。此后黄河的影响日益严重，甚至穿入大清河，山东阖省深受其扰，聊城亦深为此惧。加之捻军活动于江浙一带，漕粮遂改由海运。但也有规复河运之议，在陶城埠建闸蓄水，漕船到了就开启闸门，放水通船，送出临清关再闭闸以待漕船回空。可是淤积壅塞，挑挖所需款项巨大，终不是长久之计。于是在光绪二十六至二十八年（1900~1902）陆续裁撤河员。光绪二十七年（1901）漕粮尽行改折，运道遂废。黄河以北河段，自通济闸至临清90余里河道经当事者奏请挑修深浚，勉强通航，但无上游水源接济便立即干涸②。"
                }, {
                    name: "民国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "辛亥革命推翻清王朝之后，东昌府改为东临道，聊城依旧是县，但管辖它的政府、官员都有较多变动。1913年当地革命党人尤民、吴廷勋策划“东昌独立”，被镇压。1924年张作霖在北京称元帅后，山东由其部下张宗昌督政。北洋军阀倒台后，西北军冯玉祥部队占领聊城，任命部下李云麾为县长。1930年韩复榘倒戈投蒋，聊城县县长又调换。民国时期，曾试图重新疏浚北运河，包括聊城段。据1936年《山东水利专刊》记载，1935年曾组织疏浚黄河以北运河，按地亩调集民夫，分为临清、清平、堂邑、博平、聊城、阳谷、东阿七段。不数日间，全河上工民夫20余万人，因为运河可以吸收泊漥之水，不致于淹没良田。至七月十五日全河土方大体完成。但1938年11月，日寇侵占聊城，运河长期无人治理，遂又成废河。"
                }]
            }]
        }
    },
    EXCb: function(e, l) {
        e.exports = {
            name: "西安",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "关中漕渠",
                    value: "关中漕渠最早开凿于汉代。西汉元光六年（前129），大司农郑当时建议从长安城的西北引用渭水，开凿一条与渭水并行而东的人工漕渠，以取代渭水的运输功能。西汉建都长安后，京师所需的粮食等物资主要依靠渭水运到京城，其线路为从黄河经过渭水西至长安。关中漕渠起自长安城西北三十里今鱼王村附近的渭水，沿渭水南侧向东延伸，经霸陵（今西安市东北）、新丰 （今临潼区东北）、郑县（今华州区）、沈阳（今华州区东北）、武城（今华州区东），止于今华阴市东北的渭水，全长300 余里（图12-1）。全线位于秦岭以北、渭水以南的关中平原，地势平坦，坡度微小，从渠首至渠尾的比降仅为3/10 000。由于漕渠渠首的水源引自渭水，沿途又陆续接纳了潏水、浐水、灞水、滈水等多条自然河流的水源，因此漕渠水量丰富，水流缓慢顺畅，船只航行安全、便利。与渭水相比，在交通运输功能方面不可同日而语，成为当时沟通关中京畿地区与关东地区的一条水运要道。关中漕渠不仅有航运之利，而且还用于灌溉，也是最早把运输和灌溉结合起来的著名水利工程之一。关中漕渠支撑了我国历史上汉唐盛世的发展，在某种程度上说，它又是汉唐长安的生命线。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "汉武帝",
                    value: "汉武帝（前156～前87），刘姓，名彻，西汉第六位皇帝。西汉定都长安（今陕西西安），关中供给不敷所用，国家所需之粮大多来自于河南、山东、江淮之地，通过黄河、渭河等自然河道将粮食输往京城。然而渭河长900余里，河道多曲，冬春水源匮乏，加之多沙，所以漕运船队经常搁浅，航运非常困难。元光六年（前129），大司农郑当时上书汉武帝，要求在渭水南岸开凿一条与渭水平行的运河，以提高漕粮的运输能力。该河起自长安东，沿秦岭山麓，300里后入黄河，既方便了关东漕粮运输，还可以灌溉漕渠附近的农田万余顷，属一举多得的举措。汉武帝经认真考虑后，采纳了郑当时的建议，命水利专家徐伯率数万人开渠，三年而成。漕渠的开挖，使漕粮的运输效率大为提高，开挖前每年入京漕粮量仅为100万石左右，后“岁六百万石。一岁之中，太仓、甘泉仓满”，国家积蓄大为丰富。另外，水道环境大为改善，安全性提高，使长安与关中地区的政治、经济、文化交流得到了不断增进。"
                }, {
                    name: "张汤",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "张汤（?～前116），西汉杜陵（今陕西西安东南）人，曾担任太中大夫、廷尉、御史大夫等，以严酷治狱著称。他曾助汉武帝推行盐铁专卖与算缗告缗，强力打击豪强，整顿奸商，以增加国家财政收入与稳定市场，编有《朝律》《越宫律》等书，还曾建议开褒斜道以通漕运，以方便关东至关中之间的物资运输。元鼎元年（前116），张汤被诬陷致死，抄家时家无余财，虽为酷吏却也不失为廉吏。"
                }, {
                    name: "张纯",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "张纯（?～56），字伯仁，京兆杜陵（今陕西西安东南）人。高祖为汉宣帝时大司马张安世，父张放为汉成帝侍中。东汉建武年间，张纯历任太中大夫、中郎将、太仆、司空等官职，封爵武始侯。建武中元元年（56）以御史大夫职去世，谥节侯。"
                }, {
                    name: "宇文恺",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "宇文恺（555～612），字安乐，京兆长安（今陕西西安附近）人，隋代著名建筑学家、水利学家。他不但修建了隋都大兴城与东都洛阳城，而且负责设计、开凿了广通渠，解决了大兴城的粮食供给问题，为永济渠、通济渠的开凿提供了经验与借鉴。"
                }, {
                    name: "韦坚",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "韦坚（？～746），字子金，京兆万年（今陕西西安）人。曾任秘书丞、长安令、陕郡太守、水陆转运使、江南与淮南租庸转运处置使、御史中丞等职。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "芷阳遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "芷阳遗址位于西安市临潼区斜口街道芷阳村骊山西麓，灞桥东岸6千米。北距西临公路1.5千米，东临韩峪口，南边有一条古河道，宽约80米。主要文化遗存集中分布于古河道以北，有水池、地下建筑、陶窑等遗迹。出土物包括陶器、建筑材料、金属器等。从出土情况推断，该遗址属战国及秦汉时期。"
                }, {
                    name: "古灞桥遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "古灞桥遗址位于西安市灞桥区席王街道柳巷村。陕西省考古所在该遗址发掘出三孔桥洞及四座桥墩。桥墩由石条砌筑而成，呈船状，是一座南北走向的多孔石拱桥，长达数百米。桥墩前后两端均呈尖状有分水尖，上部安装石雕龙头装饰。桥墩下还铺有石板基础，石板基础下夯满木桩。遗址出土了唐碑一通，上书“（扶）风郡王赠司徒马府君神道碑”。据考证，该神道碑的墓主为中唐时期的马璘，历任御史大夫、节度使，大历年间进封扶风郡王。该碑在北宋元祐年间韩缜修灞桥时被毁作石材。"
                }, {
                    name: "东渭桥遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "东渭桥遗址位于西安市高陵区耿镇白家嘴村西南，为全国重点文物保护单位。1967年同时发现唐代东渭桥遗址和《东渭桥记》碑，该碑是研究东渭桥遗址的重要史料，现存高陵区文化馆。其碑文为：东渭桥记。富平县尉河南达奚珣词。书曰：导渭自鸟鼠同穴，其来尚矣。发源之际，岐雍之间，包荒沣镐之类，益用深广。东流暎则莫可得而济矣。夫通变者，圣人之务也，可之时，义大矣哉。开元中，京尹孟公以清风故事，可以成梁。上闻于天，帝用嘉心。明制既下，指期有日。总统群务，工徒，详力役，经远迩，度高卑。前规率由，具物雷霆。瑰材所聚，隐若山岳。曾未逾月，其功乃石。杭星柱，延虹梁，矗如长云，横界极浦。迹是奂乎无以加也。至如架鼋鼍而麾蛟龙，则闻，孰尚其劳。岂如今兹择善而举，既利于物，彼有惭德。若乃睿图光赫，天京辐辏，于波足畏也，舟楫至危也。苟或失所，其伤则多。平路。无杭苇之险，同袵席之安。劳于一朝，逸有经矣。且夫诗美造舟之役，史重河桥之功，稽古有训，敢不钦若。时郡邑寮宷视事者八望。礼乐之度，近取诸身；文章之能，高暎天下。众贤一心，其下毕力。上则答□□□大命，中则述京尹之明谟。义叶从□弊河流。高陵主簿刘绾，文吏之雄也，纠合不敏，从诸公之后焉。终始备详，用举其略。请是时大唐开元九年冬十有一月旬有八日。京兆府士曹彭城刘惟超，高陵令太原。奉先尉渤海吴贯之，高陵尉河南。美原尉弘农杨慎余，同官尉京兆。华原尉太原祁玉恽，三原尉吴郡。高陵主簿彭城刘绾，富平尉河南。"
                }, {
                    name: "沙河古桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "沙河古桥位于咸阳市秦都区钓台街道资村。20世纪80年代，先后在该处发掘出两座木结构桥梁。发掘过程中，出土大量秦汉时期的遗物，有铜铁构件与农具，瓦当、方砖等。关于桥梁的性质与年代，陕西省考古所发掘人员认为属于汉代便门桥，唐时为西渭桥。结合碳十四技术，认定这两座沙河古桥在秦代时期便已建成使用。因其属于国内发现的年代最早的大型桥梁遗址，加之其规模之宏大在考古发掘中罕见，故被列为当时全国十大考古发现之一。"
                }, {
                    name: "昆明池遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "昆明池遗址位于西安市长安区韦曲街道西北、斗门街道以东。斗门镇的西石匣口村，是当年昆明池的进水口。昆明池始建于西汉元狩三年（前120），关于其开凿原因，据史书载，是由于“汉使求身毒国，而为昆明所闭，今欲伐之，故作昆明池象之，以习水战”。昆明池的凿建本意为操练水兵，然昆明池东、北两条泄水道均注入漕渠，实际上成为漕渠工程的后续有机组成部分，这对于调节漕渠水量，增强漕渠航运能力是具有积极作用的。中国社会科学院考古研究所汉城考古队对昆明湖遗址进行了考古钻探和试掘，对其池岸、进出水渠、池内高地及岸边建筑遗址遗物均有深入探讨。此外，还在昆明池以北钻探到镐池与彪池遗址。"
                }, {
                    name: "隋唐龙首渠遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "隋唐龙首渠遗址位于西安市新城区大明宫国家遗址公园内。在隋唐时期是从浐水分流引入长安城的一条水道。《两京道里记》载：“龙首渠，开皇三年开凿，引浐北流入苑，在长乐坡上，堰近龙首，即大明宫所据龙首原也，故以名之”。至于龙首渠分浐水为堰的地方，“则在万年县龙首乡码头堰”。从龙首乡引浐水经由长乐坡，分为两支，西北一支注入苑③2005年8月，中国社会科学院考古研究所在大明宫含元殿遗址以南发现唐代渠道，该渠道为东西走向，两壁较陡直，局部有砖砌护岸。考古队在对比《唐两京城坊考》及《汉唐都城图》等文献之后认为，该渠应当为进入大明宫的龙首渠支流。"
                }, {
                    name: "曲江",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "曲江也称曲江池，在唐长安城东南隅，因水流曲折得名。位于今西安市雁塔区曲江池遗址公园内。“唐曲江本秦州，至汉为宣帝游乐庙”。隋朝营建京城，宇文恺将其凿为水池，“以厌胜之”。黄渠之水穿城而入汇入池中，隋文帝更其名为“芙蓉池”。武周长安年间，太平公主置亭游玩观赏，成为京城名士“乐饮歌诗”之所。至于曲江池的大小，“汉武帝时池周回六里余，唐周七里，占地三十顷”。韩愈有诗云：“曲江千顷秋波净，平铺红云盖明镜”。曲江池后湮没为平地，中华人民共和国成立后，在原址的基础上重建大唐芙蓉园和曲江池遗址公园。"
                }, {
                    name: "华清池",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "华清池位于西安市临潼区骊山山麓，即唐代华清宫旧址。此处本为临潼城南、骊山西北的一处温泉，后周时期的宇文护对其进行建造，隋文帝在此基础上修楼宇。唐贞观十八年（644），诏令阎立德营建宫殿，名“汤泉宫”，唐太宗亲临置碑。咸亨三年（672）时改名“温泉宫”。天宝六载（747）改为“华清宫”，在骊山之上“益治汤井为池，台殿环列山谷”。天宝四载更是在“于汤所置百司及公卿邸第”。1982年以后，华清宫内设置唐华清宫御汤遗址博物馆、长生殿等单位，1997年被列为全国重点文物保护单位。"
                }, {
                    name: "香积寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "香积寺是唐代净土宗善导大师的供养道场，位于今西安市长安区郭杜街道香积寺村，南边临终南山与滈河，北为潏水及樊川。唐代王维曾作《过香积寺》诗云：“不知香积寺，数里入云峰。古木无人径，深山何处钟。泉声咽危石，日色冷青松。薄暮空潭曲，安禅制毒龙”。据史籍记载：“香积寺，吕《图》在子午谷正北微西。郭子仪收长安，陈于寺北。《唐本传》云：‘距澧水，临大川’。大川者，沉水、交水，唐永安渠也。盖寺在澧水之东，交水之西也”。安史之乱时，寺院曾受严重破坏，会昌法难再遭浩劫。北宋太平兴国年间曾有过修复，并改名“开利寺”。明清之际有过多次修缮。中华人民共和国成立后，重修大雄宝殿及维修舍利佛塔，“善导舍利塔”被列为全国重点文物保护单位。"
                }, {
                    name: "化觉巷清真寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "化觉巷清真寺又名东大寺，是全国重点文物保护单位，位于今西安莲湖区化觉巷内。据寺内所藏《创建清真寺碑记》记载，该寺始建于唐天宝元年（742），建寺缘于“圣道虽同，但行于西域，而中国未闻焉”，到隋开皇年间“其教遂入于中华，流衍散漫于天下，至于我朝天宝陛下，因西域圣人之道有同于中国圣人之道，而立教本于正，遂命工部督工官罗天爵，董理匠役，创建其寺，以处其众”。全寺整体建筑呈长方形，为四进院落。寺内保存历代石碑多座，其中包括明万历年间冯从吾所撰《敕赐重修清真寺碑》，碑阴刻有米芾所书的“道法参天地”。另外有清乾隆年间的《敕修清真寺碑》，碑阴镌刻董其昌书写的“敕赐礼拜寺”。"
                }, {
                    name: "大学习巷清真寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "大学习巷清真寺位于西安莲湖区西大街大学习巷内，又名西大寺。据该寺所藏明万历年间冯从吾所撰碑记载：“长安新兴坊，有清真寺庙，貌巍峨，廊庞丽”。唐中宗赐名“清教寺”，唐玄宗时敕改“唐明寺”。元中统年间，由兵部尚书伯颜督修，敕名“回回万善寺”。明洪武年间兵部尚书铁铉督修，赐名“清教寺”。永乐年间郑和奉旨重修，寺门石牌坊镌刻“敕建陆次”。"
                }, {
                    name: "小皮院清真寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "小皮院清真寺位于西安市莲湖区小皮院巷内，化觉巷清真大寺以北，故亦称“北大寺”。其确切创建年代已无法考证，目前存在的说法有三种：其一，据该寺保存的明万历四十三年（1615）《重修真教寺记》碑刻称“天方之一派，肇于唐初，盛于大元皇庆之间，以迄于今，历千余载”；其二是马希明在《小皮院清真寺今昔》文中的说法，其依据寺藏碑刻推断寺院始建年代为明万历三十九年（1611）；其三是小皮院清真寺管委会的说法，认为寺院建于唐末。该寺坐北朝南，四进院落，主院为第四进，含月台与木结构礼拜大殿。该寺建筑群华美异常，堪称古建筑的典范。此外，寺内还保存有明清时期的石碑、地契、匾额、墓碑等诸多文物。小皮院清真寺在抗战时期遭严重损毁，20世纪末才在残存建筑之上进行修复，并被列为陕西省文物保护单位。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "西周",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "西安，在西周时称为“丰镐”。“丰镐”，是周文王和周武王分别修建的丰京和镐京的合称。西周伯姬昌（周文王）在今西安城西南营建丰京，将臣民从岐山周原迁于此。又命子姬发（周武王）在沣水东岸营建镐京。后者为政治中心，前者为宗教、文化中心，合称“宗周”，为西安建城之始。武王灭商建立周王朝后，以丰镐为都，为西安作为都城之始。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦都城咸阳，阿房宫大部分面积在今西安市境内，兵马俑和秦陵在今西安市境内（位于西安市临潼区）。秦宗庙在渭河南岸，荆轲刺秦王，就发生在秦章台宫（后来的汉未央宫前殿）；秦代宫殿布局还没有形成宫城、皇城和三大殿的布局。秦咸阳城地跨渭河南北。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "汉长安城位于渭河以南的关中平原上，面积约36平方千米。在西汉时期，作为首都的长安城一直是全国的政治、经济和文化中心，也是中国历史上第一座规模庞大、居民众多的城市。汉长安是在秦咸阳遗址基础上建立起来的，《史记》：“汉长安，秦咸阳也”，张衡《西京赋》云：西汉长安“乃览秦制，跨周法”，《三辅黄图·序》也云：“武昭，治咸阳，因以汉都”。《旧唐书·地理志》说：“京师，故秦之咸阳，汉之长安也。”秦咸阳从惠文王以后，就不断向南扩展，在渭河以南修建了章台、兴乐宫、甘泉宫、信宫、阿房宫及七庙等建筑。刘邦夺得天下后，经娄敬、张良等的劝说，建都长安。修缮秦的兴乐宫而改为长乐宫，在秦章台基础上建未央宫。即汉长安城是在秦都咸阳基础上建立的，说明在都城选址上是汉承秦制的。汉朝宫阙均在今西安市汉城保护区内，位于北二环以北，而汉代的武帝文帝景帝陵墓，在今灞桥区境内。 丝绸之路开通后，长安成为东方文明的中心，史称“西有罗马，东有长安”。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋开皇二年（582年），隋文帝颁令在汉长安城东南的今西安城址营建新都大兴城。隋开国之初，都城仍在长安旧城，因久经战乱，残破不堪。因此，隋文帝放弃龙首原以北的故长安城，于龙首原以南汉长安城东南选择新址，建造新城大兴城。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐朝定都长安后，改隋大兴城为长安城，并进行了增修和扩建。贞观八年（634年），在原外郭城东北龙首原上营建大明宫。之后又不断修建城墙、城楼、兴庆宫等建筑。宫城完全与今西安市重合，皇宫与今西安市明城墙重合。唐代帝王陵，如昭陵、乾陵等则大部分在今咸阳市境内。而在唐代，唐十八陵全部在京兆府的辖县内，乾陵是京兆府奉天县。"
                }, {
                    name: "五代",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "五代时，后梁改京兆府为雍州，设大安府，后唐改大安府为京兆府。宋代置陕西路，后置永兴军路。赵匡胤统一中国后，曾经有意迁都长安，最后由于部下反对，只得放弃。金代改永兴军路为京兆府路。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元初，长安城的范围依然沿用五代初期唐长安城被毁后节度使韩建所重建的“新城”，并使用京兆府的名称。至元九年（1272年），元世祖封其三子忙哥为安西王，镇守其地，建安西王府。至元十六年（1279年）遂该京兆府为安西路。后来由于发生安西王叛乱，安西国被撤。皇庆元年（1312年），又改安西路为奉元路。据李好文在《长安志图》中所绘《奉元城图》，四面仅各一门，南门偏东，北门偏西，东西两门也不对称，城内建筑也无对称格局。市场集中在城内西北隅，有马市、羊市和秦川驿等。东北隅有太子府（明秦王府）、城隍庙、察院等。马可波罗于至元十二年（1275年）游历于此，写到：“城甚壮丽，为京兆国之都会……此城工商繁盛，产丝多，居人以制种种金锦丝绢……凡人生必需之物，城中皆有，价值甚贱。”"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明代形成了西安的格局，西安的名称也源于明代。明洪武二年（1369年）三月，大将军徐达进兵奉元路，改奉元路为西安府。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清代西安城内设置依旧，但在城东北修建一座满族驻防城，在城东南修建了汉军驻防城，以及增加了钟楼西南的总督布院署等。庚子之变时，慈禧和光绪西逃驻跸西安长达一年时间。"
                }]
            }]
        }
    },
    F5Zk: function(e, l) {
        e.exports = {
            name: "无锡",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "江南运河",
                    value: "江南运河的历史可追溯至春秋战国时期（前770 ～前221），是由沟通自然河道的若干运河组成，如沟通苏州和无锡之间的泰伯港、吴越两国间沟通长江和钱塘江的百尺渎、无锡一带通太湖的语昭渎、自苏州向西北经常州北境通长江的吴古故水道等。隋代对江南运河进行全线整治，始称江南河，南宋时称浙西运河，今称江南运河。江南运河，又称江南河、浙西运河，是京杭运河在长江以南的一段，北通长江，南达钱塘江，连通长江、太湖、钱塘江三大水系，至今仍全线通航。江南运河位于长江三角洲地区，以太湖水系为中心，北起长江南岸的江苏镇江京口，东南经常州、无锡，绕太湖东岸达苏州、吴江、平望，然后进入浙江嘉兴，折而西南，又经崇德、长安、临平，最终到达杭州，全长340 千米。江南运河是富庶的江南地区与北方相通的水运干道，航运条件良好，也是京杭运河运输最繁忙的航道。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "吴泰伯",
                    value: ""
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "清名桥历史街区",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "清名桥历史街区位于无锡旧城南门外古运河与伯渎港交汇处（旧称南塘地区），因此地有无锡现存规模最大的古代石拱桥“清名桥”而得名。街区沿河分布长约1.6千米，以古运河为中轴、清名桥为中心，北起跨塘桥，南到南水仙庙，东起王源吉锅厂旧址，西到定胜河沿线，由南长街、南下塘、阳春巷、大窑路等区域组成，占地0.44平方千米，核心保护区面积18.78公顷。其发展始于宋代锡山驿的设置，以此为契机，出现了众多商业、手工业作坊和住宅。明清两代，无锡南门外形成了众多的粮行堆栈，是清名桥历史文化街区的前身。街区现有清名桥、大公桥、中国丝业博物馆、大窑路窑群遗址、南水仙庙等景点。民国时期，运河两侧丝厂众多，往来丝厂工作之女工，需乘船过河。1929年，振艺丝厂一名女工在摆渡时不慎落水身亡，厂主许稻荪为平息事端，便集资建桥，于1930年4月完工，定名“大公”。中国丝业博物馆建于永泰丝厂旧址之上。该厂源自清光绪二十二年（1896），无锡籍资本家周舜卿与薛福成长子薛南溟合资在上海创办的永泰丝厂，后薛南溟于1926年将厂迁回故里，设于稍后所建之大公桥堍。1949年后，改为国营无锡丝织二厂。2009年3月，在原厂址建成中国丝业博物馆。"
                }, {
                    name: "清名桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "清名桥位于无锡市梁溪区清名桥街道清名桥社区古运河上。清名桥，原名清宁桥，始建于明万历年间，乃无锡著名私家园林寄畅园主秦燿之子捐资建造。清康熙八年（1666），无锡县令吴兴祚重建。后因讳道光帝的名字，改称清名桥。咸丰十年（1860）毁，同治八年（1869）重建。咸丰十年（1860）毁，同治八年（1869）重建。跨越大运河，为单孔石拱桥，用花岗石构筑，系纵联分节并列式结构。拱券内之金刚墙两侧各有题刻，均为四行竖排阳刻小字楷书。桥长43.3米，宽5.5米，净跨13米，矢高6.55米。"
                }, {
                    name: "惠山古镇",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "惠山古镇位于无锡市西、锡山与惠山的东北坡麓，京杭大运河紧靠其北流经，运河支流惠山浜则直达古镇腹地。古镇内各行业公所林立，主要包括盐业公所、建筑业行会、婺源会馆等，江南名园寄畅园亦坐落其中。惠山古镇祠堂分布密集，祠堂群始建于唐而盛于明清，先后出现120处祠堂建筑体，其中宰相祠堂9处，包括春申君黄歇、陆贽、司马光、范仲淹等。按规制又可分为尚书祠、侍郎祠、御史祠、巡抚祠、忠节祠、贞节祠等，名目繁多。涉及80余姓氏，180余名历史人物，是寻根问祖，追根溯源姓氏文化之源泉。"
                }, {
                    name: "北仓门蚕丝仓库旧址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "北仓门蚕丝仓库旧址位于无锡市梁溪区通江街道北仓门37号。建于1938年，为我国目前已知沿运河民族丝绸业仓库之最。该仓库由一幢两层办公楼和两幢三层蚕茧仓库组成，均为坡顶砖木结构，清水外墙。仓库①面阔30米，进深20米；仓库②面阔35米，进深20米；办公楼三间面阔19米，进深两间12米。建筑群总面积6000平方米，库房每层高近5米。"
                }, {
                    name: "黄埠墩与西水墩",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "黄埠墩与西水墩黄埠墩旧名小金山，位于吴桥以南、惠山浜口的古运河中心，因春申君黄歇在此疏浚芙蓉湖而得名。形家曰“河势直下而益广须以此为砥之”。墩为圆形，面积220平方米，用石砌驳岸，四面环水。墩上有文昌阁、环翠楼、水月轩等建筑。乾隆二十七年（1762）下江南路过黄埠墩留有诗文：“埠墩仿佛近黄城，四面清波照槛明。到则维州纵遥目，坐须把笔畅吟情。”西水墩，旧称窑墩、太保墩、水仙墩，运河北来到此处分流入梁溪，四面临水，形如岛屿。墩上有水仙庙，祀带领人民抗倭的无锡知县王其勤。"
                }, {
                    name: "御舫码头",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "御舫码头位于无锡市梁溪区惠山街道惠泉山社区惠山龙头。又称御码头。清康熙、乾隆二帝南巡，每次御船至黄埠墩停靠后即换轻舟御舫，由惠山浜（又称龙船浜）直至龙头口上岸，游赏惠山寺胜迹、秦氏花园，为惠山胜地留下诸多美好的传说和御迹。御码头一侧有一个石龙头，终年流水不断，也是惠山九龙十三泉之一的龙头。"
                }, {
                    name: "金石碑刻",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "金石碑刻位于学前街睦亲坊巷3号的无锡碑刻陈列馆是专门收藏、整理、保护和研究无锡碑刻的公益性事业单位。占地面积850平方米，建筑面积550平方米。原为无锡县学旧址，始建于北宋嘉祐三年（1058），清末被毁。陈列馆内存有从宋代至民国的历代碑刻近百通，包括帝王御笔、官府公文、地方史料、寺观敕牒、名家书法等。馆中的碑刻大致分为三类，一是有关无锡县学的碑刻，二是涉及无锡地方文献的碑刻，三是体现书法造诣的艺术碑。其中宋碑《无锡县学淳祐癸卯续增养士田记》《无锡县学新建九先生祠堂记》，元碑《锡学重修五先生祠记》，明洪武《礼部榜示生员碑》《锡山儒学先贤祠记》等十分珍贵。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "商周",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "商朝末年，周太王古公亶父长子太（泰）伯在吴地建国勾吴。为排洪灌溉，防止旱涝灾害，修建了一条人工水道，百姓感其恩，名曰“泰伯渎”。西周初年，武王分封太（泰）伯的后裔周章少子为安阳侯（今惠山区阳山又名安阳山），建立吴国。周元王三年（前473），越国灭吴，无锡属越国。"
                }, {
                    name: "春秋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "春秋时期，吴越之间战争不断。周敬王二十五年（前495），吴王夫差命人凿河以备战事，河道从苏州经望亭、无锡至常州奔牛，由孟河入长江。后人考证，这一段是江南运河的前身。周元王二年（前474），越国为伐吴，令范蠡开凿漕河，亦曰蠡河，今名南运河。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦始皇二十四年（前223），秦灭楚，置会稽郡，无锡属之。秦始皇派王翦驻守无锡。秦始皇三十一年，开凿丹徒曲河至丹阳，因地处丘陵，地形复杂，工程实施艰难，最终仅形成雏形。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "汉高祖五年（前202），始置无锡县，属会稽郡。西汉武帝时期，为通闽、浙贡赋，汉武帝下令沿太湖以东开挖运河，河道绵延百余里。东汉建武元年（25）复名无锡县。"
                }, {
                    name: "三国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "三国时期，孙权派校尉陈勋屯田，发兵3万，分无锡县以西为屯田，置毗陵（今常州）典农校尉。凿句容中道至云阳西城，此段河道名曰“破冈渎”。破冈渎沟通建业和太湖流域，航道直通苏州和绍兴，逐渐成为交通要道。这条运河的东段，即丹阳到苏州与绍兴段，实为隋代江南运河的起源。而南齐时的丹徒水道，为破冈渎东段的延长部分。"
                }, {
                    name: "西晋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "西晋太康元年（280），复置无锡县，属毗陵郡（今江苏常州）。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋大业六年（610），隋炀帝下令开江南运河，“自京口至余杭八百余里，广十余丈，使可通龙舟，并置驿馆草顿，欲东巡会稽”。镇江、丹阳段为丘陵地区，岸峻底高，往昔未修闸时，海潮易入侵，形成淤塞；而无锡地形平缓，非遇奇旱，不致干涸，此段被称作镇锡运河。历代整治，均以镇江、丹阳为重，无锡次之。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐代，无锡属江南道之江南东道。唐代中后期裴耀卿、刘晏等人改革转漕之法，装载漕粮的航船，从苏州穿过无锡，经运河转至广济渠运输到东都洛阳。安史之乱后，经济重心开始南移，韩愈指出：“当今赋出天下，而江南居十九。”可见唐后期无锡的漕粮运输更加繁荣。"
                }, {
                    name: "五代",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "五代后周时期，周世宗令人疏浚汴口之渠，导黄河之水于淮水，以通江淮之漕。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "北宋，无锡属于两浙路常州。嘉祐二年（1057），疏浚运河导入太湖水，望亭闸遂废。熙宁年间，无锡大旱，运河干涸，单锷从杭州过无锡见城内运河之南有一小渎，令人疏通，使梁溪之水灌入运河，以解其旱。南宋定都临安，对经营江南运河不遗余力，并将其视为生命线。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元元贞元年（1295），升无锡为州，属江浙行中书省常州路。泰定二年（1325），城内河道凿通，河水自北水关入，于南水关出，即如今城内运河古道。运河的开凿沟通了无锡城内的水道。无锡城的水源出于惠山，至山下分为两道，一注入双河，一注入梁溪，最后均汇于运河。汇于梁溪之水如长广、新安、乌角诸溪及蠡渎之水等，汇于双河若闾江，最后皆到达运河之中，复合为一。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明洪武元年（1368），降无锡州为县，属中书省常州府。明代无锡运道沿用故道，不曾有大的疏浚工程，惟有芙蓉湖经历了全面的整治。明以前，芙蓉湖地势低洼，每至梅雨季，湖水陡增，导致村庄被淹，漕运受阻。明宣德中，巡抚周忱会同苏州知府况钟率领人民整治芙蓉湖。周忱采取宋代水利专家单锷的主张，“筑溧阳东壩，以捍上水，开江阴黄田诸港，以泄下流”，使得芙蓉湖水流入长江。再在四周筑圩，圩内装有戽水机，可将积水排出。又新设东澜、中澜、西澜等水闸，以防湖水倒灌。同时，周忱还带领常州、无锡、吴江、宜兴等地人民疏浚芙蓉湖附近的新旧河道，对服役的丁夫采取“以工代赈”的方法，费用由国库开支，一毫不烦民。芙蓉圩建成后，排除了这一带水患的威胁，增加沃田十万八千余亩，也改善了无锡水路交通的结构，使其成为沟通长江和太湖的主要水道。时人称“其利在三吴，而功在百世”。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清康熙四年（1665）冬，太湖结冰，致运河不通舟楫数月。康熙二十八年，运河南北浅处进行深挖和拓展。雍正二年（1724），分无锡为无锡、金匮两县，同城而治，均属常州府。乾隆五十年（1785），知府闵鹗元疏浚五牧至洛社段运河约4000丈。同治十二年（1873），疏浚常州西门至无锡皋桥段运河。清中后期，漕粮在锡采办，江浙皖鄂之米云集于此，年交易量在600万～750万石之间，成为四大米市之首。"
                }]
            }]
        }
    },
    OX9h: function(e, l) {
        e.exports = [{
            source: "河道遗存",
            value: 1,
            target: "通惠河段主线（通惠河）"
        }, {
            source: "北京",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "河道遗存",
            value: 1,
            target: "玉河故道"
        }, {
            source: "北京",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "河道遗存",
            value: 1,
            target: "长河"
        }, {
            source: "北京",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "水体遗存",
            value: 1,
            target: "葫芦头"
        }, {
            source: "北京",
            value: 1,
            target: "水体遗存"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "平津上闸"
        }, {
            source: "北京",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "永通桥"
        }, {
            source: "北京",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "通运桥"
        }, {
            source: "北京",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "相关遗产",
            value: 1,
            target: "御制通州石道碑"
        }, {
            source: "北京",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "相关遗产",
            value: 1,
            target: "燃灯佛舍利塔"
        }, {
            source: "北京",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "相关遗产",
            value: 1,
            target: "通州北城墙遗址"
        }, {
            source: "北京",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通惠河",
            value: 1,
            target: "北京"
        }, {
            source: "河道遗存",
            value: 1,
            target: "北运河段主线（北运河-子牙河）"
        }, {
            source: "北京",
            value: 1,
            target: "河道遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "北京"
        }, {
            source: "河道遗存",
            value: 1,
            target: "北运河段主线（北运河-子牙河）"
        }, {
            source: "天津",
            value: 1,
            target: "河道遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "青龙湾减河河首"
        }, {
            source: "天津",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "红庙村金门闸"
        }, {
            source: "天津",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "筐儿港减河河首"
        }, {
            source: "天津",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "筐儿港减河分水设施遗址"
        }, {
            source: "天津",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "附属遗存",
            value: 1,
            target: "三角坝沉船"
        }, {
            source: "天津",
            value: 1,
            target: "附属遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "附属遗存",
            value: 1,
            target: "东西仓沉船"
        }, {
            source: "天津",
            value: 1,
            target: "附属遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "附属遗存",
            value: 1,
            target: "十四仓遗址"
        }, {
            source: "天津",
            value: 1,
            target: "附属遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "附属遗存",
            value: 1,
            target: "陈庄沉船"
        }, {
            source: "天津",
            value: 1,
            target: "附属遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "附属遗存",
            value: 1,
            target: "双树村沉船"
        }, {
            source: "天津",
            value: 1,
            target: "附属遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "附属遗存",
            value: 1,
            target: "聂官屯沉船"
        }, {
            source: "天津",
            value: 1,
            target: "附属遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "附属遗存",
            value: 1,
            target: "杨村五街沉船"
        }, {
            source: "天津",
            value: 1,
            target: "附属遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "附属遗存",
            value: 1,
            target: "顺直水利委员会旧址"
        }, {
            source: "天津",
            value: 1,
            target: "附属遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "相关遗产",
            value: 1,
            target: "“导流济运”碑"
        }, {
            source: "天津",
            value: 1,
            target: "相关遗产"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "相关遗产",
            value: 1,
            target: "“阅筐儿港减河水坝作诗”碑"
        }, {
            source: "天津",
            value: 1,
            target: "相关遗产"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "相关遗产",
            value: 1,
            target: "天后宫"
        }, {
            source: "天津",
            value: 1,
            target: "相关遗产"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "相关遗产",
            value: 1,
            target: "天妃宫遗址"
        }, {
            source: "天津",
            value: 1,
            target: "相关遗产"
        }, {
            source: "北运河",
            value: 1,
            target: "天津"
        }, {
            source: "河道遗存",
            value: 1,
            target: "北运河段主线（北运河-子牙河）"
        }, {
            source: "廊坊",
            value: 1,
            target: "河道遗存"
        }, {
            source: "北运河",
            value: 1,
            target: "廊坊"
        }, {
            source: "河道遗存",
            value: 1,
            target: "南运河段主线（南运河-卫运河）"
        }, {
            source: "天津",
            value: 1,
            target: "河道遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "天津"
        }, {
            source: "河道遗存",
            value: 1,
            target: "南运河段主线（南运河-卫运河）"
        }, {
            source: "沧州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "南运河段主线（南运河-卫运河）"
        }, {
            source: "衡水",
            value: 1,
            target: "河道遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "衡水"
        }, {
            source: "河道遗存",
            value: 1,
            target: "南运河段主线（南运河-卫运河）"
        }, {
            source: "德州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "德州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "南运河段主线（南运河-卫运河）"
        }, {
            source: "邢台",
            value: 1,
            target: "河道遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "邢台"
        }, {
            source: "河道遗存",
            value: 1,
            target: "南运河段主线（南运河-卫运河）"
        }, {
            source: "聊城",
            value: 1,
            target: "河道遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "马厂减河河首"
        }, {
            source: "天津",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "天津"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "九宣闸"
        }, {
            source: "天津",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "天津"
        }, {
            source: "相关遗产",
            value: 1,
            target: "石家大院"
        }, {
            source: "天津",
            value: 1,
            target: "相关遗产"
        }, {
            source: "南运河",
            value: 1,
            target: "天津"
        }, {
            source: "相关遗产",
            value: 1,
            target: "靳官屯闸碑"
        }, {
            source: "天津",
            value: 1,
            target: "相关遗产"
        }, {
            source: "南运河",
            value: 1,
            target: "天津"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "捷地减河河首"
        }, {
            source: "沧州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "捷地分洪闸"
        }, {
            source: "沧州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "1933年德国西门子启闭机"
        }, {
            source: "沧州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "连镇谢家坝"
        }, {
            source: "沧州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "东光码头沉船遗址"
        }, {
            source: "沧州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "马厂炮台及军营遗址"
        }, {
            source: "沧州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "乾隆御书《捷地、兴济坝工纪事诗碑》"
        }, {
            source: "沧州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "清代宪示碑"
        }, {
            source: "沧州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "泊头清真寺"
        }, {
            source: "沧州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "南运河",
            value: 1,
            target: "沧州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "华家口夯土险工"
        }, {
            source: "衡水",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "衡水"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "郑口挑水坝"
        }, {
            source: "衡水",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "衡水"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "德州码头"
        }, {
            source: "德州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "德州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "四女寺枢纽"
        }, {
            source: "德州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "德州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "四女寺减河河首"
        }, {
            source: "德州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "德州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "德州仓储"
        }, {
            source: "德州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "德州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "苏禄王墓"
        }, {
            source: "德州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "南运河",
            value: 1,
            target: "德州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "朱唐口险工"
        }, {
            source: "邢台",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "邢台"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "油坊码头遗址及险工"
        }, {
            source: "邢台",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "南运河",
            value: 1,
            target: "邢台"
        }, {
            source: "相关遗产",
            value: 1,
            target: "陈窑窑址"
        }, {
            source: "邢台",
            value: 1,
            target: "相关遗产"
        }, {
            source: "南运河",
            value: 1,
            target: "邢台"
        }, {
            source: "河道遗存",
            value: 1,
            target: "会通河段主线（会通河及遗址-南阳新河）"
        }, {
            source: "聊城",
            value: 1,
            target: "河道遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "河道遗存",
            value: 1,
            target: "会通河段主线（会通河及遗址-南阳新河）"
        }, {
            source: "泰安",
            value: 1,
            target: "河道遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "泰安"
        }, {
            source: "河道遗存",
            value: 1,
            target: "会通河段主线（会通河及遗址-南阳新河）"
        }, {
            source: "济宁",
            value: 1,
            target: "河道遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "河道遗存",
            value: 1,
            target: "陶城铺运河"
        }, {
            source: "聊城",
            value: 1,
            target: "河道遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "河道遗存",
            value: 1,
            target: "小汶河"
        }, {
            source: "济宁",
            value: 1,
            target: "河道遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "临清闸（问津桥）"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "月径桥"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "会通闸（会通桥）"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "砖闸（二闸）"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "戴湾闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "土桥闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "梁乡闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "永通闸（辛闸）"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "迎春桥"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "东昌府运河大小码头"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "李海务闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "周家店船闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "七级下闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "七级上闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "阿城下闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "阿城上闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "荆门下闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "荆门上闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "陶城铺闸"
        }, {
            source: "聊城",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "附属遗存",
            value: 1,
            target: "临清运河钞关"
        }, {
            source: "聊城",
            value: 1,
            target: "附属遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "附属遗存",
            value: 1,
            target: "阿城盐运司"
        }, {
            source: "聊城",
            value: 1,
            target: "附属遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "相关遗产",
            value: 1,
            target: "临清舍利宝塔"
        }, {
            source: "聊城",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "相关遗产",
            value: 1,
            target: "临清清真寺、清真东寺"
        }, {
            source: "聊城",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "相关遗产",
            value: 1,
            target: "鳌头矶"
        }, {
            source: "聊城",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "相关遗产",
            value: 1,
            target: "河隈张庄明清砖官窑遗址"
        }, {
            source: "聊城",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "相关遗产",
            value: 1,
            target: "聊城山陕会馆"
        }, {
            source: "聊城",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "聊城"
        }, {
            source: "水体遗存",
            value: 1,
            target: "上泉古泉群"
        }, {
            source: "泰安",
            value: 1,
            target: "水体遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "泰安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "戴庙闸"
        }, {
            source: "泰安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "泰安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "安山闸"
        }, {
            source: "泰安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "泰安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "堽城坝遗址"
        }, {
            source: "泰安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "泰安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "戴村坝"
        }, {
            source: "泰安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "泰安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "禹王庙"
        }, {
            source: "泰安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "泰安"
        }, {
            source: "水体遗存",
            value: 1,
            target: "南旺湖遗址"
        }, {
            source: "济宁",
            value: 1,
            target: "水体遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水体遗存",
            value: 1,
            target: "泗河泉林"
        }, {
            source: "济宁",
            value: 1,
            target: "水体遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水体遗存",
            value: 1,
            target: "浣笔泉"
        }, {
            source: "济宁",
            value: 1,
            target: "水体遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水体遗存",
            value: 1,
            target: "南四湖"
        }, {
            source: "济宁",
            value: 1,
            target: "水体遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "靳口闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "袁口闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "十里闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "运河砖砌河堤"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "邢通斗门遗址"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "徐建口斗门遗址"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "柳林闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "寺前铺闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "漕井桥"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "通济闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "天井闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "太和桥"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "金口坝"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "仲浅闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "师庄闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "枣林闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "南阳闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "利建闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "附属遗存",
            value: 1,
            target: "济宁河道总督府遗址"
        }, {
            source: "济宁",
            value: 1,
            target: "附属遗存"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "大元新开会通河记事碑"
        }, {
            source: "济宁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "开河闸碑"
        }, {
            source: "济宁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "南旺分水龙王庙遗址"
        }, {
            source: "济宁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "济宁东大寺"
        }, {
            source: "济宁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "清雍正疏浚济州河碑"
        }, {
            source: "济宁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "会通河段",
            value: 1,
            target: "济宁"
        }, {
            source: "河道遗存",
            value: 1,
            target: "中河段主线（泇河-皂河-中河）"
        }, {
            source: "济宁",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "济宁"
        }, {
            source: "河道遗存",
            value: 1,
            target: "中河段主线（泇河-皂河-中河）"
        }, {
            source: "枣庄",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "枣庄"
        }, {
            source: "河道遗存",
            value: 1,
            target: "中河段主线（泇河-皂河-中河）"
        }, {
            source: "徐州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "徐州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "中河段主线（泇河-皂河-中河）"
        }, {
            source: "宿迁",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "宿迁"
        }, {
            source: "河道遗存",
            value: 1,
            target: "中河段主线（泇河-皂河-中河）"
        }, {
            source: "淮安",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "淮安"
        }, {
            source: "河道遗存",
            value: 1,
            target: "老不牢河邳州段"
        }, {
            source: "徐州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "徐州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "废黄河徐州吕梁-淮安清口"
        }, {
            source: "徐州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "徐州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "废黄河徐州吕梁-淮安清口"
        }, {
            source: "宿迁",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "宿迁"
        }, {
            source: "河道遗存",
            value: 1,
            target: "废黄河徐州吕梁-淮安清口"
        }, {
            source: "淮安",
            value: 1,
            target: "河道遗存"
        }, {
            source: "中河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "通惠闸"
        }, {
            source: "济宁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "中河",
            value: 1,
            target: "济宁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "微山县乾隆御碑"
        }, {
            source: "济宁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "中河",
            value: 1,
            target: "济宁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "台儿庄月河码头群"
        }, {
            source: "枣庄",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "中河",
            value: 1,
            target: "枣庄"
        }, {
            source: "相关遗产",
            value: 1,
            target: "窑湾镇历史街区"
        }, {
            source: "徐州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "中河",
            value: 1,
            target: "徐州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "疏凿吕梁洪记碑"
        }, {
            source: "徐州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "中河",
            value: 1,
            target: "徐州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "李口吴集月堤"
        }, {
            source: "宿迁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "中河",
            value: 1,
            target: "宿迁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "新袁杨大滩月堤"
        }, {
            source: "宿迁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "中河",
            value: 1,
            target: "宿迁"
        }, {
            source: "附属遗存",
            value: 1,
            target: "龙王庙行宫"
        }, {
            source: "宿迁",
            value: 1,
            target: "附属遗存"
        }, {
            source: "中河",
            value: 1,
            target: "宿迁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "宿迁大王庙"
        }, {
            source: "宿迁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "中河",
            value: 1,
            target: "宿迁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "淮安三百六十丈月堤"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "中河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "双金闸"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "中河",
            value: 1,
            target: "淮安"
        }, {
            source: "河道遗存",
            value: 1,
            target: "淮扬运河段主线（淮安明清运河故道—现京杭运河—扬州城明清运河故道—伊娄河故道）"
        }, {
            source: "淮安",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "河道遗存",
            value: 1,
            target: "淮扬运河段主线（淮安明清运河故道—现京杭运河—扬州城明清运河故道—伊娄河故道）"
        }, {
            source: "扬州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "宝应宋泾河"
        }, {
            source: "扬州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "宝应明清运河故道"
        }, {
            source: "扬州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "高邮明清运河故道"
        }, {
            source: "扬州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "邵伯明清运河故道"
        }, {
            source: "扬州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "古邗沟故道（邗沟东道，扬州城区段）"
        }, {
            source: "扬州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "子婴减河"
        }, {
            source: "扬州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "仪扬运河"
        }, {
            source: "扬州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水体遗存",
            value: 1,
            target: "洪泽湖"
        }, {
            source: "淮安",
            value: 1,
            target: "水体遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "洪泽湖口引河及堤防"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "济运设施"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "御黄束清设施"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "中运河堤坝"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "黄河故道及堤工"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "里运河旧道及堤坝"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "转水墩"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "码头三闸"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "古清口遗址"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "洪泽湖大堤"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "淮安里运河石驳岸"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "清江大闸"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "淮安古运河石码头"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "淮安古运河石堤"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "附属遗存",
            value: 1,
            target: "河道总督署遗址及清晏园"
        }, {
            source: "淮安",
            value: 1,
            target: "附属遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "附属遗存",
            value: 1,
            target: "丰济仓遗址"
        }, {
            source: "淮安",
            value: 1,
            target: "附属遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "附属遗存",
            value: 1,
            target: "淮安钞关遗址"
        }, {
            source: "淮安",
            value: 1,
            target: "附属遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "附属遗存",
            value: 1,
            target: "总督漕运公署遗址"
        }, {
            source: "淮安",
            value: 1,
            target: "附属遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "御制重修惠济祠碑"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "乾隆阅河诗碑"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "高家堰铁牛"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "高良涧铁牛"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "三河铁牛"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "清江浦楼"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "清江清真寺"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "吴公祠"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "陈潘二公祠"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "郑文英墓"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "河下历史文化街区"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "康熙乾隆御碑（淮安）"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "淮安府衙"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "镇淮楼"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "淮安"
        }, {
            source: "水体遗存",
            value: 1,
            target: "瘦西湖"
        }, {
            source: "扬州",
            value: 1,
            target: "水体遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "高邮段里运河东堤"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "茱萸湾古闸"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "宝应跃龙关遗址"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "高邮段里运河西堤"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "高邮御码头"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "耿庙石柱"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "平津堰遗址"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "邵伯古堤"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "邵伯老船闸"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "邵伯码头"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "子婴减河闸"
        }, {
            source: "扬州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "盂城驿"
        }, {
            source: "扬州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "两淮都转盐运使司衙署"
        }, {
            source: "扬州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "扬州城遗址"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "天宁寺行宫（含重宁寺）"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "个园"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "东关街历史文化街区"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "汪氏小苑"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "普哈丁墓"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "仙鹤寺"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "汪鲁门宅"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "何园"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "南河下历史文化街区"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "卢绍绪宅"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "盐宗庙"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "马棚湾铁牛"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "镇国寺塔"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "高邮南门大街历史地段"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "邵伯铁牛"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "江北运河复堤碑记碑"
        }, {
            source: "扬州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "淮扬运河",
            value: 1,
            target: "扬州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "镇江城区运河故道"
        }, {
            source: "镇江",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "镇江"
        }, {
            source: "河道遗存",
            value: 1,
            target: "丹徒河"
        }, {
            source: "镇江",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "镇江"
        }, {
            source: "河道遗存",
            value: 1,
            target: "现京杭运河镇江-常州段"
        }, {
            source: "镇江",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "镇江"
        }, {
            source: "河道遗存",
            value: 1,
            target: "现京杭运河镇江-常州段"
        }, {
            source: "常州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "常州城区运河故道"
        }, {
            source: "常州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "现京杭运河常州-无锡段"
        }, {
            source: "常州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "现京杭运河常州-无锡段"
        }, {
            source: "无锡",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "无锡"
        }, {
            source: "河道遗存",
            value: 1,
            target: "无锡城区运河故道"
        }, {
            source: "无锡",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "无锡"
        }, {
            source: "河道遗存",
            value: 1,
            target: "现京杭运河无锡-苏州段"
        }, {
            source: "无锡",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "无锡"
        }, {
            source: "河道遗存",
            value: 1,
            target: "现京杭运河无锡-苏州段"
        }, {
            source: "苏州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "苏州城区运河故道"
        }, {
            source: "苏州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "现京杭运河苏州-吴江段"
        }, {
            source: "苏州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "江南运河吴江-嘉兴-杭州段"
        }, {
            source: "苏州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "江南运河吴江-嘉兴-杭州段"
        }, {
            source: "嘉兴",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "河道遗存",
            value: 1,
            target: "江南运河吴江-嘉兴-杭州段"
        }, {
            source: "杭州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "杭州中河-龙山河"
        }, {
            source: "杭州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "古新河"
        }, {
            source: "杭州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "余杭塘河"
        }, {
            source: "杭州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "頔塘东段（平望—南浔，含頔塘故道）"
        }, {
            source: "湖州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "湖州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "丹阳开泰桥"
        }, {
            source: "镇江",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "镇江"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "镇江虎踞桥"
        }, {
            source: "镇江",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "镇江"
        }, {
            source: "相关遗产",
            value: 1,
            target: "西津渡古街"
        }, {
            source: "镇江",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "镇江"
        }, {
            source: "相关遗产",
            value: 1,
            target: "新河街"
        }, {
            source: "镇江",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "镇江"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "常州万缘桥"
        }, {
            source: "常州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "常州文亨桥"
        }, {
            source: "常州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "青果巷码头群及古纤道"
        }, {
            source: "常州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "常州飞虹桥"
        }, {
            source: "常州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "常州新坊桥"
        }, {
            source: "常州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "常州广济桥"
        }, {
            source: "常州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "常州万安桥"
        }, {
            source: "常州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "青果巷历史街区"
        }, {
            source: "常州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "大成三厂建筑群"
        }, {
            source: "常州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "常州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "茂新面粉厂"
        }, {
            source: "无锡",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "无锡"
        }, {
            source: "相关遗产",
            value: 1,
            target: "清名桥历史街区"
        }, {
            source: "无锡",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "无锡"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "苏州下津桥"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "苏州上津桥"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "盘门"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "苏州吴门桥"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "苏州灭渡桥"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "宝带桥（苏州）"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "吴江三里桥"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "吴江垂虹纤道桥"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "吴江古纤道"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "吴江安民桥"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "吴江安德桥"
        }, {
            source: "苏州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "三里亭"
        }, {
            source: "苏州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "十里亭（含石碑）"
        }, {
            source: "苏州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "横塘驿站"
        }, {
            source: "苏州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "灭渡桥水文站"
        }, {
            source: "苏州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "寒山寺"
        }, {
            source: "苏州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "皇亭三碑"
        }, {
            source: "苏州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "苏纶纱厂旧址"
        }, {
            source: "苏州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "苏州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "闻店桥（嘉兴）"
        }, {
            source: "嘉兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "长虹桥（嘉兴）"
        }, {
            source: "嘉兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "分水墩"
        }, {
            source: "嘉兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "秀城桥"
        }, {
            source: "嘉兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "司马高桥（嘉兴）"
        }, {
            source: "嘉兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "长安闸"
        }, {
            source: "嘉兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "附属遗存",
            value: 1,
            target: "落帆亭"
        }, {
            source: "嘉兴",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "附属遗存",
            value: 1,
            target: "嘉兴造船厂旧址"
        }, {
            source: "嘉兴",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "嘉兴文生修道院"
        }, {
            source: "嘉兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "嘉兴芦席汇历史街区"
        }, {
            source: "嘉兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "嘉兴月河历史街区"
        }, {
            source: "嘉兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "嘉兴天主教堂"
        }, {
            source: "嘉兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "嘉兴西水驿碑"
        }, {
            source: "嘉兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "新市镇历史街区"
        }, {
            source: "嘉兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "崇德城旧址及横街"
        }, {
            source: "嘉兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "长安镇历史街区"
        }, {
            source: "嘉兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "嘉兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "隆兴桥"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "桂芳桥"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "欢喜永宁桥"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "东新桥"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "坝子桥"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "广济桥（杭州）"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "拱宸桥（杭州）"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "德胜坝"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "杭州龙山闸旧址"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "水利通判厅遗址"
        }, {
            source: "杭州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "乾隆御碑洋关旧址"
        }, {
            source: "杭州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "杭州富义仓"
        }, {
            source: "杭州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "杭州凤山水城门遗址"
        }, {
            source: "杭州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "杭州仓前粮仓"
        }, {
            source: "杭州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "通益公纱厂旧址"
        }, {
            source: "杭州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "杭州拱宸桥西历史街区"
        }, {
            source: "杭州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "闸口白塔"
        }, {
            source: "杭州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "杭州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "南浔丝业会馆"
        }, {
            source: "湖州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "湖州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "南浔镇历史街区"
        }, {
            source: "湖州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "江南运河",
            value: 1,
            target: "湖州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "浙东运河主线"
        }, {
            source: "杭州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "杭州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "浙东运河主线"
        }, {
            source: "绍兴",
            value: 1,
            target: "河道遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "河道遗存",
            value: 1,
            target: "浙东运河主线"
        }, {
            source: "宁波",
            value: 1,
            target: "河道遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "宁波"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "西兴永兴闸"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "西兴过塘行码头"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "浙东运河纤道杭州萧山段"
        }, {
            source: "杭州",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "杭州"
        }, {
            source: "附属遗存",
            value: 1,
            target: "西兴过塘行"
        }, {
            source: "杭州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "杭州"
        }, {
            source: "水体遗存",
            value: 1,
            target: "绍兴鉴湖遗址"
        }, {
            source: "绍兴",
            value: 1,
            target: "水体遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "浙东运河纤道绍兴渔后桥段"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "古纤道（绍兴）"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "八字桥（绍兴）"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "浙东运河纤道绍兴皋埠段"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "浙东运河纤道绍兴上虞段"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "三江闸"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "赵家升船机"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "曹娥老坝底堰坝"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "梁湖堰坝遗址"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "绍兴驿亭坝"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "绍兴五夫长坝及升船机"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "绍兴西陡门闸坝遗址"
        }, {
            source: "绍兴",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "绍兴八字桥历史街区"
        }, {
            source: "绍兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "相关遗产",
            value: 1,
            target: "五夫老街"
        }, {
            source: "绍兴",
            value: 1,
            target: "相关遗产"
        }, {
            source: "浙东运河",
            value: 1,
            target: "绍兴"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "宁波通济桥"
        }, {
            source: "宁波",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "宁波"
        }, {
            source: "附属遗存",
            value: 1,
            target: "宁波水则碑"
        }, {
            source: "宁波",
            value: 1,
            target: "附属遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "宁波"
        }, {
            source: "附属遗存",
            value: 1,
            target: "永丰库遗址"
        }, {
            source: "宁波",
            value: 1,
            target: "附属遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "宁波"
        }, {
            source: "附属遗存",
            value: 1,
            target: "宁波庆安会馆及安澜会馆"
        }, {
            source: "宁波",
            value: 1,
            target: "附属遗存"
        }, {
            source: "浙东运河",
            value: 1,
            target: "宁波"
        }, {
            source: "相关遗产",
            value: 1,
            target: "慈城镇历史街区"
        }, {
            source: "宁波",
            value: 1,
            target: "相关遗产"
        }, {
            source: "浙东运河",
            value: 1,
            target: "宁波"
        }, {
            source: "相关遗产",
            value: 1,
            target: "宁波月湖历史街区"
        }, {
            source: "宁波",
            value: 1,
            target: "相关遗产"
        }, {
            source: "浙东运河",
            value: 1,
            target: "宁波"
        }, {
            source: "相关遗产",
            value: 1,
            target: "庆安会馆天后宫碑记"
        }, {
            source: "宁波",
            value: 1,
            target: "相关遗产"
        }, {
            source: "浙东运河",
            value: 1,
            target: "宁波"
        }, {
            source: "河道遗存",
            value: 1,
            target: "卫河段主线（河南焦作小丹河—现卫河—现卫运河）"
        }, {
            source: "焦作",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "焦作"
        }, {
            source: "河道遗存",
            value: 1,
            target: "卫河段主线（河南焦作小丹河—现卫河—现卫运河）"
        }, {
            source: "新乡",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "新乡"
        }, {
            source: "河道遗存",
            value: 1,
            target: "卫河段主线（河南焦作小丹河—现卫河—现卫运河）"
        }, {
            source: "鹤壁",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "鹤壁"
        }, {
            source: "河道遗存",
            value: 1,
            target: "卫河段主线（河南焦作小丹河—现卫河—现卫运河）"
        }, {
            source: "安阳",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "安阳"
        }, {
            source: "河道遗存",
            value: 1,
            target: "卫河段主线（河南焦作小丹河—现卫河—现卫运河）"
        }, {
            source: "濮阳",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "濮阳"
        }, {
            source: "河道遗存",
            value: 1,
            target: "卫河段主线（河南焦作小丹河—现卫河—现卫运河）"
        }, {
            source: "邯郸",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "邯郸"
        }, {
            source: "河道遗存",
            value: 1,
            target: "卫河段主线（河南焦作小丹河—现卫河—现卫运河）"
        }, {
            source: "聊城",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "聊城"
        }, {
            source: "河道遗存",
            value: 1,
            target: "百泉河"
        }, {
            source: "新乡",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "新乡"
        }, {
            source: "河道遗存",
            value: 1,
            target: "永济渠遗址"
        }, {
            source: "邯郸",
            value: 1,
            target: "河道遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "邯郸"
        }, {
            source: "水体遗存",
            value: 1,
            target: "百泉"
        }, {
            source: "新乡",
            value: 1,
            target: "水体遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "新乡"
        }, {
            source: "相关遗产",
            value: 1,
            target: "卫源庙"
        }, {
            source: "新乡",
            value: 1,
            target: "相关遗产"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "新乡"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "枋城堰遗址"
        }, {
            source: "鹤壁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "鹤壁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "云溪桥"
        }, {
            source: "鹤壁",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "鹤壁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "浚县古城墙"
        }, {
            source: "鹤壁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "鹤壁"
        }, {
            source: "相关遗产",
            value: 1,
            target: "大伾山浮丘山文化景观"
        }, {
            source: "鹤壁",
            value: 1,
            target: "相关遗产"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "鹤壁"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "道口镇码头"
        }, {
            source: "安阳",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "安阳"
        }, {
            source: "相关遗产",
            value: 1,
            target: "道口古城墙"
        }, {
            source: "安阳",
            value: 1,
            target: "相关遗产"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "安阳"
        }, {
            source: "相关遗产",
            value: 1,
            target: "大名府故城"
        }, {
            source: "邯郸",
            value: 1,
            target: "相关遗产"
        }, {
            source: "卫河（永济渠）",
            value: 1,
            target: "邯郸"
        }, {
            source: "河道遗存",
            value: 1,
            target: "洛河隋唐洛阳城段"
        }, {
            source: "洛阳",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "洛阳"
        }, {
            source: "河道遗存",
            value: 1,
            target: "洛河洛口段"
        }, {
            source: "郑州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "郑州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "通济渠荥阳故城"
        }, {
            source: "郑州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "郑州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "汴河遗址北宋东京城段"
        }, {
            source: "开封",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "开封"
        }, {
            source: "河道遗存",
            value: 1,
            target: "汴河遗址商丘南关码头遗址段"
        }, {
            source: "商丘",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "商丘"
        }, {
            source: "河道遗存",
            value: 1,
            target: "汴河济阳镇段"
        }, {
            source: "商丘",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "商丘"
        }, {
            source: "河道遗存",
            value: 1,
            target: "汴河遗址百善老街及柳孜码头段"
        }, {
            source: "淮北",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮北"
        }, {
            source: "河道遗存",
            value: 1,
            target: "汴河遗址宿州段"
        }, {
            source: "宿州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "宿州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "汴河安徽泗县-江苏泗洪段"
        }, {
            source: "宿州",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "宿州"
        }, {
            source: "河道遗存",
            value: 1,
            target: "汴河安徽泗县-江苏泗洪段"
        }, {
            source: "淮安",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮安"
        }, {
            source: "河道遗存",
            value: 1,
            target: "淮河口段"
        }, {
            source: "淮安",
            value: 1,
            target: "河道遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮安"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "天津桥遗址"
        }, {
            source: "洛阳",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "洛阳"
        }, {
            source: "附属遗存",
            value: 1,
            target: "含嘉仓遗址"
        }, {
            source: "洛阳",
            value: 1,
            target: "附属遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "洛阳"
        }, {
            source: "附属遗存",
            value: 1,
            target: "回洛仓遗址"
        }, {
            source: "洛阳",
            value: 1,
            target: "附属遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "洛阳"
        }, {
            source: "附属遗存",
            value: 1,
            target: "洛口仓遗址"
        }, {
            source: "郑州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "郑州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "康百万庄园"
        }, {
            source: "郑州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "郑州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "巩义窑址"
        }, {
            source: "郑州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "郑州"
        }, {
            source: "相关遗产",
            value: 1,
            target: "荥阳故城"
        }, {
            source: "郑州",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "郑州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "西水门遗址"
        }, {
            source: "开封",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "开封"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "西角门子遗址"
        }, {
            source: "开封",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "开封"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "州桥遗址"
        }, {
            source: "开封",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "开封"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "东角门子遗址"
        }, {
            source: "开封",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "开封"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "东水门遗址"
        }, {
            source: "开封",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "开封"
        }, {
            source: "相关遗产",
            value: 1,
            target: "繁塔"
        }, {
            source: "开封",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "开封"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "商丘南关汴河码头遗址"
        }, {
            source: "商丘",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "商丘"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "柳孜运河码头遗址"
        }, {
            source: "淮北",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮北"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "百善镇百善老街河道遗址断面"
        }, {
            source: "淮北",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮北"
        }, {
            source: "相关遗产",
            value: 1,
            target: "柳孜镇遗址"
        }, {
            source: "淮北",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮北"
        }, {
            source: "附属遗存",
            value: 1,
            target: "花石纲遗址"
        }, {
            source: "宿州",
            value: 1,
            target: "附属遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "宿州"
        }, {
            source: "水工设施遗存",
            value: 1,
            target: "龟山御码头遗址"
        }, {
            source: "淮安",
            value: 1,
            target: "水工设施遗存"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "盱眙泗州城遗址"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮安"
        }, {
            source: "相关遗产",
            value: 1,
            target: "第一山题刻"
        }, {
            source: "淮安",
            value: 1,
            target: "相关遗产"
        }, {
            source: "通济渠（汴河）",
            value: 1,
            target: "淮安"
        }]
    },
    PrIf: function(e, l) {
        e.exports = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAMgAAADICAYAAACtWK6eAAAAAXNSR0IArs4c6QAAGkpJREFUeF7tXQuYG2W5fr9Jtt1edpOUtvKIQpFlN2mLKEVAQK20oBQs15bLUQuoVEDgcA4IbBKIbHZR4aCgqOWAUBFtCwVbQLxQKAgFhUKPvSS7FLlZQApNsttu95LMd55ZWsA+LZ1/MjOZSb55nn2Wffpd3+9/mfnnn//7CXIJAoLALhEgwUYQEAR2jYAQREaHIPAhCAhBZHgIAkIQGQOCgDUE5A5iDTfRqhEEhCA1UmhJ0xoCQhBruIlWjSAgBKmRQkua1hAQgljDTbRqBAEhiEuFTnU3jw0QjyN9WAMxN+jMDQQ0aITROtAARgMbf2sA6+gBoQc6Nhu/GejRqNTDxn9r3FNi2phq7HrbpdBr2o0QxMbyL+JZgfWb1rWUNL0ZhBYCjN/NYG4BMM5GV4apjSDqBKOLgS4wOgO61tU0Zm3nbELJZl81a04IUkbpO7qjzaxjKgNTAUyBQQhvXF0AVhKwnDQsb23MGn/LZQEBIYgCaKlcdIIGTNU0fAE6poIwQUG9kqIvgfEYgOUALU9EMq9UMhg/+RaC7KZa7fnmaUx0MkBHgRH1U3F3GSshC/AjxIF74+F1y6oiJ4eSEILsBNj2TbHJHMBpYD4dQJND2HvF7HowLQgGacEVDevWeiUor8QhBNlWieu7m8f2sXY66zidCEd4pUCuxkH0BEq8sBjUF8hbsneRr3mCtOdjRzN4LoBTXB2M3ne2mEu4JblH9k/eD9W5CGuWIG25lpkaaRcxeJpz8FaBZcYjDL4xGelcWgXZKKdQcwRpz7fMZqaLQThcGa1aVmCsINJujIfXLaolGGqGIOlcdA4IFwE4qJYKbHeuzHiegBsTkex8u2170V7VEySdjxpzixSAyV4sgI9jWqMxrm6NZO/1cQ67Db1qCZIqTGoKcjEN0Gm7RUEEykCAFzLq4snwmhfLMOJZ1aokSHs+eiUD7fKWzrVxxwTE4+Hsta55dMlRVRGkoxCbobPeDtCnXMJP3HwQAeZVrGnxZCjz+2oBpioI0tHTNE4vBq8DYU61FMbXeTDma8HiZa0N6zf6Oo9qeARpLzQfy0zzAPq434tRXfHTa0z4tt/vJr6+g7QXYklmvqa6BlZ1ZUNEV8VDmTa/ZuVLgqTemrRnoK40jwgz/Qp8LcVNhKWD/YG5qfFr3/Rb3r4jSNum6PGk4RcA9vIb2DUe7wYimhsPZR70Ew6+Ikh7IXo189Cin1w+RYAYqXgk+z2/hO8bgqQL0dvBOMsvwEqcH4IA4Y5EKHu2HzDyPEHOfXZK3d77994N5hP8AKjEaBIBoiWvvjBy1i0Hrxw0qVERMU8TJNWz3/hgqe5uAJ+vCDri1GkEHi/2Dc5K7fniW047smrfswRp625pIZ0MchxgNTnR8wUCq1njWcnGzk4vRutJgqQLscOg8z0geVPlxUFje0yMDdDo1EQo87Tttss06DmCtOWjxxDjPhBGlpmbqPsJAUYvE05Khr21xddTBNl251gm5PDTyLYxVkYvNJrmpTuJZwgyNOcokUEOWQC0ccz5zhRjAwd4mlfmJJ4gSOrN/cYH6+selgm574azUwGvLgYGp6caKv92q+IEGVrnaNpikENe5To13Pxp9/FX14+aXul1kooTJF2I/U4WAf05gh2PmmhJIpQ50XE/H+KgogSRz0cqWXqf+K7wZykVI0hbLno1kXx46JNhWtEwjXESD1XmA8eKEKS9EDuOmR+oKOri3FcIsI6vJMdkXR8zrhOkffPkj3CxuFL2c/hqfHoh2A3FgcDBbm+6cp0gMin3wljzZwzMWJqMZF39qttVgsgecn8OTC9F7fYed9cI0l6YeCyzXjX9krw0aGotFiJ9RjzU9ZAbebtCkI43msbpIwIrpTWPGyWtBR/8mhYoTXGj75YrBEnnondIU7daGLgu5siYn4hkHd+C7ThB2gqxGcTsq04WLpZZXJWBgEZ0XKvDbU4dJ0g61/I8SHrlljEORHWXCPCqRLjz004C5ChBtnVZ73AyAbFd2wgQ0OpkV3nHCNKWn7wfofhCNfT/re0h6PnsmRHc36nzSRwjSDrfskAOr/H84KqSAHlhItxpnGlv++UIQTpy0ZN1wmLboxWDgsAuEGDGKUkHjoNzhCDpfHS1nAkoY9llBNYkwlnbW0TZTpBtp8ne4TI44k4QgNGa1u7Td20nSFsu+hwRHH31JmNBENgFAs8lwtkpdqJjK0Ha8xNnM/SFdgYotgQBFQQIfFo83LlIRefDZG0lSDoXfRKEw+0KTuwIAsoIMFYkItkjlPV2oWAbQdpyLTOJaIldgYkdQcAqAsx8QjLSudSq/gf1bCNIOhc1mr4dZUdQYkMQKAcBAi2LhzPTy7GxXdcWgrS9Ez2GAvijHQGJDUHADgQIdEw8nPlzubZsIUg6FzU6sZ9SbjCiLwjYiMDiRDh7arn2yiZI6vXmscGRmu8PjC8XSNH3HgL1mj7u0saut8uJrGyCtBdiFzDzT8sJQnQFAUcQIFyYCGXLGptlEyRdiP0FzEc6kqAYFQTKQIAZTyYj2bLGZlkEuaZn4iStpK8pIwdRFQQcRYB0OiA+JmN5jJZFkHQu1gbihKMZinFBoBwEiNKJUCZp1UR5BMlHjQ1RTVadi54g4AIC6xPh7P5W/VgmSHt+4jSGbpzrIZcg4GkECPr0eLhrmZUgLRMkXWi5GUznW3EqOoKAqwgQ/ywR6rzAis8yCBLNgBG14lR0BAFXESBkE6FszIpPSwRJ52L7gPhlKw5FRxCoBAJFxr6pSFZ5zFokSHQOCLJrsBKVFp+WENAZZ18VySqPWasEuR0Ex9s+WkJClASBnSFg8Sg3awTJR/8BYF+phCDgGwQYLyciWeUxq0yQju5os66j0zfASKCCwDYENA0trY3ZLhVAlAnSno+ey8A8FSciKwh4AQEC5sbD2VtUYlEmSDof/Q2AM1SciKwg4BEEfpsIZ89UicUKQYzHq2YVJyIrCHgEga5EONuiEosSQRYxAl2FaFHFgcgKAl5CoDl0QHA23V0yG5MSQTremTRRD5TWmjUucoKA1xDQSoFJrXusXWc2LiWCtOViJxLxfWaNi5wg4DUEmOmkZCTzO7NxqREkH7ucwN83a1zkBAGvIcCgK5LhzA/MxqVEkHQ+dhvA55g1LnKCgPcQoF8mwplvmI1LjSCy/9wsriLnVQSInkiEMp8zG54aQfLRtwCMM2tc5AQBDyKwMRHOjjcbl2mCpLqbxwZ16X9lFliR8y4CRU0flzLZL8s0Qdp69o9RKWD69Zh34ZHIah0BDpQmJhteyJjBwTRB0oXmQ8DaX80YFRlBwNMIUODQRGjt38zEaJog7fnmaQxNmjSYQVVkPhSBempERNsbb5Qst6sqC2GCNj0eXmeqiYNpgsgiYVk1EWUAnxt+Pg4cdjJC2l7v4bGh9Hc81vdjvFR8yjWMVBYLTRMknYt9DcS/ci0LcVQ1CIS1j+E/Rv0SYe3ju8xp1cBiPLjVpR6ETF9PRDJ3mgHYPEE2xc6HxjebMSoygsD7CBDmjL4LHwvs/lzXP25N49mBuxwHTwOd3xrO/NyMI/MEyce+C7DpJXozzkWm+hE4bPg5mFZ/malEi+jHL3pmoKC/bkreuhBdnghnfmhG3zxBpA+vGTxFZgcEzh29FOMC5jt/Ptp3A1b0/6+zODKlExFz/XpNE6S9EPsxM1/sbORivdoQuLDhUTRqe5pO6+n+27Cs73rT8lYEmenGZCTzn2Z0TROkLRf7MZEQxAyoIvM+Apc2PoPhNNo0JH/r/xX+3HetaXkrgkR0YzxkM0HkqAMrpRCd1tBaEDTTQDzR/3M81neTaXlLgk48YqVlkm6pFrWsFKR6XN74vBIErsxB4MAkvSMfO08H/0wpWxGuaQRG0hhc0vikEgauvOrV6YLEmIypsWx6DiILhUp1FmEAxgLhBQ1qR5Xfv7UVfx9weFe3EwuF8qmJjHlVBPYKHIizRi9QUru39xJkBv+gpKMq7MinJnKilGoZRH5S3fE4ceR1SkAs2DIXLxYfV9JRFVY5ccr8I1Zh0iHgknzurlqNGpY/cvh5+EL9RUoI3Lr5JPyrlFXSURYm/dBEqMvez91lw5RyGWpe4SsjOvDJYScp4fD9woEoYUBJR1XYkQ1TsuVWtQwi/7VRd2Lv4MGmgejR/4Wbeqaalrcq6MiWWyOYtDRtsFqTmtS7rHElhtFI07m/Uvwrfr3F8XOZnGnaMEQQaftjuti1Ljg+0IxvjV6iBMNzAwvx0NaUko6ysLNtf6RxnHJBalRhyrAz8OURVyll/3DfD/DXfuVjBJV8AA42jmuT1qOKxahd8RNHXo9JdccpAXDnlq/j1eIzSjqqwo62HpXFQtVy1K78xY1/wWgaaxoAHSVcV5gCY9OUk5fKIqERh+l1EENYjj9wsnTVY9vK/OO14kr8astXHQfB0eMPFvGsQFdhtRyg43gZ/e3gi/WX4PDh5yol8WT/L7C870YlHSvCzaFscDbBmQN0ht5k5aNyBJuVytSQjuouQgOa32z5Bl4qrnAaJWePYNtGEDnE0+ky+tj+XoFP4azRv1XKgKHjh4WDHJ9/AHD+EE85Blqp9jUnfMyIOD4zTG0uYdw5jDuI05crx0B3dEebdR3GY5ZcgsC/IWCsml/YsBz11KCEzP1br8TfB0yfiqZk+4PCmoaW1sZsl4oBpbdY2w2nc9GXQJig4khkqx+Bw4Z/A9PqL1VK1Hit+6PuwzHAvUp6FoRfSoSzn1DVs0aQQvR2MBz/aEY1GZGvHAIB1OGixscwkiJKQawbfAj39f6Xko4lYcYdiUj2bFVdSwS5Jhc9SyPcrupM5KsXASuflhhoLOo9Hy8MPuo8MIyzEpHsfFVHlgiSykUnBAkvqToT+epEYBiNwnkNf1BaOTeQ6ONu3NB9ONj8soR1AJkmJCKZV1QNWCKI4SRdiGbAiKo6FPnqQ2B6/Xdx6HDlpxes6L8Fj/b9yHlACNlEKBuz4qgMgrTcDKbzrTgVnepBYA9tX8xtuB+EgFJSRe7DT3qOQi/nlPQsCRP/LBHqvMCKrmWCyIlTVuCuPp05o39j6miDHTN/ZuBO/GlrhyuAqJwotWNAlgky9JiVj74AoMmVLMWJ5xCI1R2Lk0feoByX8eXuT7q/iM28UVnXgsL6RDhrvr38Dg7KI0gh1gZml44FsgCNqDiGwCjaA3MbHsAICiv7WDVwDx7cmlTWs6Sg0Id3Z/bLIkj7pthk1ni1pcBFybcIGM2ojVOjjO+uVC9j7nFzz9HYzG+rqlqSDwa0yVc0rFtrSVl1P8jOnLTlok8Q4QirAYie/xA4qv6/8dnh37QU+CN91+Op/tss6SorKe4/t/0OMjQPKUS/A8ZPlIMXBV8i8IngEThj1K2WYn9Hfwm39MyEDpe2FOm4MDEm+1NLwW5TKusRy7BxfXfz2D5dc2W2VU6iols+Ah8JRPH1Ub+GsTBo5Zq/+Uz8s6R2HIIVP9t1VPpf7cpP2QQZuovko/cAOKWcZETX2wiM0SYM7fOwMik3MnPtm6v3YVycCGdPLRdVWwjSno8dzeA/lRuM6HsTAeOMwbNGLUSDNt5SgG5PzI0guYQvJffIlj0mbSGIEVB7PvYwg6dZQlCUPIuA8TrXWAyMaHtbjnFp7+VYPbjUsr6yIuORRCRry1i0jSBtuZaZRKTWSk85c1FwE4GQ9lEY/XWN31avVQOL8eBWd5fKmPmEZKTTFkbaRpChuUgu+iQIh1sFU/S8g8C4QBO+Omo+jGPUrF5v6y/i1p6THe/W/m/xMVYkIlnblh1sJUh7vmU2gxZaBVT0vIGAsQB45qhbLb+tMrIwdggaZ33k9FddTYqgnRYPr1tkl1NbCTJ0F8lHVwI4yK4AxY67CBgNF6aN+C6MHYLlXK5thPpAkMx4PhnJ2jr27CdILjoHBKc7EJdTO9HdCQJ1NAJfGXEtYnVfKhufv/TfjMf7ylqfsxaDxV2DH+bMdoJsu4sY32dNtpalaLmNwBhtH5w2ah6M3+VelZiUb4t5TSKcPaDc+HfUd4ogxqKhsXgol4cR0BCA0Ynkc8PPQ5Dqy460a/AR3NN7IYxGcG5fGuOU1kj2Xrv9OkKQd+8iLQsAOs3ugMWePQh8NPBJzBz5fRg7Au24jObTd205GyUM2mFO0QYvTIQ7T1dUMiXuGEFShUlNQS4ZTboc82EqQxH6NwSMpm7T6y/HgcPs+zJoY2k95m85E/3cUwm0mRHcPxle86ITzh0dvO356JUMuLOv0gl0qsimQYxDhp811Ba0nhpty+yN0hrcteWcSpHD+L9vazycvda2hHYw5ChBtj1qPQ+Q+s4apzKuMbvGQt9nh5+Dg4adoXSgphmYXio+hUVbznOj6fTOw2FelYh0ftpMrFZlHCdIRyE2Q2d+0GqAoqeOQB3VoyV4NCbWHYtP1B1Z9prGziJYM3g/lvZe6U5Pq11AwETHJUOZ36sjZF7DcYIM3UVy0TtAmGM+LJFURWA4NWBC8BAcUHciWuqmq6oryT/dfxuW9V2vpGO7MGN+IpJ1vP2tKwTp6Gkap5cCKwH6uO1A1ahBY2Fv78BnhkixT/BQ7BmIKfemUoXO+Gz9ga1JrB18QFXVZnl6TQsMTmltWO/4Rj1XCGKg07YpNoM0edQyM1KMTUnGUQJDPxiJ4dQ49Dp2TGDC0GLeHtoEhLS9zJiyTWaT/gru6f0OjDdWlb7ceLTanqNrBDEcthdiSWa+ptIAe83/p4adgv2DR+GjwQMwmsZ5LTxkBh/C/VvjGOStFY+NiK6KhzJtbgXiKkGGSJKLLmHCTLcS9LIfY95w4sjr0BT8gifDNBb9Ht76Azw7cJcn4iPC0ngoe4KbwbhOkNTmSXsGi6VnAbj7jOAmqqZ80VBvqY8FHH1LaSqSnQm9WnwWv996FYxOJB65NhQHAgenxq990814XCfIu/OR6PGk4X43E/War0OHz8H0+iu8Fha28DtYtvWH7m6RNYECER0fD2VcXy6oCEHenY9Er2ZGygQ2VSli5ahkJ4EwPjB8bmAhHu27Af282UlXyraJkYpHst9TVrRBoWIEMWJP1+hRbsYxZZc0On4muKnhYRxes3bwQTzed7Pru/9MBUi4IxFSPzrNlG0TQhUlyLskif0OzK5OvEzg4qiI0YDtm6Pvc9SHGePGHeOp/luR1/9pRtx9GaIliVDmRPcdv++x4gQ599kpdXs3bXkYwOcrCYSbvjUEcUXo/2A0gXb7Mhb7Vg0uxpN989w6fsBqio+/un7U9FsOXlmJ7+ffi7niBDEiSfXsNz5YqjNIYvuOMKvVcVrvW6OXYHyg2Wk3Q/aN+YXxVspYAV83+IeKfXmrkOzqYt/g9NSeL76loOOIqCcIYmTW1t3SQiVaBqqN178T62bgpJH/40hRtxt9s5QZIoXx06NXfKyZy5WxgQM8LdnY2WlOwVkpzxBk23zkMOhskGSks2l7w/qXR1wF4/hkuy6jD9U/i8/jH8UVeK34jGtncNgVPxi90GhaIpR52jabZRryFEGG7iT56DHEuK9WSGJ0EfnSiCSMFp9mL+PwmW79dRT015HXN+BfpQyMvRm9vMmsCe/JMXqZcFIyXH4/XTuT8xxBPnAnuadWHreMnPcMTMRegQOHuqcPYisGuW/od5H7h76BGsCWoccktxux2TnYdmmLsQEaneqlO8f2WD1JkPfmJDrdXUsTd1cGo/ecrGaNZ3llzrEjPJ4liBFo6s39xgfr6wyS1MwrYO+NX0cjerwYGJyVaqj826pdZelpghhBD62T7N97d60tJjo6LL1gnGjJqy+MnFXpdY7dQeF5gmxPoFY/S9ldAX357xX+fEQFM98QZGhekoteTVS7HziqFNarskb94qHKfHhoBRNfEcRIsL0QO46Z58l+EivlrqjOBtbx7eSYbKU3tCuB4DuCDJFk8+SPcKk0T+YlSrWumDAxlg7WBeamRru72cmOhH1JkO2Jyx53O4aAszbc3kNudza+Jsi7j1wTj2UuzZOWQnYPjXLt8Wusa99OjnG2sVu5Ue5O3/cEMRLseKNpnF4fvE6a0+2u3C79O2O+Fixe5kbfKqczqgqCbAeprRCbQbreDpJewE4PnJ3b51UaafFWh9uBuplbVRHkvbnJu13l2+XoBdeGEhMQd7LLumuZ7OCoKgli5NiWn7wfYbBdDvFxemjxQkZd3KnzOZyOfnf2q5Yg2xPvyEVP1glGRww5M3F3o0Ht39cw4+qkA8eeqYXhrHTVE2Q7fOlcdA4DFxPBm53anK2zndafA+OmRCQ7306jXrVVMwR5f34ycTazfjEIh3u1KJ6Mi7GCiG+MhzsXeTI+h4KqOYK898Yr1zKTQAZRjnII26owS6BlOus3JSOdS6siIcUkapYg7xHlnegxpOFcEOw71VKxCB4VX0ygefFw5s8ejc+VsGqeINtRTr3ePLZuVOA0Bk4H85GuoO8xJ8x4kjQsqCd9waWNXW97LLyKhCME2Qns1/RMnKQV+XQQG2dvN1WkMu45XQ+iBVTCwviYzBr33PrDkxBkN3Vqz0+cxlQ6GaCjwIj6o6y7iZKQBfgRYr43Hu5aVhU5OZSEEEQB2HQutg/AUwFMBcE49WZfBfXKiTJehobluo7HdGB5KpJ9uXLB+MuzEKSMenV0R5tZx1Q2CANMAeBOL9Hdx9wFYCUBy0nD8tbGrPG3XBYQEIJYAG1XKosYgfWbJrWUNL0ZhBYyCENoBnMLALsPH9wIok4wuhjoAqMzoGtdTWMmds6mu0s2plXTpoQgLpU/1d08NkA8jnRqIEaDzoEGAhrAaICG0cZv0tCg6wABPSD0aECPztjMQI9G1MPGjzbQU2LamJK3TK5UTgjiCszixK8ICEH8WjmJ2xUEhCCuwCxO/IqAEMSvlZO4XUFACOIKzOLErwgIQfxaOYnbFQSEIK7ALE78ioAQxK+Vk7hdQUAI4grM4sSvCAhB/Fo5idsVBP4fBrbrMsi/GfAAAAAASUVORK5CYII="
    },
    Qql9: function(e, l) {
        e.exports = {
            name: "杭州",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "江南运河",
                    value: "江南运河的历史可追溯至春秋战国时期（前770 ～前221），是由沟通自然河道的若干运河组成，如沟通苏州和无锡之间的泰伯港、吴越两国间沟通长江和钱塘江的百尺渎、无锡一带通太湖的语昭渎、自苏州向西北经常州北境通长江的吴古故水道等。隋代对江南运河进行全线整治，始称江南河，南宋时称浙西运河，今称江南运河。江南运河，又称江南河、浙西运河，是京杭运河在长江以南的一段，北通长江，南达钱塘江，连通长江、太湖、钱塘江三大水系，至今仍全线通航。江南运河位于长江三角洲地区，以太湖水系为中心，北起长江南岸的江苏镇江京口，东南经常州、无锡，绕太湖东岸达苏州、吴江、平望，然后进入浙江嘉兴，折而西南，又经崇德、长安、临平，最终到达杭州，全长340 千米。江南运河是富庶的江南地区与北方相通的水运干道，航运条件良好，也是京杭运河运输最繁忙的航道。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "凤山水城门",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "凤山水城门。杭州城古代曾有五水门，凤山水城门是惟一尚存的一座，是杭州城重要的历史坐标。元末张士诚起义军占领杭州，至正十七年（1357），为巩固城防，发动民众重筑杭州城。城墙东面自艮山门至清泰门，向东扩展3里，扩至东河以东；南面自候潮门以西收缩2里，将凤凰山南宋故宫划出城外。城设旱门10座，水门5座，凤山水门即为其一。它与凤山门（旱门）并列，原与古城墙相接。水城门在明清两代经过历次维修，辛亥革命后，杭州城城墙、城门先后被拆除，此门却得以存留。水城门城楼已毁，城门残长9.95米，残高3.8米，宽12.8米。尚存单拱门洞，由三层不同跨径的石拱券并联而成，以纵联并列分节法砌筑，门洞北侧券高2.8米，跨径5.7米，南侧券高1.92米，跨径4.3米。南拱券中还有方形石砌闸槽，闸档后有石雕门臼，原安有两扇木门可以启闭，现已无存。门洞上城门南北两侧墙壁包砖，内筑夯土。"
                }, {
                    name: "富义仓",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "富义仓位于杭州市拱墅区富义仓巷及霞湾巷一带，在大运河主航道与胜利河交汇处。富义仓原有4排仓库，可存储稻谷4万～5万石，内有砻场、碓房、司事者居室等，运粮船只停泊处还建有一亭，以供民工休息。现仓库基本格局仍存，保留有3排仓库和装卸货物的河埠，河埠临胜利河北岸而建，青石叠砌。沿石阶而上谓富义仓南入口，入口形似门廊，以两根木质圆柱承托屋檐，柱下置石础，条石墁地。富义仓初建于清光绪六年（1880）十二月，竣工于光绪七年七月，是杭州现存惟一的古粮仓。明清时期，拱宸桥至德胜桥一带是京杭运河水运货物的重要集散地，外来粮食多经此转运，由此形成了杭州最出名的米市，而储存粮食的仓廒也多集中于此，其中比较著名的大兴仓库有永济仓、盐义仓、富义仓等。清末民初修建浙赣铁路，米市移向别处，湖墅米市也逐渐衰落，大部分粮仓由此废弃，而惟独富义仓幸运地保存下来。"
                }, {
                    name: "拱宸桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "拱宸桥明崇祯四年（1631）始建，此后周边逐渐形成街市。清康熙五十六年（1717）重建，附近的拱墅运河历史街区日渐繁华。同治年间，拱宸桥地区成为繁盛的水陆码头。光绪十一年（1885）再次重建，王麟书作《重建拱宸桥记》：“桥长二十一丈尺，广一丈三尺，桥下三洞，中洞广四丈六尺，左右洞广二丈六尺”。清末至民国期间，拱宸桥及周边街区是运河沿岸航运、个体工商业者、近代产业工人的聚居区和杭州近代的重要商业中心。拱宸桥2005年进行维修，2006年与桥西历史文化街区作为京杭大运河的一部分，被列为第六批全国重点文物保护单位。"
                }, {
                    name: "小河直街历史街区",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "小河直街历史街区位于杭州市北部拱宸桥南。今在小河直街两侧仍能看到工场、会所、店铺、仓廪、旅舍、茶馆、民居、码头、河坎、河埠等民国时期的遗迹。小河直街因境内之京杭运河支流小河而得名，京杭大运河、余杭塘河、小河三条河流在此交汇，为杭州城北运河文化的重要区域，也是杭州城北运河的交通枢纽。隋唐以来，尤其是南宋时期，拱墅地区成为杭州城北重要的物资集散地、河陆转运地、码头、物资储备地，附近北关市、湖州市、江涨桥市等也很繁华。"
                }, {
                    name: "宋皇城遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "宋皇城遗址位于杭州凤凰山麓。现残存的遗址深埋地下，地面仅存部分北城墙遗迹，皇城后苑及周围地区尚存宋高宗“忠实”摩崖题刻、南宋淳熙十四年“凤山”题刻、五代圣果寺遗址等遗迹。宋室南渡后，绍兴元年（1131），宋高宗诏守臣徐康国利用原州治筹建行宫。绍兴四年至二十八年扩建宫城及东南外城，使整个皇城范围东起中河南段以西，西至凤凰山，南自笤帚湾，北达万松岭，方圆9里。皇城四面各开一大门，南称丽正门，是皇城的正大门，北、东、西分别为和宁门、东华门、西华门。皇城内经过历年修建，到南宋后期有殿、堂、楼、阁、台、轩、观等130余座，建筑鳞次栉比，金碧辉煌。整个皇城充分利用山势精心规划布局，将主要宫殿置于较高的南部，显得巍峨壮丽，其中大庆殿为正殿，此外还有皇帝日朝的垂拱殿及后殿、延和殿、端诚殿、崇政殿、钦先孝思殿、复古殿、福宁殿、坤宁殿、选德殿、勤政殿等。皇城东部为东宫。后苑在西北部，“怪石夹列，献瑰逞秀，三山五湖，洞穴深杳”。德祐二年（1276），元军攻入杭州，不久宫室遭火焚毁过半，残留宫殿改为报国寺、小仙林寺、尊胜寺、兴元寺、般若寺。到明万历年间大殿基本坍毁，整个皇城渐成废墟。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "从现有考古资料看，杭州地区的人类社会历史最早可追溯到距今四五千年前的良渚文化时期，但杭州城的出现则要晚得多，它是秦统一全国后随着钱唐县的设立而逐渐形成的。秦始皇二十五年（前222），秦军平定江南地区，随即在吴、越故地设立会稽郡，其中在今杭州一带设立钱唐县。"
                }, {
                    name: "东汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦亡汉兴，承袭秦制，继续保留钱唐县建制。王莽时，改名泉亭，旋复旧名。东汉前期，一度裁并，不久又恢复设置。永建四年（129），以会稽郡浙江以西诸县设吴郡，郡治袭县治，未几仍复为县。"
                }, {
                    name: "三国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "三国吴分余杭立临水县，晋改临水为临安，陈为钱唐郡。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋王朝建立后，于开皇九年（589）废郡为州，“杭州”之名第一次出现。并桐庐入钱唐县，下辖钱唐、余杭、富阳、盐官、於潜、武康六县。州治初在余杭，次年迁钱唐。隋开皇十年（590），杭州治所迁移到钱唐县凤凰山麓的柳浦，即今杭州城南、钱塘江北岸南星桥一带。开皇十一年，杨素依凤凰山筑城，《太平寰宇记》卷九三《江南东道五杭州》云：“隋平陈，废（钱唐）郡，改为钱唐县，又省陈留为绥安县，割吴郡之盐官、吴兴之余杭，合四县置杭州，在余杭县，盖因其县以立名。十年，移州居钱唐城。十一年，复移州于柳浦西，依山筑城，即今郡是也”。大业六年（610），自京口至余杭800余里的江南运河开挖。杭州城址的选择在前，江南运河开挖在后，城址的选择与运河无关。但是，杭州城随后的发展和形态，却与运河血肉相连。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋唐时期南北统一，大运河兴修，迁都长安，杭州地处大运河终端，成为东南交通枢要，地位急剧上升。唐代，置杭州郡，旋改余杭郡，治所在钱唐。因避国号讳，于武德四年（621）改“钱唐”为“钱塘”。太宗时属江南道，天宝元年（742）复名余杭郡，属江南东道。乾元元年（758）又改为杭州，归浙江西道节度，州治一度在钱塘，辖钱塘、盐官、富阳、新城、余杭、临安、於潜、唐山八县。安史之乱以后，北方战乱频仍，经济重心南移，太湖流域的江南成为王朝的经济核心区，杭州于历史过程中在区域社会中的重要性逐渐凸显。唐代后期，杭州已是一幅“骈樯二十里，开肆三万室”的兴旺景象。在元和八年（813）朝廷任命卢元辅为杭州刺史的制文中，已经出现“江南列郡，余杭为大”的赞誉。杭州在唐代繁盛程度或不及姑苏、会稽，钱镠父子数十年经营之下，杭州的交通、军事地位日渐显现，跃然成为东南第一大都市。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "南宋王明清在《玉照新志》卷五中写道：“杭州在唐，繁雄不及姑苏、会稽二郡，因钱氏建国始盛。请以其西境言之：北有常润，下连大江，浙西观察使治所在京口，盖相距数百里形势也。其东沧溟，虽海山际天，风涛豪状，然海门中流至浅狭，不可浮大舟，匪夷狄能窥。其南则浙江以限吴越，惟州西境无大山长川，虚怯可虞”。北宋时，杭州为两浙路路治。淳化元年（990），废润州（今江苏镇江）之京口、吕城，常州之望亭、奔牛，秀州之杉青，杭州之杆江等旧堰而建闸，使之更有效地调节运河水量，便利通航。大观元年（1107）升为帅府，辖钱塘、仁和、余杭、临安、於潜、昌化、富阳、新城、盐官九县。元祐四年（1089），著名文学家苏东坡任杭州知州，再度疏浚西湖，用所挖取的葑泥，堆成横跨南北的长堤（苏堤），上有六桥，堤边植桃、柳、芙蓉，使西湖更加美化。宋代的文学作品中展现了杭州富丽繁庶的景象。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "宋元易代，杭州的都市经济并未受到太大的破坏，“九衢之市肆不移，一代之繁华如故”。元至元年间，行至杭州的马可波罗赞叹杭州是世界上最美丽、最华贵的天城。元至元十三年（1276），设两浙大都督府，又改设安抚司。十五年（1278）升杭州路，为江浙行省省会。元世祖忽必烈定都燕京，北方多年战乱，民生凋敝，元都仰给于江南，运河的贯通更为紧要。元代重视交通网络的建设，“陆有马站，水有水站。州县凡十里立一铺，大事则遣使驰驿，起船马有札子，小事文书以铺兵传送”。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明代改杭州路为杭州府，为浙江承宣布政使司治所，钱塘、仁和附郭。“两浙为东南奥区，领郡十一，而杭为首郡，九县属焉。钱塘、仁和并附于郭；海宁在其东；余杭、临安在其西；富阳、新城，郡西南也；于潜、昌化，郡西北也”。明清时期，大运河对杭州城的发展同样意义重大。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清顺治二年（1645），置浙江巡抚，驻杭州。康熙元年（1662），浙江承宣布政使司改为浙江行省，杭州为省会。雍正二年（1724）、嘉庆五年（1800），浙江总督李卫、巡抚阮元先后再次疏浚西湖，挖起大量葑泥，使湖水加深数尺。"
                }, {
                    name: "近代",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "随着资本主义势力的侵入和洋务运动的兴起，杭州的近代工业也逐渐发展起来。1912年，废杭州府，合并钱塘、仁和两县为杭县，仍为省会所在地。1914年设道制，置钱塘道，道尹驻杭县。原杭州府所辖各县归钱塘道管辖。1927年废道制，析出杭县城区设杭州市，直属浙江省；郊区仍为杭县，旧属诸县直属于省。从此，杭州确立为市的建制，市区分为8个区。"
                }]
            }]
        }
    },
    RtvE: function(e, l) {
        e.exports = {
            name: "洛阳",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "永济渠",
                    value: "隋唐永济渠，宋代称御河，明代至今称卫河。上源由发源于太行山以西的河道汇流而成。隋代始建时，永济渠从卫县（今浚县西南）引淇水入渠，渠东北行，经今河南浚县，循黄河屯氏河故道至山东临清，北抵涿郡（今北京境内）。永济渠在今山东德州以上的河道呈天然河道的基本形态，水量丰枯变化大，且均为高含沙水流。永济渠位于黄河以北的华北平原，多年平均降水700 ～ 880 毫米，降水时间集中在5 ～ 8 月，占年降水量的55% ～ 80%。华北平原地势平衍，呈西北高东南低地势，平均高差约0.01%。永济渠沟通了太行山的沁水、洹水、漳水、滹沱水等水系，由此形成海河南系的干流。但是，永济渠上中游河道受黄河洪水和泥沙的困扰最大，黄河向北改道，通常夺永济渠水道，以至于冲决堤防、湮塞水道。"
                }, {
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "通济渠",
                    value: "隋炀帝开凿永济渠和通济渠，系统地整治了山阳渎（邗沟）、江南运河，建立了以东都洛阳为中心的大运河。永济渠从洛阳向北直抵涿郡（治蓟，今北京西城区西南）。通济渠向东南与淮河相通，将前代开凿的淮扬运河、江南运河联系起来，建成了南至钱塘江口（宋代延伸至宁波出海口），跨越南北，沟通全国政治中心与经济中心，并兼顾军事需要的大运河系统。通济渠（汴河）是中国内陆两条最重要的江河——黄河和淮河之间的运河，它的建设和运用使隋唐宋三代拥有了统一帝国强大的经济纽带，同时这条600 年来连续运用的水路大动脉更是见证了中国最重要的隋唐宋三代王朝的兴衰与更迭。通济渠（汴河）的运用正值中国最富庶的朝代——唐宋时期， 唐代日本遣唐使、宋代日本僧人北上朝佛都是经由江南运河和通济渠北上，大运河因此为唐宋时期中国与日本的文化交流提供了条件。隋代通济渠，唐代又称广济渠，宋时称汴河或汴渠。隋大业元年（605），隋廷在地方性运河的基础上，统一勘察设计，统一施工修建了通济渠，并于一年之内完成全线建设施工。 其完善和经营主要是在唐代和北宋。南宋建炎二年（1128），守军杜充为阻止金兵南下，决黄河堤，导致黄河全河改道，汴河迅速被黄河泛滥所带来的泥沙所湮埋。通济渠是受黄河影响最大的运河。通济渠（汴河）经历了黄河南行期间淮北平原沧海桑田的巨大演变过程。通济渠（汴河）沟通江淮，位于淮北平原，分别以黄河、淮河及区间塘泊为水源。较好的自然条件使通济渠水道平直，工程设施较少，几乎没有拦河堰埭。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "宇文恺",
                    value: "宇文恺（555～612），字安乐，京兆长安（今陕西西安附近）人，隋代著名建筑学家、水利学家。他不但修建了隋都大兴城与东都洛阳城，而且负责设计、开凿了广通渠，解决了大兴城的粮食供给问题，为永济渠、通济渠的开凿提供了经验与借鉴。"
                }, {
                    name: "杨广",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "隋炀帝杨广（569～618），隋朝的第二位皇帝，弘农郡华阴（今陕西华阴）人。初为晋王，曾领兵讨平陈，后被立为太子。即位后，在政治上实行了一系列改革，开凿大运河，营建东都洛阳，一度使隋朝国力达到鼎盛。他穷兵黩武，发动对吐谷浑、高句丽的战争，导致国困民乏，百姓起义不断，最后身死国灭，王朝倾覆。"
                }, {
                    name: "于頔",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "于頔（？～818），字允元，唐代河南（今河南洛阳）人。初以恩荫入仕，补千牛，自华阴尉累迁侍御史，后任吐蕃计会使、长安令、驾部郎中等职。元和十三年（818）因病去世。"
                }, {
                    name: "李渤",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "李渤（773～831），字濬之，唐代洛阳（今属河南）人。李渤是后魏横野将军、申国公李发的后代。其父李钧，任殿中侍御史，因母亲去世不按时守丧，被流放到施州（今湖北恩施）。李渤为家中有此污点而羞耻，立志不做官，先后隐居在嵩山、少室山，以读书撰述为业。唐宪宗元和初年，户部侍郎李巽、谏议大夫韦况交替荐举他入朝担任右拾遗，均被其拒绝。后在洛阳令韩愈的劝说下，方出山为官。他见朝廷施政有得失，便奉寄奏疏进陈议论，另撰有《御戎新录》20卷，附表进献朝廷。元和九年（814），朝廷讨伐淮西，李渤以著作郎征召，次年升为右补阙。因上章冒犯了皇帝，调任丹王府咨议参军，后任库部员外郎。大和五年（831），被征召为太子宾客，回朝后仅1个多月便去世，朝廷追赠为礼部尚书。"
                }, {
                    name: "成寻",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "成寻（1011～1081），俗姓藤原氏，日本平安时代中期天台宗僧人。成寻7岁时入岩仓大云寺学佛，后任该寺主持。熙宁五年（1072），成寻前往中国求法。成寻后返回日本。但按照宋朝的规定，外国僧人来华学法，需经枢密院批准。所以，当他到达台州（今属浙江）后，台州地方官即以其所请呈报枢密院。神宗得到呈报，很快颁发圣旨，令台州派人护送成寻一行到达汴京。于是成寻由台州乘船而上，经运河走水路到达京师。十月，成寻一行乘船走汴河到达洛阳，在洛阳和汴京先后巡礼了大相国寺、太平兴国寺、启肇禅院、显圣寺、感慈塔、开宝寺、福圣院等著名寺院。十一月初，成寻去五台山巡礼，返回洛阳后，由于神宗的一再挽留，又在洛阳居住近一年。直到次年六月，成寻返回天台山，继续修行。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "含嘉仓遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "含嘉仓遗址。隋大业年间在洛阳城东北建含嘉城，据《大业杂记》载：“门东即东城门东街，北行三里有含嘉门，门北即含嘉城”。《读史方舆纪要》记之更详：“含嘉城在东都城北。隋含嘉仓城也。王世充与李密战，败于巩北，奔还东都，屯含嘉城。又唐武德三年，世民伐王世充，世充使其子玄恕守含嘉城。开元中，亦置含嘉仓于此”。唐朝自从裴耀卿漕运改革之后，新筑的河阴仓取代了含嘉仓而成为全国最大的粮仓，甚至之前不甚起眼的太原仓也崛起而成为第二大仓。至于含嘉仓，在唐后期的漕运史上已很少提及，地位可谓一落千丈。20世纪70年代起，在隋唐洛阳城东城之北，勘探和发掘了含嘉仓遗址，对仓城方位、轮廓、粮窖和道路均有不同程度的了解。含嘉仓城紧靠洛阳老城区北侧，仓城北墙与洛阳故城北墙重合，残存城墙约17米。仓城东西长约600米，南北长约700米。仓城内粮窖分布密集，窖呈水缸形。有些粮窖还残存有当时的谷物。通过对粮窖的分析，揭示了其基本的形制结构。此外，在粮窖中还发现有铭砖、灰砖、灰瓦、陶瓷残片、铁器、铜钱等遗物。其中，铭砖的发现，为研究含嘉仓的历史提供了重要线索。"
                }, {
                    name: "回洛仓遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "回洛仓遗址。回洛仓位于孟津县东的回洛城，建置于隋大业年间。《读史方舆纪要》载：“隋大业二年，于其地置回洛仓，仓城周回十里，穿三百窖。十三年，李密遣兵袭回洛东仓，破之。既而据回洛仓，大修营堑以逼东都。隋段达等出兵拒之，战于仓北，隋兵败走。未几，达等复陈于回洛仓西北，密战败，奔还洛口。寻败隋兵，复取回洛。武德三年，世民攻王世充，分遣怀州总管黄君汉自河阴攻回洛城。君汉遣其将张夜以舟师袭回洛，克之。世充使其子玄应来攻，不克，乃筑月城于其西，留兵守之”。回洛仓遗址位于洛阳故城外东北方向的小李村、马坡村一带。2012年以后，洛阳市文物考古研究院对遗址进行了考古发掘，据整理发现，其仓城的形制为方形，由中部的管理区、东西侧仓窖区、道路与漕渠几个部分组成。仓窖数量约700座，呈水缸状，排布整齐。从已清理完成的仓窖窖藏能力推算，整个回洛仓的总储粮量可达3.85亿斤。唐以后，回洛仓不再见诸记载，考古学分析也证实该仓的使用时间短暂，隋亡以后即被弃用。"
                }, {
                    name: "太原仓",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "太原仓位于陕州西南方位，原为隋朝所开之常平仓。《读史方舆纪要》载：“太原仓，在州西南六里。隋开皇三年所置常平仓也。唐贞观三十一年，复置焉。开元二十二年，裴耀卿建转输之法，江淮舟运，悉输河阴仓，更用河舟，运至含嘉仓及太原仓，自太原仓入渭，输关中，是也。宝应初，回纥助唐讨史朝义，自大阳津渡河，食太原仓粟。贞元二年，淮西兵自□州叛归，李泌遣兵伏于太原仓之隘道，击之。《志》曰：太原仓北临焦水，西倚大河”。裴耀卿漕运改革以后，位于河阴仓与永丰仓之间的太原仓成为第二大仓，每年大约有70万石漕米运抵太原仓，是漕粮由河南转输关中的重要中转站，唐廷为方便管理此地漕运和仓储，一般以陕州刺史兼领水陆运使。"
                }, {
                    name: "漕渠遗迹",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "漕渠遗迹原名通远渠，开凿于隋炀帝大业二年（606）四月，为洛阳城内的漕运枢纽。据《大业杂记》载：“四月，勅土工监丞任洪则开东都漕渠，自宫城南承福门外分洛水，东至偃师入洛，名通远渠。又迮洛水湍浅之处，名千步陂，渚两碛东至洛口，通大船入通远市”。据《唐两京城坊考》载：“漕渠。本名通远渠，自斗门下枝分雒水，东北流至立德坊之南，西溢为新潭。又东流至归义坊之西南，有西槽桥。又东流至景行坊之东南，有漕渠桥。又东流经时邕、毓财、积德三坊之南，出郭城之西南”。2012年以后，洛阳市文物考古研究院在位于老城区的南关码头以西数十米处发现了漕渠遗迹，长约300米，宽约70米。在对隋唐城外的钻探中，发现隋唐以降，因洛河河道的大幅度北摆，已将漕渠遗迹冲毁。"
                }, {
                    name: "新潭遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "新潭遗址新潭是隋唐运河洛阳段的漕运码头，开凿于武则天时期，用于停泊各地船只。据《旧唐书》载：“大足元年六月，于东都立德坊南穿新潭，安置诸州租船”。《新唐书》载：“有洛漕新潭，大足元年开，以置租船”。张环《新潭赋》云：“分逶迤之旧洛，涨浩漾之新潭。观其沙石中映，鱼龙内涵；泛危槎而独隐，纷众水以相参。原夫引派潜回，疏源洞出；淙石门以雷注，透金塘而箭疾”。王泠然亦曾作《新潭赋》：“国之天府，名曰河南，水有清洛，涨乎新潭。夫其贯都成川，习坎为德，石门呀豁而洞泻，绿树逶迤而夹植。源自山来，漕因人力，或清浅而见底，或深沈而莫测，奔狭口以雷声，积中心而黛色”。南宋以后，随着隋唐大运河的湮废，新潭也随之干涸而被废弃。2014年以后，考古队在河南府文庙东侧80米及文峰塔东侧30米的区域内均发现有新潭遗迹及遗物，新潭遗址的发掘，为隋唐大运河的漕运情况提供了可靠的实物资料。"
                }, {
                    name: "天津桥遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "到了金代逐渐废弃。民国时期，吴佩孚在洛阳城重修天津桥。如今，洛阳天津桥遗址是隋唐运河申遗的重要组成部分。"
                }, {
                    name: "汉魏洛阳故城",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "汉魏洛阳故城在洛阳城东约15千米处。东据虎牢，西控函谷，洛水穿城而过，是一座依险而建，因水而兴之城。西周始建东都洛邑，东周敬王之时迁都于此。据《括地志》载：“故王城，一名河南城，本郏鄏，周公所筑，在洛州河南县北九里苑内东北隅。自平王以下十二王皆都此城，至敬王乃迁都成周，至赧王又居王城也……左传云成王定鼎于郏鄏”。西汉建国之初曾都洛阳，后迁至长安。东汉以洛阳为都，魏晋时期因袭之。《读史方舆纪要》载：“东汉初，定都于此，城郭益以宏壮。魏晋亦相继都焉。汉雒阳城凡十二门，魏晋因之”。前后千余年，汉魏两代为繁盛时期，故称汉魏洛阳故城。北宋司马光曾作《过洛阳故城》一诗云：“烟愁雨啸奈华生，宫阙簪裾旧帝京。若问古今兴废事，请君只看洛阳城”。2014年6月，汉魏洛阳故城作为丝绸之路河南段遗址，被列入世界文化遗产名录。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "夏",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "夏朝初年，禹划九州，河洛属古豫州地。洛阳是夏王朝立国和活动的中心地域，太康、仲康、帝桀皆以斟鄩为都。"
                }, {
                    name: "商",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "前1600年，商朝建立。商汤建都西亳（二里头遗址东北约6千米）。"
                }, {
                    name: "周",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "前1046年，西周代殷后，为控制东方地区，开始在洛阳营建国都。周公在洛水北岸修建了王城和成周城，史称成王“初迁宅于成周”、“定鼎于郏鄏”、“宅兹中国”，曾迁殷顽民于成周，并以成周八师监督之。当时洛阳称洛邑、新邑、大邑、成周、天室、中国等，亦称周南。周平王元年（前770年），周平王东迁洛邑，是为东周。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦庄襄王元年（前249年），秦在洛阳置三川郡，郡治成周城。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "汉高祖五年（前202年），刘邦建汉，初都洛阳，后迁长安，改三川郡为河南郡，治洛阳。辖洛阳、河南（汉置，治王城）、偃师、缑氏、平（偃师西北）、平阴（孟津东北）、新成（伊川西南）、榖成（新安东）及巩、荥阳、新郑、中牟、开封等22县。汉武帝置十三州部刺史，河南郡属司隶。西汉末年，王莽篡政，改洛阳为宜阳，设“新室东都”和“中市”。汉光武建武元年（25年），刘秀定都洛阳，改洛阳为雒阳。建武十五年（39年），更河南郡为河南尹。汉永和五年（140年），河南尹“有户二十万八千四百八十六，有口一百零一万零八百二十七”。黄初元年（220年），魏文帝曹丕定都洛阳，变雒阳为洛阳，设司隶校尉部。泰始元年（265年），西晋代魏，仍以洛阳为都。太延二年（436年），北魏在洛阳置洛州。太和十八年（494年），孝文帝迁都洛阳。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋开皇元年（581年），在洛阳置东京尚书省；次年，置河南道行台省；三年，废行台，以洛州刺史领总监；十四年，于金墉城别置总监。大业元年（605年），隋炀帝迁都洛阳，在东周王城以东，汉魏故城以西18里处，新建洛阳城。同年，改洛州（东魏改司州置）为豫州，三年又改河南郡，十四年复置洛州，辖河南、洛阳、偃师、缑氏、阌乡、桃林、陕、熊耳、渑池、新安、巩、宜阳、寿安、陆浑、伊阙、兴泰、嵩阳、阳城等18县。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐代，自高宗始仍以洛阳为都，称东都。武德四年（621年），置洛州总管府，辖洛州、郑州、熊州、榖州、嵩州、管州、伊州、汝州、鲁州等九州，洛州辖洛阳、河南、偃师、缑氏、巩、阳城、嵩阳、陆浑、伊阙等9县。贞观元年（627年），分全国为十道，洛阳属河南道。显庆二年（657年），置东都。开元元年（713年），改洛州为河南府。开元二十一年（733年），于洛阳置都畿道。天宝年间，改东都为东京。洛州、河南府均治洛阳。武则天光宅元年（684年）始，改东都为神都，对都城进行扩建，修建了明堂、万国天枢等。唐天祐四年（907年），后梁、后唐、后晋均曾都洛阳，后汉、后周以洛阳为陪都。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "宋，以洛阳为西京，置河南府。"
                }, {
                    name: "金",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "金代，定洛阳为中京，改河南府曰金昌府，并河南县入洛阳县。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "自元代始，洛阳不复为京，降为河南府治。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明代，河南府辖洛阳、偃师、巩县、孟津、登封、新安、渑池、宜阳、永宁、嵩县等10县，是伊王和福王的封地。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清代，洛阳仍为河南府治。"
                }]
            }]
        }
    },
    "T8P/": function(e, l) {
        e.exports = {
            name: "通州",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "韩玉",
                    value: "韩玉（生卒年不详），字温甫，金代人。祖先为相州（今河南安阳）人，金明昌五年（1194），经过经义、辞赋两科考试，中进士，进入翰林院为应奉。"
                }, {
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "郭守敬",
                    value: "郭守敬（1231～1316），字若思，河北邢台人，元代著名科学家，在天文、水利、数学等方面都有杰出成就。郭守敬自幼从刘秉忠学天文、地理等知识，中统三年（1262），郭守敬向元世祖忽必烈陈述水利六事，深得忽必烈赞许。至元二年（1265），郭守敬即被任命为都水少监，协助都水监掌管河渠、堤防、桥梁、闸坝等的修治工程。至元八年升任都水监，主管全国水利事务。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "紫清宫建筑群",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "燃灯佛塔与佑胜教寺、文庙（学宫）、紫清宫建筑群该建筑群具有“三教合一”对立统一的文化特色，即汇聚佛教、儒教与道教的宗教建筑。"
                }, {
                    name: "燃灯佛塔",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "燃灯佛塔与佑胜教寺、文庙（学宫）、紫清宫建筑群该建筑群具有“三教合一”对立统一的文化特色，即汇聚佛教、儒教与道教的宗教建筑。"
                }, {
                    name: "佑胜教寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "燃灯佛塔与佑胜教寺、文庙（学宫）、紫清宫建筑群该建筑群具有“三教合一”对立统一的文化特色，即汇聚佛教、儒教与道教的宗教建筑。"
                }, {
                    name: "文庙（学宫）",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "燃灯佛塔与佑胜教寺、文庙（学宫）、紫清宫建筑群该建筑群具有“三教合一”对立统一的文化特色，即汇聚佛教、儒教与道教的宗教建筑。"
                }, {
                    name: "三义庙",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "三义庙亦称山左会馆，是明清时期在通州活动的山东人士倡建的会馆。该庙创建于明万历九年（1581），清康熙十八年（1679）地震后倾圮，雍正六年（1728）重建，并用作会馆。嘉庆年间，于通州置义冢地14亩。庙中有《重修三义庙记》及《三义庙创立义园记》碑两通。前者记录山左在通人士修三义庙事，后者记录山左人士在通州多从事小推车短途运输业务，病殁者由本省同乡捐资购地买棺安葬于该庙。该庙是大运河北端通州商业码头处繁忙短途运输的历史见证。"
                }, {
                    name: "大光楼",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "大光楼明代中期所修验粮之处。明嘉靖七年（1528），朝廷修复通惠河，并在通州东北白河与通惠河交汇之处修建石土二坝，以作起粮驳运的码头。在石土二坝码头上，修建大光楼，作为督粮官吏掣验漕粮的场所，故大光楼又名验粮楼。清光绪二十六年（1900），大光楼在“庚子之乱”中被焚毁，不久后漕运废止，大光楼亦不复存在。2005年，通州区政府疏通大运河，于河畔重建大光楼，2008年修复完成。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "汉代",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "汉初以其地濒临潞水，始设潞县，仍隶属渔阳郡。王莽时，改为通潞县，置通潞亭。东汉时复称潞县。"
                }, {
                    name: "魏晋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "魏晋以降，地属幽州。后魏时置潞郡。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋初，省潞郡入涿郡。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐武德年间，于此地置元州，领潞、临泃、无终等县；贞观年间，省元州，仍为潞县。"
                }, {
                    name: "金",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "通州济运王畿的作用，始于金代迁都燕京以后。金天德三年（1151），海陵王完颜亮下诏迁都燕京（今北京），认为燕地居天下之中，南迁于燕地能有效控制“地远而事繁”的南部汉地，并更好地解决“供馈困于转输”的经济问题，故于当年兴建燕京行宫及经营京畿地区。由于时人在此地大造海船，故升潞县为通州，取“漕运通济”之意，领潞、三河二县，潞县为附郭。金贞元元年（1153）迁都燕京，并改其为中都，而通州及漷阴县隶属于中都路大兴府。中都所需的粮食，从山东及河北征调，经由海河转溯潞水至通州。由于通州至燕京由东到西地势渐高，运河蓄水不易，金人遂修贯穿通州城的闸河，以闸节制周边高梁河、白莲潭诸水，以供河道水源，保障粮运。金泰和初年，韩玉、乌古论庆寿二人先后奉命“开通州漕河”，以供粮运。金兴定二年（1218），设防御使，领潞、三河二县，以潞县为附郭"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元至元三年（1266），元世祖忽必烈命刘秉忠在金中都的东北，以太液池琼岛为中心，营筑都城。至元九年改名大都（今北京），并定都于此。元沿袭金之设，仍设通州，属大都路大兴府。元代通惠河的成功修浚，连接京津之间运河，横贯通州城而过，使得通州的重要性更加凸显。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明初，武宁王徐达兵至此地，使之归附明朝。以潞县省入，仍为通州，隶属于北平布政司北平府。永乐年间，建都北京，“改北平府为顺天府，州首隶焉，领三河、武清、漷县、宝坻四县”。嘉靖末年，改属密云道。万历年间，设通州道，旋罢。至崇祯末复设。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清初沿袭明代旧制，通州隶属于直隶顺天府。顺治十六年（1659），以漷县罢敝，不足立县，裁撤漷县并入通州，通州仍领三河、武清、宝坻3县。康熙八年（1669），通州属通永道。雍正六年（1728），通州属东路厅，所领3县均改隶厅属。乾隆二十五年（1760），所属3县脱属平行。康熙九年，通州知州完福因通州新旧两城均坍塌，于是重新修复城墙。乾隆三十年，总督方观承奏请动帑重修通州新旧两城，并合而为一。将旧城拆去西面城墙，重修5座城门及各建重楼。旧城保留“通运”“迎薰”“凝萃”三门名，新城两门分别名为“望帆云表”“尺五瞻天”。清代通惠河一直沿用，基本沿袭明制未改。至清末，朝廷实行海运而河运渐废。其后铁路建筑完成，运河不复修浚。光绪二十七年（1901），清廷被迫签订《辛丑条约》，漕粮折银。是年，漕运停罢。通惠河随之停航，河道湮废，与运河休戚与共的通州城境况日趋萧条。"
                }]
            }]
        }
    },
    XVbZ: function(e, l) {},
    YGDd: function(e, l) {
        e.exports = {
            name: "天津",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "北运河",
                    value: "北运河，西汉以前称沽水，东汉至东晋间称潞水，北朝时称潞河，元代称白河，清顺治九年（1652）设北运分司后多称北运河。北运河北与通惠河相接，南连南运河，是海河流域北系的干流。它始于北京通州北关节制闸，东南流经河北省香河县，至西王庄村北进天津市武清县境，经筐儿港、屈家店水利枢纽至天津市新红桥以下汇入西河（子牙河），于天津三岔河口入海河，全长148 千米。北运河是在潮白河（通州以下又称潞河）的基础上整治的水道，具有较好的水源条件，河流不仅比降大，丰枯流量变幅也比较大，主要通过弯道、减水坝和减河控制水量。北运河以较少的工程设施，通过弯道和减水坝延缓水道纵比降和控制水位，发挥了运道及行洪的功能。从金元到清末700 年间，漕运时有河海兼运，无论是漕行河运还是河海转输，北运河都是漕粮必经之道，是京杭运河北部的重要河段。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "魏藻德",
                    value: "魏藻德（1605～1644），字师令，号清躬，明北直隶顺天府通州（今北京通州）人。明崇祯十三年（1640）中庚辰科状元，授翰林院修撰。十六年，升礼部右侍郎兼东阁大学士，入阁辅政，以疏陈兵事，召对称旨而超迁为少詹事。十月，自请阅视河防，崇祯帝嘉奖其壮志忠，但以时事多艰，仍留内阁赞理。十七年，加官为兵部尚书兼工部尚书、文渊阁大学士，总督河道、屯田、练兵等事情，驻守天津。内阁首辅陈演辞职后，擢升内阁首辅。为相无所建树，只倡议百官捐款助国而已。农民起义军攻陷北京后，魏藻德逃回家中，后被刘宗敏擒获，受酷刑而亡。"
                }, {
                    name: "陈仪",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "陈仪（1670～1742），字子翙，号一吾，室名兰雪斋，直隶文安（今河北文安）人。清康熙五十四年（1715）中进士，历任侍讲、署天津同知、侍读学士、京东营田观察使、鸿胪寺少卿等职，乾隆七年（1742）去世。著有《兰雪斋集》《毛诗臆评》《南华经解》《兰雪斋读离骚》《天游录》等书。"
                }, {
                    name: "梁翥鸿",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "梁翥鸿（1711～？），陕西三原人，安徽巡抚梁世勋之子。因恩荫得为三品荫生。清乾隆五年（1740）选授顺天府通判。后升浙江司郎中、天津知府、广州知府等职。乾隆十六年，补授云南粮储道，升湖北按察使，转广西按察使、山西按察使。乾隆二十八年，授山东布政使、后代理漕运总督。乾隆三十五年，选补四川永宁道。梁翥鸿同崔应阶辑有《东巡金石录》。"
                }, {
                    name: "梁肯堂",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "梁肯堂（1717～1801），字构亭，号春淙，又号石幢，浙江钱塘（今浙江杭州）人。乾隆二十一年（1756）举人，补授为直隶栾城县知县。后任宝坻县知县、蓟州知州、深州知州、保定府知府、清河道。四十六年，升为山东按察使。又任直隶布政使、直隶总督、刑部尚书、漕运总督等职，曾在天津接待英国马戛尔尼使团来华事宜。著有《石幢居士吟稿》二卷。"
                }, {
                    name: "周馥",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "周馥（1837～1921），字玉山，号兰溪，安徽至德（今安徽东至）人。早年多次应试未中，后投靠淮军，升县丞、知县，同治、光绪年间官永定河道、津海关道、天津兵备道、直隶按察使、山东巡抚、署两江总督兼南洋大臣、闽浙总督、两广总督等职，曾筹划建立北洋海军、渤海编练民舶团练，创办天津武备学堂、助办复旦公学与安徽公学，在晚清教育史上占有重要地位。周馥于1921年病逝于天津，逊清赠其谥号为“悫慎”，有《负暄闲语》传世。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "三岔河口",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "三岔河口位于天津市河北区狮子林桥附近，是天津地区最早的居民点所在，也是天津经济文化的发祥地，有“天津摇篮”之称。清康熙《天津卫志》载：“三岔河，在津城东北，潞、卫二水会流，潞水清、卫水浊，合流东注于海”。三岔河口是北运河、南运河与海河的交汇处，地势较高，是良好的航运码头。早在金朝，随着漕运和制盐业的不断发展，三岔河口成为航运枢纽与漕运中转站，在此建立了军事设施“直沽寨”。到了元朝，三岔河口一带进一步繁荣，南北往来的官员、客商和船工多会聚于此，为加强守备，直沽寨改为“海津镇”。得名“天津”之后，三岔河口成为明清两朝漕运的重要节点，由于北运河浅涩难行，漕船在此卸下粮米暂存，再雇驳船转运北京。漕船停泊促进了商业繁荣和城镇发展，三岔河口孕育了天津城和周边城镇。1918年，三岔河口进行了裁弯取直，填平了南北运河由狮子林桥向北的部分弯曲河道，海河向北打通延伸，在金钢桥附近与南北运河沟通，形成了今天的三岔河口形态。如今三岔河口一带堤岸河道保存完好，两岸生态环境良好，但该河段已失去航运功能，改作城市排洪河道和景观河道。2005年，天津市实施对三岔河口地区的开发改造。2008年，随着文化、休闲、游艺、观光、商业、居住等多种业态相继建成落户，沉寂许久的三岔河口终于重现繁华。"
                }, {
                    name: "天妃宫遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "天妃宫遗址位于天津市河东区大直沽中路，主遗址为天妃灵慈宫，始建于元至元年间，明万历六年（1578）重修，清代数次修葺。光绪二十六年（1900）毁于兵燹，光绪三十一年复建大殿三间，1950年以后逐渐成为遗址。1998～1999年，经考古发掘，揭露出元代建筑基址和明清时期大殿基址，出土大量元明清时期生活器皿、建筑构件等重要遗物。大直沽是天津城市形成与发展的原生点，天妃宫则是这一原生点的标志，它与天津旧城东门外三岔河口西岸的天后宫东西相望，成为海运和内河漕运发达的见证。为保护这一历史遗存，在原址建有元明清天妃宫遗址博物馆，2006年该遗址被列为第六批全国重点文物保护单位。"
                }, {
                    name: "天后宫",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "天后宫位于天津旧城东门外，三岔河口西岸，现南开区古文化街，始建于元泰定三年（1326），明清两朝多次重修扩建，是中国三大妈祖庙之一。元代南粮北运改行海路，为消除航海者的恐惧心理，朝廷晋封妈祖为“天妃”，在沿海漕运行经之处均建祠宇，称为“天妃宫”。直沽是海运终点，漕粮在此装卸转输北京，为减少海难，祈求出海安全，天妃宫随之建立在海河之畔。清康熙二十三年（1684），加封“天妃”为“天后”，天妃宫亦改称“天后宫”，民间俗称“娘娘宫”。天后宫最初是船工祭祀海神、举行酬神演出和聚会娱乐的场所，每逢漕船起航或抵达，都要在此举行隆重仪式，漕船上捎带的物品也于此出售，宫南宫北一带便成了天津最早的商业区。到明清时期，漕运以河运为主，然而天后宫作为祭神祈顺场所的地位并未改变。天后宫坐西朝东，面向渤海，是天津市区现存最古老的建筑群，见证了天津600多年来的历史变迁。从海河岸边沿中轴线自东向西，依次有戏楼、幡杆、山门、牌楼、前殿、大殿、藏经阁、启圣祠等建筑，两侧分列南北的是钟鼓楼、配殿和张仙阁。除部分建筑系民国重建外，大部分是明清所建，其中主体建筑大殿为典型的明代中晚期木结构建筑风格。1954年，天后宫被列为天津市文物保护单位。1985年，天津市政府对天后宫进行居民动迁、文物修缮和博物馆建设，复原宫内天后妈祖、王灵官、四大金刚等神像。1986年元旦，天后宫重新开放，配殿被辟为天津民俗博物馆的展品陈列室。2012年5月，天后宫再次进行大修，此次修缮历时半年，进行神像复原和必要的建筑改造。2013年，天后宫被列为第七批全国重点文物保护单位。"
                }, {
                    name: "广东会馆",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "广东会馆位于天津旧城鼓楼南侧，今南开区南门内大街，是全国现今保存最完整、规模最大的清代会馆建筑之一。天津在近代成为北方重要的工商业城市，各地商人云集于此，曾在天津设立各地会馆20余处。广东商人原本与福建、潮州商人集资兴建有“闽粤会馆”，清道光末年因内部发生经济纠纷，广东商人被排斥。随着广东商人势力的壮大，光绪二十九年（1903），时任天津海关道唐绍仪、怡和洋行买办梁炎卿等人发起倡议，号召集资筹建广东商人的会馆。在津粤商共筹资九万余两，购置城内鼓楼南侧原盐运使署旧址土地十三余亩，当年十二月破土动工，历时四年，于光绪三十三年建成新会馆，取名“广东会馆”。会馆规模宏大，设计独特，装修精良，融合了我国北方和南方两种建筑手法，瓦顶墙体体现了北方四合院的特点，内檐装修又具有岭南建筑风格，是我国罕见的木结构建筑艺术珍品。整个会馆包括照壁、门厅、大殿、配殿、戏楼、跨院、套房等建筑，不仅为广东商人提供基本的住宿服务，也是商务洽谈、同乡聚会和节日娱乐的重要场所。1985年，广东会馆进行大修，并在此基础上成立天津市戏剧博物馆，是全国第一家集戏剧文物、史料收集、保管、研究、宣传于一体的专题性博物馆，该馆于1986年元旦正式对社会开放。1991年，广东会馆被评为全国近代优秀建筑，2001年被列为第五批全国重点文物保护单位。"
                }, {
                    name: "清真大寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "清真大寺位于天津市红桥区大丰路东侧，始建于清顺治元年（1644），康熙四十三年（1704）扩建，此后多次重修续建。该寺是天津地区现存清真寺中年代较早、规模最大的一处，占地面积5000平方米，建筑面积2200平方米，由照壁、门厅、礼拜殿、讲堂、沐浴室等组成。主体建筑礼拜殿坐西朝东，由四座建筑“勾连搭”结成整体，前为卷棚顶抱厦，中间两座为庑殿顶大殿，后殿亦为庑殿顶，总面积达900平方米，可容纳千人同时进行礼拜。后殿殿顶上并排耸立五座亭式阁楼，中间一座为八角攒尖青瓦顶，两侧四座为六角攒尖顶。南北两端阁楼檐下分别悬挂有“望月”“喧时”匾额，作邦克楼之用。该寺作为保存完好的中国古典建筑群，布局紧凑，结构完整，集中国宫殿式建筑风格与伊斯兰教建筑特色于一体。历史上，该寺藏有经书1万余册，现仅存伊斯兰教经书典籍100余部，其中两册袖珍本《古兰经》尤为珍贵。寺内还悬挂有汉文和阿拉伯文匾额、楹联等共61幅。该寺地处回族聚居区，历来是天津地区的伊斯兰教活动中心，1982年被确定为天津市文物保护单位。"
                }, {
                    name: "金家窑清真寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "金家窑清真寺位于旧三岔河口北面，今河北区金家窑大街海潮寺胡同，始建于明万历二年（1574），是天津市区最早建造的一座清真寺。明朝初年，漕运船队中一些安徽籍穆斯林每年冬天都会在金家窑一带临时搭棚做礼拜，之后陆续有一些回族来这里定居，于是集资建立了清真寺。经过清代的扩建重修，金家窑清真寺达到一定规模，其建筑以中国古典殿宇式为主，又巧妙融合了伊斯兰式建筑风格，既庄重典雅又清新别致。1949年后，该清真寺的大殿、南北讲堂和门楼相继进行了修缮，1984年被列为河北区文物保护单位。"
                }, {
                    name: "潮音寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "潮音寺位于天津市滨海新区西沽潮音寺大街，始建于明永乐二年（1404），由当地居民集资兴建，初名“南海大寺”，供奉南海观世音菩萨。嘉靖年间，大沽口一带倭寇猖獗，为安定民心，嘉靖帝拨银重修南海大寺，改土木结构为砖瓦结构，并御笔更名为“潮音寺”。潮音寺历史悠久，曾是当地经济、贸易、文化、民俗活动的中心，本地渔民和外籍船员多来此朝拜进香。民国初年大沽籍船员捐资修缮山门、大殿和后殿。潮音寺坐西朝东，面朝海河，原有前后两进院落，现存山门、大殿和配殿，是大沽口仅存的古庙宇遗迹，保留了明清建筑风格，1995年被列为区级文物保护单位。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "汉武帝，在武清设置盐官。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋朝，修建京杭大运河后，在南运河和北运河的交会处（今金刚桥三岔河口），史称三会海口，是天津最早的发祥地。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐朝，在芦台开辟了盐场，在宝坻设置盐仓。"
                }, {
                    name: "辽",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "辽朝，在武清设立了“榷盐院”，管理盐务。"
                }, {
                    name: "金",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "金朝贞佑二年（1214年），在三岔口设直沽寨，直沽是天津城市发展中有史料记载的最早名称。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元延祐三年（1316年），“改直沽为海津镇”，这里成为漕粮运输的转运中心。设立大直沽盐运使司，管理盐的产销。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明建文二年（1400年），燕王朱棣在此渡过大运河南下争夺皇位。朱棣成为皇帝后，为纪念由此起兵“靖难之役”，在永乐二年十一月二十一日（1404年12月23日）将此地改名为天津，即天子经过的渡口之意。作为军事要地，在三岔河口西南的小直沽一带，天津开始筑城设卫，称天津卫，揭开了天津城市发展新的一页。后又增设天津左卫和天津右卫。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清顺治九年（1652年），天津卫、天津左卫和天津右卫三卫合并为天津卫，设立民政、盐运和税收、军事等建置。雍正三年（1725年）升天津卫为天津州。雍正九年（1731年）升天津州为天津府，辖六县一州。清末时期，天津作为直隶总督的驻地，也成为李鸿章和袁世凯兴办洋务和发展北洋势力的主要基地。"
                }]
            }]
        }
    },
    akb9: function(e, l) {},
    bwN2: function(e, l, t) {
        "use strict";
        Object.defineProperty(l, "__esModule", {
            value: !0
        });
        var o = t("Gu7T")
          , r = t.n(o)
          , a = t("/klP")
          , c = t("Ns9M")
          , u = t("0xDb")
          , i = t("gyMJ")
          , n = {
            name: "graphByG6_zxy",
            props: ["graphData", "userAgent"],
            data: function() {
                return {
                    graphObj: null,
                    nodes: [],
                    edges: [],
                    nodesRadius: 25,
                    clickNode: {},
                    hasClick: !1
                }
            },
            watch: {
                graphData: function(e) {
                    var l = this;
                    this.clickNode = {},
                    e.nodes.map(function(e) {
                        e.label = l.fittingString(e.label)
                    }),
                    this.runderGraph(e)
                }
            },
            mounted: function() {
                this.initGraph()
            },
            methods: {
                initGraph: function() {
                    var e, l, t = document.getElementById("mountNode");
                    e = document.getElementById("mountNode").offsetWidth || 520,
                    l = document.getElementById("mountNode").offsetHeight - 4;
                    var o = this;
                    c.a.registerNode("background-animate", {
                        afterDraw: function(e, l) {
                            if (l.get("children")[0].attrs.fill = o.getFillColor(e.form),
                            l.get("children")[0].attrs.r = "PeriodHistory" == e.form ? "35" : o.getNodeRadius(e.label),
                            o.clickNode._cfg) {
                                o.graphObj.layout();
                                var t = l.get("children")[0]
                                  , r = l.get("children")[1];
                                t.animate(function(l) {
                                    return {
                                        x: (o.clickNode.get("model").x - e.x) * (1 - l),
                                        y: (o.clickNode.get("model").y - e.y) * (1 - l)
                                    }
                                }, {
                                    duration: 1e3,
                                    easing: "easeQuadOut"
                                }),
                                r.animate(function(l) {
                                    return {
                                        x: (o.clickNode.get("model").x - e.x) * (1 - l),
                                        y: (o.clickNode.get("model").y - e.y) * (1 - l)
                                    }
                                }, {
                                    duration: 1e3,
                                    easing: "easeQuadOut"
                                })
                            }
                        },
                        setState: function(e, l, t) {
                            t.get("keyShape");
                            var o = t.get("model")
                              , r = t._cfg.group;
                            if ("nodeState" == e)
                                if ("getData" == l) {
                                    var a = o.size / 2;
                                    isNaN(a) && (a = o.size[0] / 2);
                                    var c = r.addShape("circle", {
                                        zIndex: -3,
                                        attrs: {
                                            x: 0,
                                            y: 0,
                                            r: a,
                                            fill: "#ff0",
                                            opacity: .6
                                        },
                                        name: "circle-shape1"
                                    })
                                      , u = r.addShape("circle", {
                                        zIndex: -2,
                                        attrs: {
                                            x: 0,
                                            y: 0,
                                            r: a,
                                            fill: "#fff",
                                            opacity: .6
                                        },
                                        name: "circle-shape2"
                                    })
                                      , i = r.addShape("circle", {
                                        zIndex: -1,
                                        attrs: {
                                            x: 0,
                                            y: 0,
                                            r: a,
                                            fill: "green",
                                            opacity: .6
                                        },
                                        name: "circle-shape3"
                                    });
                                    r.sort(),
                                    c.animate({
                                        r: a + 10,
                                        opacity: .1
                                    }, {
                                        repeat: !0,
                                        duration: 1e3,
                                        easing: "easeCubic",
                                        delay: 0
                                    }),
                                    u.animate({
                                        r: a + 10,
                                        opacity: .1
                                    }, {
                                        repeat: !0,
                                        duration: 1e3,
                                        easing: "easeCubic",
                                        delay: 1e3
                                    }),
                                    i.animate({
                                        r: a + 10,
                                        opacity: .1
                                    }, {
                                        repeat: !0,
                                        duration: 1e3,
                                        easing: "easeCubic",
                                        delay: 1e3
                                    })
                                } else {
                                    r.findAll(function(e) {
                                        return e.cfg.zIndex < 0
                                    }).map(function(e) {
                                        e.destroy()
                                    })
                                }
                            "nodeBorder" == e && ("highLight" == l ? r.get("children")[0].animate(function(e) {
                                return {
                                    stroke: "#eee",
                                    strokeOpacity: e,
                                    lineWidth: 3
                                }
                            }, {
                                duration: 1e3,
                                easing: "easeQuadOut"
                            }) : r.get("children")[0].animate(function(e) {
                                return {
                                    stroke: "#eee",
                                    strokeOpacity: 1.1 - e,
                                    lineWidth: 3
                                }
                            }, {
                                duration: 200,
                                easing: "easeQuadOut"
                            }))
                        }
                    }, "circle"),
                    c.a.registerEdge("line-growth", {
                        afterDraw: function(e, l) {
                            console.log(o.graphObj.findById(e.target));
                            var t = l.get("children")[0];
                            l.get("children")[1],
                            l.get("children")[2];
                            setTimeout(function() {
                                var l = Object(u.b)(e.startPoint, e.endPoint) + 2 * o.nodesRadius;
                                t.animate(function(t) {
                                    var r = t * l;
                                    return {
                                        lineDash: [1 == t ? r : .9 * r, l - r],
                                        endArrow: {
                                            path: "M 0,0 L 10,5 L 10,-5 Z",
                                            d: -.5 * o.graphObj.findById(e.target).get("bboxCache").width,
                                            fill: "#eee",
                                            stroke: "#eee",
                                            opacity: 1 == t ? 1 : 0
                                        }
                                    }
                                }, {
                                    duration: 1e3,
                                    easing: "easeQuadOut"
                                })
                            }, 0)
                        }
                    }, "line"),
                    this.graphObj = new c.a.Graph({
                        container: "mountNode",
                        width: e,
                        height: l,
                        modes: {
                            default: ["drag-canvas", "drag-node", {
                                type: "zoom-canvas",
                                minZoom: "0.1",
                                maxZoom: "10"
                            }]
                        },
                        fitCenter: !0,
                        linkCenter: !0,
                        layout: {
                            type: "forceAtlas2",
                            width: e,
                            height: l,
                            kr: 50,
                            kg: 1,
                            preventOverlap: !0,
                            barnesHut: !1,
                            prune: !1
                        },
                        nodeStateStyles: {
                            "nodeState:getData": {
                                fill: "red"
                            },
                            "nodeState:removeNode": {
                                fill: "yellow"
                            }
                        },
                        edgeStateStyles: {},
                        defaultNode: {
                            size: 2 * this.nodesRadius,
                            style: {
                                fill: "#3F2C6E",
                                stroke: "#3F2C6E",
                                strokeOpacity: .1,
                                lineWidth: 3
                            },
                            label: "node-label",
                            type: "background-animate",
                            labelCfg: {
                                zIndex: 1,
                                position: "center",
                                style: {
                                    fill: "#fff"
                                }
                            }
                        },
                        defaultEdge: {
                            type: "line-growth",
                            style: {
                                stroke: "#eee",
                                opacity: .5,
                                endArrow: {
                                    path: "M 0,0 L 10,5 L 10,-5 Z",
                                    d: -1 * this.nodesRadius,
                                    fill: "#eee",
                                    stroke: "#eee",
                                    opacity: 1
                                }
                            },
                            labelCfg: {
                                position: "center",
                                autoRotate: !0,
                                style: {
                                    fill: "#000",
                                    background: {
                                        fill: "#ccc",
                                        stroke: "#ccc",
                                        padding: [2, 2, 2, 2],
                                        radius: 2
                                    }
                                }
                            }
                        }
                    }),
                    o.graphObj.on("node:dragstart", function(e) {}),
                    o.graphObj.on("node:drag", function(e) {}),
                    o.graphObj.on("node:dragend", function(e) {}),
                    "undefined" != typeof window && (window.onresize = function() {
                        o.graphObj && !o.graphObj.get("destroyed") && t && t.scrollWidth && t.scrollHeight && o.graphObj.changeSize(t.scrollWidth, t.scrollHeight)
                    }
                    )
                },
                runderGraph: function(e) {
                    var l = this;
                    console.log(e),
                    this.nodes = e.nodes,
                    this.edges = e.edges,
                    c.a.Util.processParallelEdges(this.edges),
                    this.edges.map(function(e) {
                        e.type = "line-growth"
                    }),
                    this.graphObj.data({
                        nodes: this.nodes,
                        edges: this.edges
                    }),
                    this.graphObj.render(),
                    this.graphObj.layout(),
                    this.graphObj.on("node:click", function(e) {
                        if (console.log(e),
                        l.hasClick || !e.item.get("model").form)
                            return !1;
                        l.hasClick = !0,
                        l.clickNode = e.item,
                        l.$emit("clickNodeFun", e.item.get("model")),
                        "getData" == l.getNodeState(e.item, "nodeState") ? (l.graphObj.setItemState(e.item, "nodeState", "removeNode"),
                        l.graphObj.getNeighbors(e.item, "target").map(function(e) {
                            l.graphObj.removeItem(e),
                            l.hasClick = !1
                        })) : (l.graphObj.setItemState(e.item, "nodeState", "getData"),
                        l.getURL(e))
                    }),
                    this.graphObj.on("node:touchstart", function(e) {
                        if (console.log(e),
                        l.hasClick || !e.item.get("model").form)
                            return !1;
                        l.hasClick = !0,
                        l.clickNode = e.item,
                        l.$emit("clickNodeFun", e.item.get("model")),
                        "getData" == l.getNodeState(e.item, "nodeState") ? (l.graphObj.setItemState(e.item, "nodeState", "removeNode"),
                        l.graphObj.getNeighbors(e.item, "target").map(function(e) {
                            l.graphObj.removeItem(e),
                            l.hasClick = !1
                        })) : (l.graphObj.setItemState(e.item, "nodeState", "getData"),
                        l.getURL(e))
                    })
                },
                getNodeState: function(e, l) {
                    if (e._cfg.states.length) {
                        var t = e._cfg.states.find(function(e) {
                            return e.split(":")[0] == l
                        });
                        return t ? t.split(":")[1] : ""
                    }
                    return ""
                },
                getFillColor: function(e) {
                    switch (e) {
                    case "SzNewAssFigure":
                        return "#505186";
                    case "SzNewDynasty":
                        return "#7C176F";
                    case "SzNewFigure":
                        return "#DC6322";
                    case "relationNode":
                        return "#EF8C15";
                    case "SzNewEvent":
                        return "#AC4A27";
                    case "SzNewFigureLabel":
                        return "#126B7F";
                    case "SzNewTown":
                        return "#CA76AC";
                    default:
                        return "#AAA"
                    }
                },
                getNodeRadius: function(e) {
                    var l = e.length;
                    return l < 5 ? 25 : l < 9 ? 35 : l > 20 ? 55 : 45
                },
                fittingString: function(e) {
                    return e.length > 20 ? e.replace(/[^\x00-\xff]/g, "$&").replace(/.{12}\x01?/g, "$&\n").replace(/\x01/g, "").replace(/\n$/g, "") : e.replace(/[^\x00-\xff]/g, "$&").replace(/.{8}\x01?/g, "$&\n").replace(/\x01/g, "").replace(/\n$/g, "")
                },
                getURL: function(e) {
                    return !1
                },
                addGraph: function(e, l) {
                    var t = this;
                    e.newNodes.map(function(e) {
                        t.graphObj.findById(e.id) || (e.label = t.fittingString(e.label),
                        t.graphObj.addItem("node", e, !1))
                    }),
                    e.newEdges.map(function(e) {
                        t.graphObj.addItem("edge", e, !1)
                    }),
                    this.graphObj.layout(),
                    setTimeout(function() {
                        t.graphObj.focusItem(l.item._cfg.id, !0),
                        t.graphObj.refreshPositions(),
                        t.hasClick = !1
                    }, 10)
                },
                changeGraphSize: function(e, l) {
                    this.graphObj.changeSize(e, l),
                    this.graphObj.fitCenter()
                }
            }
        }
          , m = {
            render: function() {
                var e = this.$createElement;
                return (this._self._c || e)("div", {
                    attrs: {
                        id: "mountNode"
                    }
                })
            },
            staticRenderFns: []
        };
        var v = t("VU/8")(n, m, !1, function(e) {
            t("XVbZ")
        }, "data-v-4ef90da1", null).exports
          , s = t("m6gw")
          , y = t.n(s)
          , S = t("6gh7")
          , g = t.n(S)
          , C = t("F5Zk")
          , d = t.n(C)
          , E = t("Qql9")
          , A = t.n(E)
          , b = t("w3+O")
          , B = t.n(b)
          , D = t("Cifp")
          , h = t.n(D)
          , F = t("RtvE")
          , f = t.n(F)
          , p = t("YGDd")
          , k = t.n(p)
          , w = t("EXCb")
          , x = t.n(w)
          , I = t("1jin")
          , O = t.n(I)
          , N = t("5yi4")
          , Q = t.n(N)
          , R = t("EIFs")
          , j = t.n(R)
          , z = t("T8P/")
          , G = t.n(z)
          , T = t("vuOR")
          , H = t.n(T)
          , M = t("fwFA")
          , Y = t.n(M)
          , L = t("OX9h")
          , q = t.n(L)
          , K = t("PrIf")
          , U = t.n(K)
          , V = {
            name: "graph",
            components: {
                riverMap: a.a,
                graphByG6: v
            },
            data: function() {
                return {
                    refreshScroll: !0,
                    activeName: "first",
                    activeFigure: "",
                    riverData: {},
                    cityCards: [{
                        name: "吴泰伯"
                    }, {
                        name: "伍子胥"
                    }, {
                        name: "夫差"
                    }, {
                        name: "秦始皇"
                    }, {
                        name: "隋炀帝"
                    }, {
                        name: "郭守敬"
                    }, {
                        name: "万恭"
                    }, {
                        name: "翁大立"
                    }, {
                        name: "潘季驯"
                    }, {
                        name: "于成龙"
                    }, {
                        name: "杨以增"
                    }],
                    cityChart: {},
                    graphData: {},
                    refreshGraph: !1,
                    clickNode: {}
                }
            },
            mounted: function() {
                var e = this
                  , l = this;
                window.toGraph = function(e) {
                    e && (l.activeName = "fourth",
                    l.refreshGraph = !1,
                    l.$nextTick(function() {
                        l.refreshGraph = !0
                    })),
                    l.chooseFigure({
                        name: e
                    })
                }
                ,
                this.$route.query.activeName ? (this.activeName = this.$route.query.activeName,
                "first" == this.activeName ? this.drawRiverChart(this.$route.query.active) : "fourth" == this.activeName ? (this.refreshGraph = !1,
                this.$nextTick(function() {
                    e.refreshGraph = !0
                }),
                this.chooseFigure({
                    name: this.$route.query.active
                })) : this.cityClick({
                    name: this.$route.query.active
                })) : this.drawRiverChart("通惠河")
            },
            methods: {
                handleClick: function(e, l) {
                    var t = this;
                    switch (this.activeName) {
                    case "first":
                        this.drawRiverChart("江南运河");
                        break;
                    case "second":
                        this.drawCityChart(g.a);
                        break;
                    case "third":
                        this.drawHeritageChart(),
                        this.$nextTick(function() {
                            t.$refs.mineScroll.wrap.scrollTop = 3800
                        });
                        break;
                    case "fourth":
                        this.refreshGraph = !1,
                        this.$nextTick(function() {
                            t.refreshGraph = !0
                        }),
                        this.activeFigure = "郭守敬",
                        this.drawGraphChart({
                            form: "SzNewFigure",
                            title: this.activeFigure
                        })
                    }
                },
                riverClick: function(e) {
                    this.drawRiverChart(e.name)
                },
                cityClick: function(e) {
                    switch (e.name) {
                    case "北京":
                        this.drawCityChart(g.a);
                        break;
                    case "无锡":
                        this.drawCityChart(d.a);
                        break;
                    case "杭州":
                        this.drawCityChart(A.a);
                        break;
                    case "苏州":
                        this.drawCityChart(y.a);
                        break;
                    case "沧州":
                        this.drawCityChart(B.a);
                        break;
                    case "济宁":
                        this.drawCityChart(h.a);
                        break;
                    case "洛阳":
                        this.drawCityChart(f.a);
                        break;
                    case "天津":
                        this.drawCityChart(k.a);
                        break;
                    case "西安":
                        this.drawCityChart(x.a);
                        break;
                    case "徐州":
                        this.drawCityChart(O.a);
                        break;
                    case "宿州":
                        this.drawCityChart(Q.a);
                        break;
                    case "聊城":
                        this.drawCityChart(j.a);
                        break;
                    case "通州":
                        this.drawCityChart(G.a);
                        break;
                    default:
                        var l = H.a.find(function(l) {
                            return l.name == e.name
                        });
                        l && this.drawCityChart(l)
                    }
                },
                chooseFigure: function(e) {
                    this.activeFigure = e.name,
                    this.drawGraphChart({
                        form: "SzNewFigure",
                        title: this.activeFigure
                    })
                },
                drawRiverChart: function(e) {
                    var l = this;
                    Object(i.Q)(e).then(function(t) {
                        if ("南运河" == e) {
                            var o = t.data;
                            o.children = t.data.children.slice(0, 6),
                            l.riverData = o
                        } else
                            l.riverData = t.data;
                        window.setTimeout(function() {
                            l.refreshScroll = !1,
                            l.$nextTick(function() {
                                l.refreshScroll = !0
                            })
                        }, 0);
                        var r = ["#29A7E1", "#1D805B", "#C19A62", "#E53427", "#A67878", "#FE5821"];
                        l.riverData.label = {
                            fontSize: 18,
                            color: "#84F028"
                        },
                        l.riverData.symbolSize = 14,
                        l.riverData.symbol = "image://" + U.a,
                        l.riverData.children.map(function(e, l) {
                            e.lineStyle = {
                                color: r[l]
                            },
                            e.itemStyle = {
                                color: r[l]
                            },
                            e.children.map(function(e) {
                                e.lineStyle = {
                                    color: r[l]
                                },
                                e.itemStyle = {
                                    color: r[l]
                                }
                            })
                        }),
                        l.cityChart = l.$echarts.init(document.getElementById("riverChart"));
                        var a = {
                            tooltip: {
                                show: !1,
                                trigger: "item",
                                triggerOn: "click"
                            },
                            series: [{
                                type: "tree",
                                data: [l.riverData],
                                top: "18%",
                                bottom: "14%",
                                layout: "radial",
                                symbol: "emptyCircle",
                                symbolSize: 7,
                                initialTreeDepth: 3,
                                label: {
                                    fontSize: 16,
                                    backgroundColor: "transparent",
                                    color: "#eee"
                                },
                                animationDurationUpdate: 750,
                                emphasis: {
                                    focus: "descendant"
                                }
                            }]
                        };
                        l.cityChart.setOption(a)
                    })
                },
                treeNodeclick: function(e) {
                    if (!0 !== e.event.target.culling && !1 === e.event.target.culling) {
                        var l = e.data;
                        e.data.level;
                        this.activeName = "second",
                        this.cityClick({
                            name: l.name
                        })
                    }
                },
                drawCityChart: function(e) {
                    this.cityChart.clear && this.cityChart.clear(),
                    e.label = {
                        fontSize: 18
                    },
                    e.symbolSize = 12,
                    this.cityChart = this.$echarts.init(document.getElementById("cityChart"));
                    var l = {
                        tooltip: {
                            position: function(e, l, t, o, r) {
                                return {
                                    right: "20%",
                                    top: e[1]
                                }
                            },
                            className: "mineTooltip",
                            enterable: !0,
                            trigger: "item",
                            triggerOn: "click",
                            formatter: function(e) {
                                e.value,
                                e.name,
                                e.name;
                                return "<p>" + e.value + "</p>"
                            },
                            extraCssText: "maxWidth:40vw; white-space:pre-wrap"
                        },
                        series: [{
                            type: "tree",
                            data: [e],
                            top: "1%",
                            left: "7%",
                            bottom: "1%",
                            right: "20%",
                            symbolSize: 7,
                            label: {
                                position: "left",
                                verticalAlign: "middle",
                                align: "right",
                                fontSize: 16,
                                backgroundColor: "transparent",
                                color: "#eee"
                            },
                            leaves: {
                                label: {
                                    position: "right",
                                    verticalAlign: "middle",
                                    align: "left"
                                }
                            },
                            emphasis: {
                                focus: "descendant"
                            },
                            expandAndCollapse: !0,
                            animationDuration: 550,
                            animationDurationUpdate: 750
                        }]
                    };
                    this.cityChart.setOption(l)
                },
                drawHeritageChart: function() {
                    this.cityChart = this.$echarts.init(document.getElementById("heritageChart"));
                    var e = {
                        title: {},
                        series: [{
                            type: "sankey",
                            left: 50,
                            top: 20,
                            right: 150,
                            bottom: 25,
                            data: Y.a,
                            links: q.a,
                            lineStyle: {
                                color: "source",
                                curveness: .5
                            },
                            itemStyle: {
                                color: "#1f77b4",
                                borderColor: "#1f77b4"
                            },
                            label: {
                                color: "#eee",
                                fontFamily: "Arial",
                                fontSize: 12
                            }
                        }],
                        tooltip: {
                            trigger: "item"
                        }
                    };
                    this.cityChart.setOption(e)
                },
                drawGraphChart: function(e) {
                    var l = this;
                    Object(i._1)(e).then(function(t) {
                        var o = t.data;
                        if (o.length) {
                            var a = []
                              , c = [];
                            a.push({
                                id: o[0].indexId,
                                label: e.title,
                                introduced: o[0].introduced || "",
                                radius: 3,
                                form: e.form
                            }),
                            l.clickNode = {
                                id: o[0].indexId,
                                label: e.title,
                                introduced: o[0].introduced || "",
                                radius: 3,
                                form: e.form
                            },
                            [].concat(r()(o[0].List ? o[0].List : [])).map(function(e) {
                                var l = e.start || e.end
                                  , t = Boolean(e.end);
                                if (a.push({
                                    id: l.indexId,
                                    sourceId: o[0].indexId,
                                    label: l.title,
                                    form: l.form,
                                    relation: e.Relation ? e.Relation : e.title,
                                    introduced: l.introduced,
                                    radius: 3,
                                    nodeType: e.type
                                }),
                                a.find(function(l) {
                                    return l.relationLabel == (e.Relation ? e.Relation : e.title)
                                })) {
                                    var r = a.find(function(l) {
                                        return l.relationLabel == (e.Relation ? e.Relation : e.title)
                                    });
                                    c.push({
                                        source: r.id,
                                        target: l.indexId
                                    })
                                } else
                                    a.push({
                                        id: "relation" + l.indexId,
                                        label: e.Relation ? e.Relation : e.title,
                                        relationLabel: e.Relation ? e.Relation : e.title,
                                        form: "relationNode"
                                    }),
                                    c.push({
                                        source: t ? o[0].indexId : "relation" + l.indexId,
                                        target: t ? "relation" + l.indexId : o[0].indexId
                                    }, {
                                        source: t ? "relation" + l.indexId : l.indexId,
                                        target: t ? l.indexId : "relation" + l.indexId
                                    })
                            }),
                            l.graphData = {
                                nodes: a,
                                edges: c
                            }
                        } else
                            l.$message({
                                showClose: !0,
                                message: "抱歉，" + l.searchInput + "暂未收录",
                                type: "warning"
                            })
                    })
                }
            }
        }
          , P = {
            render: function() {
                var e = this
                  , l = e.$createElement
                  , t = e._self._c || l;
                return t("div", {
                    staticClass: "graph"
                }, [t("div", {
                    staticClass: "logoContent",
                    on: {
                        click: function(l) {
                            return e.$router.push({
                                name: "bridge"
                            })
                        }
                    }
                }), e._v(" "), t("div", {
                    staticClass: "tabsContent"
                }, [t("div", {
                    staticClass: "cardContent"
                }, [t("div", {
                    staticClass: "tabCard",
                    on: {
                        click: function(l) {
                            return e.$router.push({
                                name: "survey"
                            })
                        }
                    }
                }, [t("p", [e._v("运河概况")]), e._v(" "), t("p", [e._v("Overview of the canal")])]), e._v(" "), t("div", {
                    staticClass: "tabCard",
                    on: {
                        click: function(l) {
                            return e.$router.push({
                                name: "history"
                            })
                        }
                    }
                }, [t("p", [e._v("历史沿革")]), e._v(" "), t("p", [e._v("History")])]), e._v(" "), t("div", {
                    staticClass: "tabCard bigCard",
                    on: {
                        click: function(l) {
                            return e.$router.push({
                                name: "graph"
                            })
                        }
                    }
                }, [t("p", [e._v("知识图谱")]), e._v(" "), t("p", [e._v("Knowledge Graph")])])]), e._v(" "), t("div", {
                    staticClass: "littleTab"
                }, [t("el-tabs", {
                    on: {
                        "tab-click": e.handleClick
                    },
                    model: {
                        value: e.activeName,
                        callback: function(l) {
                            e.activeName = l
                        },
                        expression: "activeName"
                    }
                }, [t("el-tab-pane", {
                    attrs: {
                        label: "河道图谱",
                        name: "first"
                    }
                }, [t("div", {
                    staticClass: "mapContent"
                }, [e.refreshScroll ? t("el-scrollbar", {
                    staticStyle: {
                        height: "20vh"
                    }
                }, [t("p", [e._v(e._s(e.riverData.value))])]) : e._e(), e._v(" "), t("div", {
                    staticClass: "mapContainer"
                }, [t("riverMap", {
                    attrs: {
                        activeItem: {
                            name: "test"
                        },
                        activeCityItem: {}
                    },
                    on: {
                        riverClick: e.riverClick
                    }
                })], 1)], 1), e._v(" "), t("div", {
                    staticClass: "chartContent"
                }, [t("div", {
                    staticStyle: {
                        width: "40vw",
                        height: "70vh"
                    },
                    attrs: {
                        id: "riverChart"
                    }
                })])]), e._v(" "), t("el-tab-pane", {
                    attrs: {
                        label: "城镇图谱",
                        name: "second"
                    }
                }, [t("div", {
                    staticClass: "mapContent2"
                }, [e._e(), e._v(" "), t("div", {
                    staticClass: "mapContainer"
                }, [t("riverMap", {
                    attrs: {
                        activeItem: {},
                        activeCityItem: {},
                        hiddenCity: ["商丘", "德州", "郑州"]
                    },
                    on: {
                        cityClick: e.cityClick
                    }
                })], 1)]), e._v(" "), t("div", {
                    staticClass: "chartContent"
                }, [t("div", {
                    staticStyle: {
                        width: "40vw",
                        height: "70vh"
                    },
                    attrs: {
                        id: "cityChart"
                    }
                })])]), e._v(" "), t("el-tab-pane", {
                    attrs: {
                        label: "遗产图谱",
                        name: "third"
                    }
                }, [t("div", {
                    staticClass: "chartContent"
                }, [t("el-scrollbar", {
                    ref: "mineScroll",
                    staticStyle: {
                        height: "70vh"
                    },
                    attrs: {
                        "view-style": [{
                            height: "100%"
                        }]
                    }
                }, [t("div", {
                    staticStyle: {
                        width: "80vw",
                        height: "800vh"
                    },
                    attrs: {
                        id: "heritageChart"
                    }
                })])], 1)]), e._v(" "), t("el-tab-pane", {
                    attrs: {
                        label: "人物图谱",
                        name: "fourth"
                    }
                }, [t("div", {
                    staticStyle: {
                        position: "absolute",
                        left: "0"
                    }
                }, [t("div", {
                    staticClass: "secondTitle"
                }, [e._v("相关人物")]), e._v(" "), t("div", {
                    staticClass: "riverCards",
                    staticStyle: {
                        "flex-wrap": "wrap",
                        "justify-content": "flex-start"
                    }
                }, e._l(e.cityCards, function(l) {
                    return t("div", {
                        key: l.name,
                        staticClass: "riverCard",
                        class: e.activeFigure == l.name ? "activeFigure" : "",
                        staticStyle: {
                            margin: "0 3px",
                            "margin-bottom": "5px"
                        },
                        on: {
                            click: function(t) {
                                return e.chooseFigure(l)
                            }
                        }
                    }, [t("div", {
                        staticClass: "cityText"
                    }, [e._v(e._s(l.name))])])
                }), 0), e._v(" "), t("div", {
                    staticClass: "nodeIntro"
                }, [t("h3", [e._v(e._s(e.clickNode.label))]), e._v(" "), t("p", [e._v(e._s(e.clickNode.introduced))])])]), e._v(" "), t("div", {
                    staticClass: "chartContent",
                    staticStyle: {
                        width: "50vw",
                        height: "70vh",
                        "margin-left": "30vw"
                    }
                }, [e.refreshGraph ? t("graphByG6", {
                    attrs: {
                        graphData: e.graphData,
                        userAgent: "PC"
                    }
                }) : e._e()], 1)])], 1)], 1)])])
            },
            staticRenderFns: []
        };
        var J = t("VU/8")(V, P, !1, function(e) {
            t("akb9")
        }, "data-v-af5020be", null);
        l.default = J.exports
    },
    fwFA: function(e, l) {
        e.exports = [{
            name: "通惠河段主线（通惠河）",
            itemStyle: {
                borderColor: "#3DF2CF",
                color: "#3DF2CF"
            }
        }, {
            name: "河道遗存",
            itemStyle: {
                borderColor: "#15629B",
                color: "#15629B"
            }
        }, {
            name: "通惠河",
            itemStyle: {
                borderColor: "#94D6B1",
                color: "#94D6B1"
            }
        }, {
            name: "北京",
            itemStyle: {
                borderColor: "#2DF9E4",
                color: "#2DF9E4"
            }
        }, {
            name: "玉河故道",
            itemStyle: {
                borderColor: "#497E20",
                color: "#497E20"
            }
        }, {
            name: "长河",
            itemStyle: {
                borderColor: "#FFF32E",
                color: "#FFF32E"
            }
        }, {
            name: "葫芦头",
            itemStyle: {
                borderColor: "#BCBB7B",
                color: "#BCBB7B"
            }
        }, {
            name: "水体遗存",
            itemStyle: {
                borderColor: "#7C8CBC",
                color: "#7C8CBC"
            }
        }, {
            name: "平津上闸",
            itemStyle: {
                borderColor: "#BBA4CA",
                color: "#BBA4CA"
            }
        }, {
            name: "水工设施遗存",
            itemStyle: {
                borderColor: "#F23A39",
                color: "#F23A39"
            }
        }, {
            name: "永通桥",
            itemStyle: {
                borderColor: "#D64B9D",
                color: "#D64B9D"
            }
        }, {
            name: "通运桥",
            itemStyle: {
                borderColor: "#74E23C",
                color: "#74E23C"
            }
        }, {
            name: "御制通州石道碑",
            itemStyle: {
                borderColor: "#A33FC1",
                color: "#A33FC1"
            }
        }, {
            name: "相关遗产",
            itemStyle: {
                borderColor: "#8D4585",
                color: "#8D4585"
            }
        }, {
            name: "燃灯佛舍利塔",
            itemStyle: {
                borderColor: "#00F0A3",
                color: "#00F0A3"
            }
        }, {
            name: "通州北城墙遗址",
            itemStyle: {
                borderColor: "#E7FA0E",
                color: "#E7FA0E"
            }
        }, {
            name: "北运河段主线（北运河-子牙河）",
            itemStyle: {
                borderColor: "#17F2FD",
                color: "#17F2FD"
            }
        }, {
            name: "北运河",
            itemStyle: {
                borderColor: "#9C2C9A",
                color: "#9C2C9A"
            }
        }, {
            name: "天津",
            itemStyle: {
                borderColor: "#4A1E67",
                color: "#4A1E67"
            }
        }, {
            name: "青龙湾减河河首",
            itemStyle: {
                borderColor: "#4F3DFB",
                color: "#4F3DFB"
            }
        }, {
            name: "红庙村金门闸",
            itemStyle: {
                borderColor: "#67943D",
                color: "#67943D"
            }
        }, {
            name: "筐儿港减河河首",
            itemStyle: {
                borderColor: "#2E03EE",
                color: "#2E03EE"
            }
        }, {
            name: "筐儿港减河分水设施遗址",
            itemStyle: {
                borderColor: "#14F26A",
                color: "#14F26A"
            }
        }, {
            name: "三角坝沉船",
            itemStyle: {
                borderColor: "#15F788",
                color: "#15F788"
            }
        }, {
            name: "附属遗存",
            itemStyle: {
                borderColor: "#0AEFD5",
                color: "#0AEFD5"
            }
        }, {
            name: "东西仓沉船",
            itemStyle: {
                borderColor: "#14FFED",
                color: "#14FFED"
            }
        }, {
            name: "十四仓遗址",
            itemStyle: {
                borderColor: "#5B7778",
                color: "#5B7778"
            }
        }, {
            name: "陈庄沉船",
            itemStyle: {
                borderColor: "#A34078",
                color: "#A34078"
            }
        }, {
            name: "双树村沉船",
            itemStyle: {
                borderColor: "#5E4F5F",
                color: "#5E4F5F"
            }
        }, {
            name: "聂官屯沉船",
            itemStyle: {
                borderColor: "#DCC0CF",
                color: "#DCC0CF"
            }
        }, {
            name: "杨村五街沉船",
            itemStyle: {
                borderColor: "#2004F5",
                color: "#2004F5"
            }
        }, {
            name: "顺直水利委员会旧址",
            itemStyle: {
                borderColor: "#7FF95E",
                color: "#7FF95E"
            }
        }, {
            name: "“导流济运”碑",
            itemStyle: {
                borderColor: "#F7B031",
                color: "#F7B031"
            }
        }, {
            name: "“阅筐儿港减河水坝作诗”碑",
            itemStyle: {
                borderColor: "#B16B9B",
                color: "#B16B9B"
            }
        }, {
            name: "天后宫",
            itemStyle: {
                borderColor: "#AE78DE",
                color: "#AE78DE"
            }
        }, {
            name: "天妃宫遗址",
            itemStyle: {
                borderColor: "#CC12A4",
                color: "#CC12A4"
            }
        }, {
            name: "廊坊",
            itemStyle: {
                borderColor: "#20FF10",
                color: "#20FF10"
            }
        }, {
            name: "南运河段主线（南运河-卫运河）",
            itemStyle: {
                borderColor: "#1C5E3D",
                color: "#1C5E3D"
            }
        }, {
            name: "南运河",
            itemStyle: {
                borderColor: "#D36F34",
                color: "#D36F34"
            }
        }, {
            name: "沧州",
            itemStyle: {
                borderColor: "#77175E",
                color: "#77175E"
            }
        }, {
            name: "衡水",
            itemStyle: {
                borderColor: "#43741E",
                color: "#43741E"
            }
        }, {
            name: "德州",
            itemStyle: {
                borderColor: "#A909A9",
                color: "#A909A9"
            }
        }, {
            name: "邢台",
            itemStyle: {
                borderColor: "#0E9073",
                color: "#0E9073"
            }
        }, {
            name: "聊城",
            itemStyle: {
                borderColor: "#65FFE0",
                color: "#65FFE0"
            }
        }, {
            name: "马厂减河河首",
            itemStyle: {
                borderColor: "#03B124",
                color: "#03B124"
            }
        }, {
            name: "九宣闸",
            itemStyle: {
                borderColor: "#FFD898",
                color: "#FFD898"
            }
        }, {
            name: "石家大院",
            itemStyle: {
                borderColor: "#702944",
                color: "#702944"
            }
        }, {
            name: "靳官屯闸碑",
            itemStyle: {
                borderColor: "#1B5661",
                color: "#1B5661"
            }
        }, {
            name: "捷地减河河首",
            itemStyle: {
                borderColor: "#3548DB",
                color: "#3548DB"
            }
        }, {
            name: "捷地分洪闸",
            itemStyle: {
                borderColor: "#2AB9C5",
                color: "#2AB9C5"
            }
        }, {
            name: "1933年德国西门子启闭机",
            itemStyle: {
                borderColor: "#F1DACC",
                color: "#F1DACC"
            }
        }, {
            name: "连镇谢家坝",
            itemStyle: {
                borderColor: "#D8907D",
                color: "#D8907D"
            }
        }, {
            name: "东光码头沉船遗址",
            itemStyle: {
                borderColor: "#3ED30B",
                color: "#3ED30B"
            }
        }, {
            name: "马厂炮台及军营遗址",
            itemStyle: {
                borderColor: "#421A89",
                color: "#421A89"
            }
        }, {
            name: "乾隆御书《捷地、兴济坝工纪事诗碑》",
            itemStyle: {
                borderColor: "#2403B8",
                color: "#2403B8"
            }
        }, {
            name: "清代宪示碑",
            itemStyle: {
                borderColor: "#6AFFE5",
                color: "#6AFFE5"
            }
        }, {
            name: "泊头清真寺",
            itemStyle: {
                borderColor: "#0443C2",
                color: "#0443C2"
            }
        }, {
            name: "华家口夯土险工",
            itemStyle: {
                borderColor: "#9B4042",
                color: "#9B4042"
            }
        }, {
            name: "郑口挑水坝",
            itemStyle: {
                borderColor: "#A9EFA3",
                color: "#A9EFA3"
            }
        }, {
            name: "德州码头",
            itemStyle: {
                borderColor: "#23DDCA",
                color: "#23DDCA"
            }
        }, {
            name: "四女寺枢纽",
            itemStyle: {
                borderColor: "#225BE8",
                color: "#225BE8"
            }
        }, {
            name: "四女寺减河河首",
            itemStyle: {
                borderColor: "#23F307",
                color: "#23F307"
            }
        }, {
            name: "德州仓储",
            itemStyle: {
                borderColor: "#DC492D",
                color: "#DC492D"
            }
        }, {
            name: "苏禄王墓",
            itemStyle: {
                borderColor: "#D58159",
                color: "#D58159"
            }
        }, {
            name: "朱唐口险工",
            itemStyle: {
                borderColor: "#E8793D",
                color: "#E8793D"
            }
        }, {
            name: "油坊码头遗址及险工",
            itemStyle: {
                borderColor: "#BEB22D",
                color: "#BEB22D"
            }
        }, {
            name: "陈窑窑址",
            itemStyle: {
                borderColor: "#9F4D5B",
                color: "#9F4D5B"
            }
        }, {
            name: "会通河段主线（会通河及遗址-南阳新河）",
            itemStyle: {
                borderColor: "#C81A83",
                color: "#C81A83"
            }
        }, {
            name: "会通河段",
            itemStyle: {
                borderColor: "#7F18DD",
                color: "#7F18DD"
            }
        }, {
            name: "泰安",
            itemStyle: {
                borderColor: "#5CAC2F",
                color: "#5CAC2F"
            }
        }, {
            name: "济宁",
            itemStyle: {
                borderColor: "#8B1092",
                color: "#8B1092"
            }
        }, {
            name: "陶城铺运河",
            itemStyle: {
                borderColor: "#7C95A3",
                color: "#7C95A3"
            }
        }, {
            name: "小汶河",
            itemStyle: {
                borderColor: "#69CBE5",
                color: "#69CBE5"
            }
        }, {
            name: "临清闸（问津桥）",
            itemStyle: {
                borderColor: "#EED187",
                color: "#EED187"
            }
        }, {
            name: "月径桥",
            itemStyle: {
                borderColor: "#8F28DA",
                color: "#8F28DA"
            }
        }, {
            name: "会通闸（会通桥）",
            itemStyle: {
                borderColor: "#C89642",
                color: "#C89642"
            }
        }, {
            name: "砖闸（二闸）",
            itemStyle: {
                borderColor: "#A9997B",
                color: "#A9997B"
            }
        }, {
            name: "戴湾闸",
            itemStyle: {
                borderColor: "#F1256C",
                color: "#F1256C"
            }
        }, {
            name: "土桥闸",
            itemStyle: {
                borderColor: "#FDEAF3",
                color: "#FDEAF3"
            }
        }, {
            name: "梁乡闸",
            itemStyle: {
                borderColor: "#4839BA",
                color: "#4839BA"
            }
        }, {
            name: "永通闸（辛闸）",
            itemStyle: {
                borderColor: "#D48768",
                color: "#D48768"
            }
        }, {
            name: "迎春桥",
            itemStyle: {
                borderColor: "#4B4515",
                color: "#4B4515"
            }
        }, {
            name: "东昌府运河大小码头",
            itemStyle: {
                borderColor: "#AC4C5F",
                color: "#AC4C5F"
            }
        }, {
            name: "李海务闸",
            itemStyle: {
                borderColor: "#67C19B",
                color: "#67C19B"
            }
        }, {
            name: "周家店船闸",
            itemStyle: {
                borderColor: "#8DC511",
                color: "#8DC511"
            }
        }, {
            name: "七级下闸",
            itemStyle: {
                borderColor: "#547AFC",
                color: "#547AFC"
            }
        }, {
            name: "七级上闸",
            itemStyle: {
                borderColor: "#C9830D",
                color: "#C9830D"
            }
        }, {
            name: "阿城下闸",
            itemStyle: {
                borderColor: "#29F103",
                color: "#29F103"
            }
        }, {
            name: "阿城上闸",
            itemStyle: {
                borderColor: "#487DDA",
                color: "#487DDA"
            }
        }, {
            name: "荆门下闸",
            itemStyle: {
                borderColor: "#3297AF",
                color: "#3297AF"
            }
        }, {
            name: "荆门上闸",
            itemStyle: {
                borderColor: "#7E4CE9",
                color: "#7E4CE9"
            }
        }, {
            name: "陶城铺闸",
            itemStyle: {
                borderColor: "#6EE564",
                color: "#6EE564"
            }
        }, {
            name: "临清运河钞关",
            itemStyle: {
                borderColor: "#CE1A96",
                color: "#CE1A96"
            }
        }, {
            name: "阿城盐运司",
            itemStyle: {
                borderColor: "#2C06BD",
                color: "#2C06BD"
            }
        }, {
            name: "临清舍利宝塔",
            itemStyle: {
                borderColor: "#36F1B1",
                color: "#36F1B1"
            }
        }, {
            name: "临清清真寺、清真东寺",
            itemStyle: {
                borderColor: "#268110",
                color: "#268110"
            }
        }, {
            name: "鳌头矶",
            itemStyle: {
                borderColor: "#1E1C94",
                color: "#1E1C94"
            }
        }, {
            name: "河隈张庄明清砖官窑遗址",
            itemStyle: {
                borderColor: "#B6B61D",
                color: "#B6B61D"
            }
        }, {
            name: "聊城山陕会馆",
            itemStyle: {
                borderColor: "#882763",
                color: "#882763"
            }
        }, {
            name: "上泉古泉群",
            itemStyle: {
                borderColor: "#F86C79",
                color: "#F86C79"
            }
        }, {
            name: "戴庙闸",
            itemStyle: {
                borderColor: "#DD51B3",
                color: "#DD51B3"
            }
        }, {
            name: "安山闸",
            itemStyle: {
                borderColor: "#609F97",
                color: "#609F97"
            }
        }, {
            name: "堽城坝遗址",
            itemStyle: {
                borderColor: "#4468B0",
                color: "#4468B0"
            }
        }, {
            name: "戴村坝",
            itemStyle: {
                borderColor: "#A8CB05",
                color: "#A8CB05"
            }
        }, {
            name: "禹王庙",
            itemStyle: {
                borderColor: "#D96EFD",
                color: "#D96EFD"
            }
        }, {
            name: "南旺湖遗址",
            itemStyle: {
                borderColor: "#F317AF",
                color: "#F317AF"
            }
        }, {
            name: "泗河泉林",
            itemStyle: {
                borderColor: "#F2FFAA",
                color: "#F2FFAA"
            }
        }, {
            name: "浣笔泉",
            itemStyle: {
                borderColor: "#6D78DA",
                color: "#6D78DA"
            }
        }, {
            name: "南四湖",
            itemStyle: {
                borderColor: "#6E7F2C",
                color: "#6E7F2C"
            }
        }, {
            name: "靳口闸",
            itemStyle: {
                borderColor: "#CB5FE8",
                color: "#CB5FE8"
            }
        }, {
            name: "袁口闸",
            itemStyle: {
                borderColor: "#5C42B9",
                color: "#5C42B9"
            }
        }, {
            name: "十里闸",
            itemStyle: {
                borderColor: "#939E20",
                color: "#939E20"
            }
        }, {
            name: "运河砖砌河堤",
            itemStyle: {
                borderColor: "#98D85F",
                color: "#98D85F"
            }
        }, {
            name: "邢通斗门遗址",
            itemStyle: {
                borderColor: "#8222C6",
                color: "#8222C6"
            }
        }, {
            name: "徐建口斗门遗址",
            itemStyle: {
                borderColor: "#6FBCB3",
                color: "#6FBCB3"
            }
        }, {
            name: "柳林闸",
            itemStyle: {
                borderColor: "#28E513",
                color: "#28E513"
            }
        }, {
            name: "寺前铺闸",
            itemStyle: {
                borderColor: "#4C44F7",
                color: "#4C44F7"
            }
        }, {
            name: "漕井桥",
            itemStyle: {
                borderColor: "#BEC1EC",
                color: "#BEC1EC"
            }
        }, {
            name: "通济闸",
            itemStyle: {
                borderColor: "#DCB10E",
                color: "#DCB10E"
            }
        }, {
            name: "天井闸",
            itemStyle: {
                borderColor: "#C2031A",
                color: "#C2031A"
            }
        }, {
            name: "太和桥",
            itemStyle: {
                borderColor: "#5E121B",
                color: "#5E121B"
            }
        }, {
            name: "金口坝",
            itemStyle: {
                borderColor: "#E69EC7",
                color: "#E69EC7"
            }
        }, {
            name: "仲浅闸",
            itemStyle: {
                borderColor: "#A0B5B8",
                color: "#A0B5B8"
            }
        }, {
            name: "师庄闸",
            itemStyle: {
                borderColor: "#5AA5DE",
                color: "#5AA5DE"
            }
        }, {
            name: "枣林闸",
            itemStyle: {
                borderColor: "#4E8C77",
                color: "#4E8C77"
            }
        }, {
            name: "南阳闸",
            itemStyle: {
                borderColor: "#F4EE8F",
                color: "#F4EE8F"
            }
        }, {
            name: "利建闸",
            itemStyle: {
                borderColor: "#39E728",
                color: "#39E728"
            }
        }, {
            name: "济宁河道总督府遗址",
            itemStyle: {
                borderColor: "#B7C5AD",
                color: "#B7C5AD"
            }
        }, {
            name: "大元新开会通河记事碑",
            itemStyle: {
                borderColor: "#4489CE",
                color: "#4489CE"
            }
        }, {
            name: "开河闸碑",
            itemStyle: {
                borderColor: "#A4BE42",
                color: "#A4BE42"
            }
        }, {
            name: "南旺分水龙王庙遗址",
            itemStyle: {
                borderColor: "#A7D64A",
                color: "#A7D64A"
            }
        }, {
            name: "济宁东大寺",
            itemStyle: {
                borderColor: "#38D607",
                color: "#38D607"
            }
        }, {
            name: "清雍正疏浚济州河碑",
            itemStyle: {
                borderColor: "#F55FE0",
                color: "#F55FE0"
            }
        }, {
            name: "中河段主线（泇河-皂河-中河）",
            itemStyle: {
                borderColor: "#63C5C1",
                color: "#63C5C1"
            }
        }, {
            name: "中河",
            itemStyle: {
                borderColor: "#B09AD1",
                color: "#B09AD1"
            }
        }, {
            name: "枣庄",
            itemStyle: {
                borderColor: "#8E53E2",
                color: "#8E53E2"
            }
        }, {
            name: "徐州",
            itemStyle: {
                borderColor: "#B72D65",
                color: "#B72D65"
            }
        }, {
            name: "宿迁",
            itemStyle: {
                borderColor: "#D759E9",
                color: "#D759E9"
            }
        }, {
            name: "淮安",
            itemStyle: {
                borderColor: "#6AE768",
                color: "#6AE768"
            }
        }, {
            name: "老不牢河邳州段",
            itemStyle: {
                borderColor: "#E4C291",
                color: "#E4C291"
            }
        }, {
            name: "废黄河徐州吕梁-淮安清口",
            itemStyle: {
                borderColor: "#0C0DA0",
                color: "#0C0DA0"
            }
        }, {
            name: "通惠闸",
            itemStyle: {
                borderColor: "#CCE5EA",
                color: "#CCE5EA"
            }
        }, {
            name: "微山县乾隆御碑",
            itemStyle: {
                borderColor: "#9ED620",
                color: "#9ED620"
            }
        }, {
            name: "台儿庄月河码头群",
            itemStyle: {
                borderColor: "#2BE01C",
                color: "#2BE01C"
            }
        }, {
            name: "窑湾镇历史街区",
            itemStyle: {
                borderColor: "#E55220",
                color: "#E55220"
            }
        }, {
            name: "疏凿吕梁洪记碑",
            itemStyle: {
                borderColor: "#0B77B3",
                color: "#0B77B3"
            }
        }, {
            name: "李口吴集月堤",
            itemStyle: {
                borderColor: "#636D90",
                color: "#636D90"
            }
        }, {
            name: "新袁杨大滩月堤",
            itemStyle: {
                borderColor: "#217BCA",
                color: "#217BCA"
            }
        }, {
            name: "龙王庙行宫",
            itemStyle: {
                borderColor: "#B2914E",
                color: "#B2914E"
            }
        }, {
            name: "宿迁大王庙",
            itemStyle: {
                borderColor: "#B4B68F",
                color: "#B4B68F"
            }
        }, {
            name: "淮安三百六十丈月堤",
            itemStyle: {
                borderColor: "#95B7F1",
                color: "#95B7F1"
            }
        }, {
            name: "双金闸",
            itemStyle: {
                borderColor: "#86E248",
                color: "#86E248"
            }
        }, {
            name: "淮扬运河段主线（淮安明清运河故道—现京杭运河—扬州城明清运河故道—伊娄河故道）",
            itemStyle: {
                borderColor: "#067809",
                color: "#067809"
            }
        }, {
            name: "淮扬运河",
            itemStyle: {
                borderColor: "#1CDCC5",
                color: "#1CDCC5"
            }
        }, {
            name: "扬州",
            itemStyle: {
                borderColor: "#6105B2",
                color: "#6105B2"
            }
        }, {
            name: "宝应宋泾河",
            itemStyle: {
                borderColor: "#D4E4BC",
                color: "#D4E4BC"
            }
        }, {
            name: "宝应明清运河故道",
            itemStyle: {
                borderColor: "#33C014",
                color: "#33C014"
            }
        }, {
            name: "高邮明清运河故道",
            itemStyle: {
                borderColor: "#280A98",
                color: "#280A98"
            }
        }, {
            name: "邵伯明清运河故道",
            itemStyle: {
                borderColor: "#A3BBDA",
                color: "#A3BBDA"
            }
        }, {
            name: "古邗沟故道（邗沟东道，扬州城区段）",
            itemStyle: {
                borderColor: "#7F5EAD",
                color: "#7F5EAD"
            }
        }, {
            name: "子婴减河",
            itemStyle: {
                borderColor: "#0177D5",
                color: "#0177D5"
            }
        }, {
            name: "仪扬运河",
            itemStyle: {
                borderColor: "#682B66",
                color: "#682B66"
            }
        }, {
            name: "洪泽湖",
            itemStyle: {
                borderColor: "#000751",
                color: "#000751"
            }
        }, {
            name: "洪泽湖口引河及堤防",
            itemStyle: {
                borderColor: "#D568AC",
                color: "#D568AC"
            }
        }, {
            name: "济运设施",
            itemStyle: {
                borderColor: "#7B22E4",
                color: "#7B22E4"
            }
        }, {
            name: "御黄束清设施",
            itemStyle: {
                borderColor: "#1EF7B8",
                color: "#1EF7B8"
            }
        }, {
            name: "中运河堤坝",
            itemStyle: {
                borderColor: "#3A789A",
                color: "#3A789A"
            }
        }, {
            name: "黄河故道及堤工",
            itemStyle: {
                borderColor: "#139E4E",
                color: "#139E4E"
            }
        }, {
            name: "里运河旧道及堤坝",
            itemStyle: {
                borderColor: "#68D973",
                color: "#68D973"
            }
        }, {
            name: "转水墩",
            itemStyle: {
                borderColor: "#1B9B89",
                color: "#1B9B89"
            }
        }, {
            name: "码头三闸",
            itemStyle: {
                borderColor: "#4C5181",
                color: "#4C5181"
            }
        }, {
            name: "古清口遗址",
            itemStyle: {
                borderColor: "#027AD5",
                color: "#027AD5"
            }
        }, {
            name: "洪泽湖大堤",
            itemStyle: {
                borderColor: "#38C32F",
                color: "#38C32F"
            }
        }, {
            name: "淮安里运河石驳岸",
            itemStyle: {
                borderColor: "#41B525",
                color: "#41B525"
            }
        }, {
            name: "清江大闸",
            itemStyle: {
                borderColor: "#850DA7",
                color: "#850DA7"
            }
        }, {
            name: "淮安古运河石码头",
            itemStyle: {
                borderColor: "#E7FA8C",
                color: "#E7FA8C"
            }
        }, {
            name: "淮安古运河石堤",
            itemStyle: {
                borderColor: "#EC87DA",
                color: "#EC87DA"
            }
        }, {
            name: "河道总督署遗址及清晏园",
            itemStyle: {
                borderColor: "#C7D1D0",
                color: "#C7D1D0"
            }
        }, {
            name: "丰济仓遗址",
            itemStyle: {
                borderColor: "#110CBE",
                color: "#110CBE"
            }
        }, {
            name: "淮安钞关遗址",
            itemStyle: {
                borderColor: "#D82BC0",
                color: "#D82BC0"
            }
        }, {
            name: "总督漕运公署遗址",
            itemStyle: {
                borderColor: "#70A127",
                color: "#70A127"
            }
        }, {
            name: "御制重修惠济祠碑",
            itemStyle: {
                borderColor: "#DBABE2",
                color: "#DBABE2"
            }
        }, {
            name: "乾隆阅河诗碑",
            itemStyle: {
                borderColor: "#D3332D",
                color: "#D3332D"
            }
        }, {
            name: "高家堰铁牛",
            itemStyle: {
                borderColor: "#06E553",
                color: "#06E553"
            }
        }, {
            name: "高良涧铁牛",
            itemStyle: {
                borderColor: "#BC919E",
                color: "#BC919E"
            }
        }, {
            name: "三河铁牛",
            itemStyle: {
                borderColor: "#478C5A",
                color: "#478C5A"
            }
        }, {
            name: "清江浦楼",
            itemStyle: {
                borderColor: "#82A77B",
                color: "#82A77B"
            }
        }, {
            name: "清江清真寺",
            itemStyle: {
                borderColor: "#33D9DA",
                color: "#33D9DA"
            }
        }, {
            name: "吴公祠",
            itemStyle: {
                borderColor: "#F26A4B",
                color: "#F26A4B"
            }
        }, {
            name: "陈潘二公祠",
            itemStyle: {
                borderColor: "#50F964",
                color: "#50F964"
            }
        }, {
            name: "郑文英墓",
            itemStyle: {
                borderColor: "#B9FD61",
                color: "#B9FD61"
            }
        }, {
            name: "河下历史文化街区",
            itemStyle: {
                borderColor: "#0C652B",
                color: "#0C652B"
            }
        }, {
            name: "康熙乾隆御碑（淮安）",
            itemStyle: {
                borderColor: "#C8C16A",
                color: "#C8C16A"
            }
        }, {
            name: "淮安府衙",
            itemStyle: {
                borderColor: "#79141A",
                color: "#79141A"
            }
        }, {
            name: "镇淮楼",
            itemStyle: {
                borderColor: "#9C91CC",
                color: "#9C91CC"
            }
        }, {
            name: "瘦西湖",
            itemStyle: {
                borderColor: "#3B10DD",
                color: "#3B10DD"
            }
        }, {
            name: "高邮段里运河东堤",
            itemStyle: {
                borderColor: "#8F042B",
                color: "#8F042B"
            }
        }, {
            name: "茱萸湾古闸",
            itemStyle: {
                borderColor: "#D6A893",
                color: "#D6A893"
            }
        }, {
            name: "宝应跃龙关遗址",
            itemStyle: {
                borderColor: "#9FE4D0",
                color: "#9FE4D0"
            }
        }, {
            name: "高邮段里运河西堤",
            itemStyle: {
                borderColor: "#DC0423",
                color: "#DC0423"
            }
        }, {
            name: "高邮御码头",
            itemStyle: {
                borderColor: "#9CDA7D",
                color: "#9CDA7D"
            }
        }, {
            name: "耿庙石柱",
            itemStyle: {
                borderColor: "#0D13A5",
                color: "#0D13A5"
            }
        }, {
            name: "平津堰遗址",
            itemStyle: {
                borderColor: "#5940F5",
                color: "#5940F5"
            }
        }, {
            name: "邵伯古堤",
            itemStyle: {
                borderColor: "#AF84F4",
                color: "#AF84F4"
            }
        }, {
            name: "邵伯老船闸",
            itemStyle: {
                borderColor: "#DEB68E",
                color: "#DEB68E"
            }
        }, {
            name: "邵伯码头",
            itemStyle: {
                borderColor: "#861B4E",
                color: "#861B4E"
            }
        }, {
            name: "子婴减河闸",
            itemStyle: {
                borderColor: "#CD7268",
                color: "#CD7268"
            }
        }, {
            name: "盂城驿",
            itemStyle: {
                borderColor: "#265B7B",
                color: "#265B7B"
            }
        }, {
            name: "两淮都转盐运使司衙署",
            itemStyle: {
                borderColor: "#1C1960",
                color: "#1C1960"
            }
        }, {
            name: "扬州城遗址",
            itemStyle: {
                borderColor: "#814A26",
                color: "#814A26"
            }
        }, {
            name: "天宁寺行宫（含重宁寺）",
            itemStyle: {
                borderColor: "#53EBC6",
                color: "#53EBC6"
            }
        }, {
            name: "个园",
            itemStyle: {
                borderColor: "#E2F63D",
                color: "#E2F63D"
            }
        }, {
            name: "东关街历史文化街区",
            itemStyle: {
                borderColor: "#9BC924",
                color: "#9BC924"
            }
        }, {
            name: "汪氏小苑",
            itemStyle: {
                borderColor: "#A24453",
                color: "#A24453"
            }
        }, {
            name: "普哈丁墓",
            itemStyle: {
                borderColor: "#2E28BA",
                color: "#2E28BA"
            }
        }, {
            name: "仙鹤寺",
            itemStyle: {
                borderColor: "#02BCEA",
                color: "#02BCEA"
            }
        }, {
            name: "汪鲁门宅",
            itemStyle: {
                borderColor: "#DA3B5D",
                color: "#DA3B5D"
            }
        }, {
            name: "何园",
            itemStyle: {
                borderColor: "#0412DE",
                color: "#0412DE"
            }
        }, {
            name: "南河下历史文化街区",
            itemStyle: {
                borderColor: "#9E4AD1",
                color: "#9E4AD1"
            }
        }, {
            name: "卢绍绪宅",
            itemStyle: {
                borderColor: "#FF6F0E",
                color: "#FF6F0E"
            }
        }, {
            name: "盐宗庙",
            itemStyle: {
                borderColor: "#884BEF",
                color: "#884BEF"
            }
        }, {
            name: "马棚湾铁牛",
            itemStyle: {
                borderColor: "#6067A8",
                color: "#6067A8"
            }
        }, {
            name: "镇国寺塔",
            itemStyle: {
                borderColor: "#A4847F",
                color: "#A4847F"
            }
        }, {
            name: "高邮南门大街历史地段",
            itemStyle: {
                borderColor: "#3BD7B3",
                color: "#3BD7B3"
            }
        }, {
            name: "邵伯铁牛",
            itemStyle: {
                borderColor: "#2C16E3",
                color: "#2C16E3"
            }
        }, {
            name: "江北运河复堤碑记碑",
            itemStyle: {
                borderColor: "#46C3B3",
                color: "#46C3B3"
            }
        }, {
            name: "镇江城区运河故道",
            itemStyle: {
                borderColor: "#58A522",
                color: "#58A522"
            }
        }, {
            name: "江南运河",
            itemStyle: {
                borderColor: "#51C6C7",
                color: "#51C6C7"
            }
        }, {
            name: "镇江",
            itemStyle: {
                borderColor: "#44C7D1",
                color: "#44C7D1"
            }
        }, {
            name: "丹徒河",
            itemStyle: {
                borderColor: "#06A2B3",
                color: "#06A2B3"
            }
        }, {
            name: "现京杭运河镇江-常州段",
            itemStyle: {
                borderColor: "#E65B9A",
                color: "#E65B9A"
            }
        }, {
            name: "常州",
            itemStyle: {
                borderColor: "#92BFF5",
                color: "#92BFF5"
            }
        }, {
            name: "常州城区运河故道",
            itemStyle: {
                borderColor: "#40C46C",
                color: "#40C46C"
            }
        }, {
            name: "现京杭运河常州-无锡段",
            itemStyle: {
                borderColor: "#AF646C",
                color: "#AF646C"
            }
        }, {
            name: "无锡",
            itemStyle: {
                borderColor: "#05B1CA",
                color: "#05B1CA"
            }
        }, {
            name: "无锡城区运河故道",
            itemStyle: {
                borderColor: "#C0842D",
                color: "#C0842D"
            }
        }, {
            name: "现京杭运河无锡-苏州段",
            itemStyle: {
                borderColor: "#176505",
                color: "#176505"
            }
        }, {
            name: "苏州",
            itemStyle: {
                borderColor: "#1600F5",
                color: "#1600F5"
            }
        }, {
            name: "苏州城区运河故道",
            itemStyle: {
                borderColor: "#5EDBB9",
                color: "#5EDBB9"
            }
        }, {
            name: "现京杭运河苏州-吴江段",
            itemStyle: {
                borderColor: "#59BDA2",
                color: "#59BDA2"
            }
        }, {
            name: "江南运河吴江-嘉兴-杭州段",
            itemStyle: {
                borderColor: "#66C6E2",
                color: "#66C6E2"
            }
        }, {
            name: "嘉兴",
            itemStyle: {
                borderColor: "#8C4AB1",
                color: "#8C4AB1"
            }
        }, {
            name: "杭州",
            itemStyle: {
                borderColor: "#2444AD",
                color: "#2444AD"
            }
        }, {
            name: "杭州中河-龙山河",
            itemStyle: {
                borderColor: "#5A1CB4",
                color: "#5A1CB4"
            }
        }, {
            name: "古新河",
            itemStyle: {
                borderColor: "#D6CE8A",
                color: "#D6CE8A"
            }
        }, {
            name: "余杭塘河",
            itemStyle: {
                borderColor: "#9C46FC",
                color: "#9C46FC"
            }
        }, {
            name: "頔塘东段（平望—南浔，含頔塘故道）",
            itemStyle: {
                borderColor: "#8BAE82",
                color: "#8BAE82"
            }
        }, {
            name: "湖州",
            itemStyle: {
                borderColor: "#1D355A",
                color: "#1D355A"
            }
        }, {
            name: "丹阳开泰桥",
            itemStyle: {
                borderColor: "#DF3A32",
                color: "#DF3A32"
            }
        }, {
            name: "镇江虎踞桥",
            itemStyle: {
                borderColor: "#ECA512",
                color: "#ECA512"
            }
        }, {
            name: "西津渡古街",
            itemStyle: {
                borderColor: "#818332",
                color: "#818332"
            }
        }, {
            name: "新河街",
            itemStyle: {
                borderColor: "#F958B1",
                color: "#F958B1"
            }
        }, {
            name: "常州万缘桥",
            itemStyle: {
                borderColor: "#16D295",
                color: "#16D295"
            }
        }, {
            name: "常州文亨桥",
            itemStyle: {
                borderColor: "#57C18B",
                color: "#57C18B"
            }
        }, {
            name: "青果巷码头群及古纤道",
            itemStyle: {
                borderColor: "#03D61C",
                color: "#03D61C"
            }
        }, {
            name: "常州飞虹桥",
            itemStyle: {
                borderColor: "#6029A8",
                color: "#6029A8"
            }
        }, {
            name: "常州新坊桥",
            itemStyle: {
                borderColor: "#42CB3B",
                color: "#42CB3B"
            }
        }, {
            name: "常州广济桥",
            itemStyle: {
                borderColor: "#092082",
                color: "#092082"
            }
        }, {
            name: "常州万安桥",
            itemStyle: {
                borderColor: "#620E6E",
                color: "#620E6E"
            }
        }, {
            name: "青果巷历史街区",
            itemStyle: {
                borderColor: "#4EC86C",
                color: "#4EC86C"
            }
        }, {
            name: "大成三厂建筑群",
            itemStyle: {
                borderColor: "#B9B359",
                color: "#B9B359"
            }
        }, {
            name: "茂新面粉厂",
            itemStyle: {
                borderColor: "#47D5AC",
                color: "#47D5AC"
            }
        }, {
            name: "清名桥历史街区",
            itemStyle: {
                borderColor: "#D388C3",
                color: "#D388C3"
            }
        }, {
            name: "苏州下津桥",
            itemStyle: {
                borderColor: "#1D27C9",
                color: "#1D27C9"
            }
        }, {
            name: "苏州上津桥",
            itemStyle: {
                borderColor: "#B5915E",
                color: "#B5915E"
            }
        }, {
            name: "盘门",
            itemStyle: {
                borderColor: "#73D68C",
                color: "#73D68C"
            }
        }, {
            name: "苏州吴门桥",
            itemStyle: {
                borderColor: "#B243B9",
                color: "#B243B9"
            }
        }, {
            name: "苏州灭渡桥",
            itemStyle: {
                borderColor: "#3EEA83",
                color: "#3EEA83"
            }
        }, {
            name: "宝带桥（苏州）",
            itemStyle: {
                borderColor: "#DED7D1",
                color: "#DED7D1"
            }
        }, {
            name: "吴江三里桥",
            itemStyle: {
                borderColor: "#4B637F",
                color: "#4B637F"
            }
        }, {
            name: "吴江垂虹纤道桥",
            itemStyle: {
                borderColor: "#599ED4",
                color: "#599ED4"
            }
        }, {
            name: "吴江古纤道",
            itemStyle: {
                borderColor: "#47390C",
                color: "#47390C"
            }
        }, {
            name: "吴江安民桥",
            itemStyle: {
                borderColor: "#A93915",
                color: "#A93915"
            }
        }, {
            name: "吴江安德桥",
            itemStyle: {
                borderColor: "#516759",
                color: "#516759"
            }
        }, {
            name: "三里亭",
            itemStyle: {
                borderColor: "#B1D03B",
                color: "#B1D03B"
            }
        }, {
            name: "十里亭（含石碑）",
            itemStyle: {
                borderColor: "#90E042",
                color: "#90E042"
            }
        }, {
            name: "横塘驿站",
            itemStyle: {
                borderColor: "#05D877",
                color: "#05D877"
            }
        }, {
            name: "灭渡桥水文站",
            itemStyle: {
                borderColor: "#EBA919",
                color: "#EBA919"
            }
        }, {
            name: "寒山寺",
            itemStyle: {
                borderColor: "#1C9B9E",
                color: "#1C9B9E"
            }
        }, {
            name: "皇亭三碑",
            itemStyle: {
                borderColor: "#4FB732",
                color: "#4FB732"
            }
        }, {
            name: "苏纶纱厂旧址",
            itemStyle: {
                borderColor: "#227B3D",
                color: "#227B3D"
            }
        }, {
            name: "闻店桥（嘉兴）",
            itemStyle: {
                borderColor: "#2CE04C",
                color: "#2CE04C"
            }
        }, {
            name: "长虹桥（嘉兴）",
            itemStyle: {
                borderColor: "#F1D596",
                color: "#F1D596"
            }
        }, {
            name: "分水墩",
            itemStyle: {
                borderColor: "#362B43",
                color: "#362B43"
            }
        }, {
            name: "秀城桥",
            itemStyle: {
                borderColor: "#5A7AFF",
                color: "#5A7AFF"
            }
        }, {
            name: "司马高桥（嘉兴）",
            itemStyle: {
                borderColor: "#2E1D66",
                color: "#2E1D66"
            }
        }, {
            name: "长安闸",
            itemStyle: {
                borderColor: "#22BE49",
                color: "#22BE49"
            }
        }, {
            name: "落帆亭",
            itemStyle: {
                borderColor: "#85CA1A",
                color: "#85CA1A"
            }
        }, {
            name: "嘉兴造船厂旧址",
            itemStyle: {
                borderColor: "#4CF373",
                color: "#4CF373"
            }
        }, {
            name: "嘉兴文生修道院",
            itemStyle: {
                borderColor: "#988EB3",
                color: "#988EB3"
            }
        }, {
            name: "嘉兴芦席汇历史街区",
            itemStyle: {
                borderColor: "#20FCDF",
                color: "#20FCDF"
            }
        }, {
            name: "嘉兴月河历史街区",
            itemStyle: {
                borderColor: "#ADA75B",
                color: "#ADA75B"
            }
        }, {
            name: "嘉兴天主教堂",
            itemStyle: {
                borderColor: "#00098B",
                color: "#00098B"
            }
        }, {
            name: "嘉兴西水驿碑",
            itemStyle: {
                borderColor: "#460950",
                color: "#460950"
            }
        }, {
            name: "新市镇历史街区",
            itemStyle: {
                borderColor: "#A8EA66",
                color: "#A8EA66"
            }
        }, {
            name: "崇德城旧址及横街",
            itemStyle: {
                borderColor: "#608142",
                color: "#608142"
            }
        }, {
            name: "长安镇历史街区",
            itemStyle: {
                borderColor: "#4B1AB2",
                color: "#4B1AB2"
            }
        }, {
            name: "隆兴桥",
            itemStyle: {
                borderColor: "#2EE30B",
                color: "#2EE30B"
            }
        }, {
            name: "桂芳桥",
            itemStyle: {
                borderColor: "#F43496",
                color: "#F43496"
            }
        }, {
            name: "欢喜永宁桥",
            itemStyle: {
                borderColor: "#8C4A28",
                color: "#8C4A28"
            }
        }, {
            name: "东新桥",
            itemStyle: {
                borderColor: "#8B8E16",
                color: "#8B8E16"
            }
        }, {
            name: "坝子桥",
            itemStyle: {
                borderColor: "#327003",
                color: "#327003"
            }
        }, {
            name: "广济桥（杭州）",
            itemStyle: {
                borderColor: "#425881",
                color: "#425881"
            }
        }, {
            name: "拱宸桥（杭州）",
            itemStyle: {
                borderColor: "#EB85DB",
                color: "#EB85DB"
            }
        }, {
            name: "德胜坝",
            itemStyle: {
                borderColor: "#F2678B",
                color: "#F2678B"
            }
        }, {
            name: "杭州龙山闸旧址",
            itemStyle: {
                borderColor: "#D11EAB",
                color: "#D11EAB"
            }
        }, {
            name: "水利通判厅遗址",
            itemStyle: {
                borderColor: "#524409",
                color: "#524409"
            }
        }, {
            name: "乾隆御碑洋关旧址",
            itemStyle: {
                borderColor: "#92BB86",
                color: "#92BB86"
            }
        }, {
            name: "杭州富义仓",
            itemStyle: {
                borderColor: "#92796D",
                color: "#92796D"
            }
        }, {
            name: "杭州凤山水城门遗址",
            itemStyle: {
                borderColor: "#57CD20",
                color: "#57CD20"
            }
        }, {
            name: "杭州仓前粮仓",
            itemStyle: {
                borderColor: "#8D12BD",
                color: "#8D12BD"
            }
        }, {
            name: "通益公纱厂旧址",
            itemStyle: {
                borderColor: "#1E9C3B",
                color: "#1E9C3B"
            }
        }, {
            name: "杭州拱宸桥西历史街区",
            itemStyle: {
                borderColor: "#87EAE4",
                color: "#87EAE4"
            }
        }, {
            name: "闸口白塔",
            itemStyle: {
                borderColor: "#F349D9",
                color: "#F349D9"
            }
        }, {
            name: "南浔丝业会馆",
            itemStyle: {
                borderColor: "#E96F8E",
                color: "#E96F8E"
            }
        }, {
            name: "南浔镇历史街区",
            itemStyle: {
                borderColor: "#3CB94E",
                color: "#3CB94E"
            }
        }, {
            name: "浙东运河主线",
            itemStyle: {
                borderColor: "#68C7E3",
                color: "#68C7E3"
            }
        }, {
            name: "浙东运河",
            itemStyle: {
                borderColor: "#49A1C4",
                color: "#49A1C4"
            }
        }, {
            name: "绍兴",
            itemStyle: {
                borderColor: "#BE4096",
                color: "#BE4096"
            }
        }, {
            name: "宁波",
            itemStyle: {
                borderColor: "#BD52E4",
                color: "#BD52E4"
            }
        }, {
            name: "西兴永兴闸",
            itemStyle: {
                borderColor: "#92D546",
                color: "#92D546"
            }
        }, {
            name: "西兴过塘行码头",
            itemStyle: {
                borderColor: "#4DB22A",
                color: "#4DB22A"
            }
        }, {
            name: "浙东运河纤道杭州萧山段",
            itemStyle: {
                borderColor: "#8AB7EC",
                color: "#8AB7EC"
            }
        }, {
            name: "西兴过塘行",
            itemStyle: {
                borderColor: "#97D9B0",
                color: "#97D9B0"
            }
        }, {
            name: "绍兴鉴湖遗址",
            itemStyle: {
                borderColor: "#CB9F95",
                color: "#CB9F95"
            }
        }, {
            name: "浙东运河纤道绍兴渔后桥段",
            itemStyle: {
                borderColor: "#96D190",
                color: "#96D190"
            }
        }, {
            name: "古纤道（绍兴）",
            itemStyle: {
                borderColor: "#FDF305",
                color: "#FDF305"
            }
        }, {
            name: "八字桥（绍兴）",
            itemStyle: {
                borderColor: "#7F4024",
                color: "#7F4024"
            }
        }, {
            name: "浙东运河纤道绍兴皋埠段",
            itemStyle: {
                borderColor: "#B7100B",
                color: "#B7100B"
            }
        }, {
            name: "浙东运河纤道绍兴上虞段",
            itemStyle: {
                borderColor: "#B252D9",
                color: "#B252D9"
            }
        }, {
            name: "三江闸",
            itemStyle: {
                borderColor: "#0D0AC2",
                color: "#0D0AC2"
            }
        }, {
            name: "赵家升船机",
            itemStyle: {
                borderColor: "#E5B5DD",
                color: "#E5B5DD"
            }
        }, {
            name: "曹娥老坝底堰坝",
            itemStyle: {
                borderColor: "#C3872F",
                color: "#C3872F"
            }
        }, {
            name: "梁湖堰坝遗址",
            itemStyle: {
                borderColor: "#2CFC59",
                color: "#2CFC59"
            }
        }, {
            name: "绍兴驿亭坝",
            itemStyle: {
                borderColor: "#816BD7",
                color: "#816BD7"
            }
        }, {
            name: "绍兴五夫长坝及升船机",
            itemStyle: {
                borderColor: "#EE2B85",
                color: "#EE2B85"
            }
        }, {
            name: "绍兴西陡门闸坝遗址",
            itemStyle: {
                borderColor: "#59A73A",
                color: "#59A73A"
            }
        }, {
            name: "绍兴八字桥历史街区",
            itemStyle: {
                borderColor: "#062E75",
                color: "#062E75"
            }
        }, {
            name: "五夫老街",
            itemStyle: {
                borderColor: "#9406DB",
                color: "#9406DB"
            }
        }, {
            name: "宁波通济桥",
            itemStyle: {
                borderColor: "#09894E",
                color: "#09894E"
            }
        }, {
            name: "宁波水则碑",
            itemStyle: {
                borderColor: "#3C20F2",
                color: "#3C20F2"
            }
        }, {
            name: "永丰库遗址",
            itemStyle: {
                borderColor: "#5F9D8A",
                color: "#5F9D8A"
            }
        }, {
            name: "宁波庆安会馆及安澜会馆",
            itemStyle: {
                borderColor: "#2A0664",
                color: "#2A0664"
            }
        }, {
            name: "慈城镇历史街区",
            itemStyle: {
                borderColor: "#648F47",
                color: "#648F47"
            }
        }, {
            name: "宁波月湖历史街区",
            itemStyle: {
                borderColor: "#DE8F37",
                color: "#DE8F37"
            }
        }, {
            name: "庆安会馆天后宫碑记",
            itemStyle: {
                borderColor: "#96620A",
                color: "#96620A"
            }
        }, {
            name: "卫河段主线（河南焦作小丹河—现卫河—现卫运河）",
            itemStyle: {
                borderColor: "#56654B",
                color: "#56654B"
            }
        }, {
            name: "卫河（永济渠）",
            itemStyle: {
                borderColor: "#880719",
                color: "#880719"
            }
        }, {
            name: "焦作",
            itemStyle: {
                borderColor: "#7388EB",
                color: "#7388EB"
            }
        }, {
            name: "新乡",
            itemStyle: {
                borderColor: "#9ACC4C",
                color: "#9ACC4C"
            }
        }, {
            name: "鹤壁",
            itemStyle: {
                borderColor: "#BB63A7",
                color: "#BB63A7"
            }
        }, {
            name: "安阳",
            itemStyle: {
                borderColor: "#8D2738",
                color: "#8D2738"
            }
        }, {
            name: "濮阳",
            itemStyle: {
                borderColor: "#257A8F",
                color: "#257A8F"
            }
        }, {
            name: "邯郸",
            itemStyle: {
                borderColor: "#3FDABC",
                color: "#3FDABC"
            }
        }, {
            name: "百泉河",
            itemStyle: {
                borderColor: "#26FCEF",
                color: "#26FCEF"
            }
        }, {
            name: "永济渠遗址",
            itemStyle: {
                borderColor: "#3D2394",
                color: "#3D2394"
            }
        }, {
            name: "百泉",
            itemStyle: {
                borderColor: "#C7A03D",
                color: "#C7A03D"
            }
        }, {
            name: "卫源庙",
            itemStyle: {
                borderColor: "#9E266C",
                color: "#9E266C"
            }
        }, {
            name: "枋城堰遗址",
            itemStyle: {
                borderColor: "#482F48",
                color: "#482F48"
            }
        }, {
            name: "云溪桥",
            itemStyle: {
                borderColor: "#50D48A",
                color: "#50D48A"
            }
        }, {
            name: "浚县古城墙",
            itemStyle: {
                borderColor: "#29962C",
                color: "#29962C"
            }
        }, {
            name: "大伾山浮丘山文化景观",
            itemStyle: {
                borderColor: "#777419",
                color: "#777419"
            }
        }, {
            name: "道口镇码头",
            itemStyle: {
                borderColor: "#88FAD9",
                color: "#88FAD9"
            }
        }, {
            name: "道口古城墙",
            itemStyle: {
                borderColor: "#CE7210",
                color: "#CE7210"
            }
        }, {
            name: "大名府故城",
            itemStyle: {
                borderColor: "#E05D46",
                color: "#E05D46"
            }
        }, {
            name: "洛河隋唐洛阳城段",
            itemStyle: {
                borderColor: "#EB3D0E",
                color: "#EB3D0E"
            }
        }, {
            name: "通济渠（汴河）",
            itemStyle: {
                borderColor: "#A5644E",
                color: "#A5644E"
            }
        }, {
            name: "洛阳",
            itemStyle: {
                borderColor: "#ACED71",
                color: "#ACED71"
            }
        }, {
            name: "洛河洛口段",
            itemStyle: {
                borderColor: "#EDDE7E",
                color: "#EDDE7E"
            }
        }, {
            name: "郑州",
            itemStyle: {
                borderColor: "#70E5E4",
                color: "#70E5E4"
            }
        }, {
            name: "通济渠荥阳故城",
            itemStyle: {
                borderColor: "#A6BBD2",
                color: "#A6BBD2"
            }
        }, {
            name: "汴河遗址北宋东京城段",
            itemStyle: {
                borderColor: "#C0F285",
                color: "#C0F285"
            }
        }, {
            name: "开封",
            itemStyle: {
                borderColor: "#4D3FA1",
                color: "#4D3FA1"
            }
        }, {
            name: "汴河遗址商丘南关码头遗址段",
            itemStyle: {
                borderColor: "#56C593",
                color: "#56C593"
            }
        }, {
            name: "商丘",
            itemStyle: {
                borderColor: "#B26EA5",
                color: "#B26EA5"
            }
        }, {
            name: "汴河济阳镇段",
            itemStyle: {
                borderColor: "#C62048",
                color: "#C62048"
            }
        }, {
            name: "汴河遗址百善老街及柳孜码头段",
            itemStyle: {
                borderColor: "#083394",
                color: "#083394"
            }
        }, {
            name: "淮北",
            itemStyle: {
                borderColor: "#678970",
                color: "#678970"
            }
        }, {
            name: "汴河遗址宿州段",
            itemStyle: {
                borderColor: "#8E7DAF",
                color: "#8E7DAF"
            }
        }, {
            name: "宿州",
            itemStyle: {
                borderColor: "#B55FFE",
                color: "#B55FFE"
            }
        }, {
            name: "汴河安徽泗县-江苏泗洪段",
            itemStyle: {
                borderColor: "#1009EE",
                color: "#1009EE"
            }
        }, {
            name: "淮河口段",
            itemStyle: {
                borderColor: "#5E70C1",
                color: "#5E70C1"
            }
        }, {
            name: "天津桥遗址",
            itemStyle: {
                borderColor: "#F8930C",
                color: "#F8930C"
            }
        }, {
            name: "含嘉仓遗址",
            itemStyle: {
                borderColor: "#43FFE5",
                color: "#43FFE5"
            }
        }, {
            name: "回洛仓遗址",
            itemStyle: {
                borderColor: "#C8C680",
                color: "#C8C680"
            }
        }, {
            name: "洛口仓遗址",
            itemStyle: {
                borderColor: "#2585CF",
                color: "#2585CF"
            }
        }, {
            name: "康百万庄园",
            itemStyle: {
                borderColor: "#2AAACF",
                color: "#2AAACF"
            }
        }, {
            name: "巩义窑址",
            itemStyle: {
                borderColor: "#C0AF8C",
                color: "#C0AF8C"
            }
        }, {
            name: "荥阳故城",
            itemStyle: {
                borderColor: "#5D2CCE",
                color: "#5D2CCE"
            }
        }, {
            name: "西水门遗址",
            itemStyle: {
                borderColor: "#92ADAA",
                color: "#92ADAA"
            }
        }, {
            name: "西角门子遗址",
            itemStyle: {
                borderColor: "#72AED0",
                color: "#72AED0"
            }
        }, {
            name: "州桥遗址",
            itemStyle: {
                borderColor: "#CB0B2F",
                color: "#CB0B2F"
            }
        }, {
            name: "东角门子遗址",
            itemStyle: {
                borderColor: "#102087",
                color: "#102087"
            }
        }, {
            name: "东水门遗址",
            itemStyle: {
                borderColor: "#7FEFF4",
                color: "#7FEFF4"
            }
        }, {
            name: "繁塔",
            itemStyle: {
                borderColor: "#72D04B",
                color: "#72D04B"
            }
        }, {
            name: "商丘南关汴河码头遗址",
            itemStyle: {
                borderColor: "#73ACF1",
                color: "#73ACF1"
            }
        }, {
            name: "柳孜运河码头遗址",
            itemStyle: {
                borderColor: "#A699C3",
                color: "#A699C3"
            }
        }, {
            name: "百善镇百善老街河道遗址断面",
            itemStyle: {
                borderColor: "#A9BC12",
                color: "#A9BC12"
            }
        }, {
            name: "柳孜镇遗址",
            itemStyle: {
                borderColor: "#1549C9",
                color: "#1549C9"
            }
        }, {
            name: "花石纲遗址",
            itemStyle: {
                borderColor: "#B725A6",
                color: "#B725A6"
            }
        }, {
            name: "龟山御码头遗址",
            itemStyle: {
                borderColor: "#A3A59F",
                color: "#A3A59F"
            }
        }, {
            name: "盱眙泗州城遗址",
            itemStyle: {
                borderColor: "#715D80",
                color: "#715D80"
            }
        }, {
            name: "第一山题刻",
            itemStyle: {
                borderColor: "#F1A82E",
                color: "#F1A82E"
            }
        }]
    },
    hel6: function(e, l) {},
    izfE: function(e, l) {},
    m6gw: function(e, l) {
        e.exports = {
            name: "苏州",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "江南运河",
                    value: "江南运河的历史可追溯至春秋战国时期（前770 ～前221），是由沟通自然河道的若干运河组成，如沟通苏州和无锡之间的泰伯港、吴越两国间沟通长江和钱塘江的百尺渎、无锡一带通太湖的语昭渎、自苏州向西北经常州北境通长江的吴古故水道等。隋代对江南运河进行全线整治，始称江南河，南宋时称浙西运河，今称江南运河。江南运河，又称江南河、浙西运河，是京杭运河在长江以南的一段，北通长江，南达钱塘江，连通长江、太湖、钱塘江三大水系，至今仍全线通航。江南运河位于长江三角洲地区，以太湖水系为中心，北起长江南岸的江苏镇江京口，东南经常州、无锡，绕太湖东岸达苏州、吴江、平望，然后进入浙江嘉兴，折而西南，又经崇德、长安、临平，最终到达杭州，全长340 千米。江南运河是富庶的江南地区与北方相通的水运干道，航运条件良好，也是京杭运河运输最繁忙的航道。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "白居易",
                    value: "白居易（772～846），字乐天，唐代太原（今属山西）人。唐贞元十四年（798），参加礼部考试，高中甲科，官授秘书省校书郎。元和年间，先后担任周至县尉、集贤殿校理、翰林学士、左拾遗，后出任京兆府户曹参军、忠州刺史、司门员外郎、主客郎中、知制诰、中书舍人、杭州刺史、苏州刺史等职。唐大和二年（828），调任刑部侍郎。武宗会昌间，以刑部尚书辞官归家。唐会昌六年（846）去世。"
                }, {
                    name: "冯桂芬",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "冯桂芬（1809～1874），字林一，又字景亭（又作景庭），自号邓尉山人。江苏吴县（今苏州）人。因出生时，正值桂花开放，故得名桂芬。清道光十二年（1832），林则徐任江苏巡抚时，识拔了素昧平生的冯桂芬，称他为“百年以来仅见”的人才，并招入抚署读书，收为学生。道光二十年进士及第，授翰林院编修。曾任顺天乡试同考官、广西乡试正考官、金陵“惜阴书院”山长。咸丰年间充任李鸿章幕僚。其后完成了政论代表作《校邠庐抗议》四十篇，提出“以中国之伦常名教为原本，辅以诸国富强之术”。"
                }, {
                    name: "李鸿章",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "李鸿章（1823～1901），原名章铜，字少荃，一字渐甫，一作少泉，自号仪叟、仪斋。安徽合肥人。清道光二十七年（1847）进士，授编修。咸丰初，回籍办团练。光绪间官至东宫三师、文华殿大学士、北洋通商大臣、直隶总督，封一等肃毅伯，谥文忠。李鸿章是淮军、北洋水师的创始人和统帅、洋务运动的领袖、晚清重臣。著有《李文忠公全集》。"
                }, {
                    name: "隋文帝",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "隋文帝杨坚（541～604），弘农郡华阴（今陕西华阴）人，隋朝开国皇帝。"
                }, {
                    name: "伍子胥",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "伍子胥（前559～前484），名员，字子胥，春秋时期楚国人，后入吴。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "苏州运河故道",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "苏州运河故道大运河苏州段由作为运河主航道的山塘河、上塘河、胥江，护城河遗迹盘门、胥门等水门，包括城内河流水系等组成，全长约82千米。苏州运河故道大运河苏州段由作为运河主航道的山塘河、上塘河、胥江，护城河遗迹盘门、胥门等水门，包括城内河流水系等组成，全长约82千米。自隋代起就成为中国大运河的重要河道，到唐代中叶已基本定型。之后的运河苏州段虽历经多次修筑、疏浚，但仍保持了原来大致的走向，今天仍在水路交通运河、文化旅游观光方面起着重要作用。若从南向北沿运河河道而上，则先后经过吴江古纤道、宝带桥而至苏州古城护城河，从古城西面绕行北上，则经过盘门、阊门，又有胥江、上塘河、山塘河等若干分支，最终在古城西北汇聚继续流向西北。"
                }, {
                    name: "惠荫园",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "惠荫园位于苏州市姑苏区平江街道菉葭巷社区南显子巷13号。明嘉靖年间为归湛初宅园，后属胡汝淳。清康熙四十六年（1707）毁于火，乾隆十六年（1751）修复。太平天国时为听王府，同治时李鸿章于此设安徽会馆，现存“安徽会馆”砖细门楼。第一进门厅面阔三间。第二进、第三进是原昭忠祠。右面进月洞门是原程公祠部分，南面第一进为原门厅，向北为第二进，墙内东壁间嵌有碑刻一方。第三进为原祠堂办公室及东侧包公殿，现已改建为教学楼。第四进保存着原享堂大殿，内有粗大的楠木庭柱，上面雕梁画栋，栋梁上有彩绘人物、花卉图案。"
                }, {
                    name: "轩辕宫",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "轩辕宫位于苏州市姑苏区观前街道旧学前社区祥符寺36号、38号，又名仙机道院，曾为纱缎业公所。始建于北宋元丰初，清同治元年（1862）重修。坐北朝南，两路四进，地基逐级升高。东路临街门楼额“为章于天”，为冯桂芬所题。第三进为正殿，硬山顶，面阔三间11.5米，进深13.5米，高约8.4米。扁作梁，前有翻轩和桁间牌科，脊檩饰山雾云和彩绘。存《重建轩辕宫记》碑一块。"
                }, {
                    name: "织造局旧址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "织造局旧址位于苏州市姑苏区桃坞街道金门社区五爱巷10号。清代苏州织造局成立于顺治三年（1646）。现存一路三进。大厅面阔三间，进深八界。楼厅面阔五间加二厢，进深七界。扁作雕花承重有翻轩。一座砖雕门楼“燕翼相承”为同治十二年（1873）洪钧题，另一座为“癸酉仲冬吴宝恕”题，已残。织造署旧址位于苏州市姑苏区双塔街道百步街社区带城桥下塘18号十中校园内。清顺治三年（1646）设苏州织染局于此，康熙十三年（1674）改为织造署，同治十年（1871）重建。该建筑现存头门、仪门二进及西侧多祉轩。头门硬山造，面阔三间，进深四界，将军门式，于脊柱间安断砌门三座，现门扉六扇及门簪、下槛、砷石等尚存。东西次间尚存顺治《织造经制记》及顺治、乾隆、同治年间修建碑记。仪门面阔五间，进深四界，穿斗式梁架，桁间牌科斗三升。多祉轩为歇山顶方亭。内有“瑞云峰”，为江南太湖石奇峰，北宋花石纲遗物。采自太湖洞庭西山，初名“小谢姑”。明万历间为徐泰时所得，置于东园(留园前身)，始称“瑞云峰”。现位于十中校园水池中央，池周配置峰石洞壑。峰石高5.12米，通高6.23米，宽3.25米，厚1.3米，涡洞相套，褶皱相叠，剔透玲珑，集“皱、漏、瘦、透”于一身，有“妍巧甲于江南”之誉。"
                }, {
                    name: "白公堤石幢",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "白公堤石幢位于苏州市姑苏区虎丘街道虎丘社区山塘街775号五人之墓（颜佩韦等）内，俗称“方碑”。白公堤即山塘街，为唐代诗人白居易出任苏州刺史时所筑。明万历三十八年（1610）重修堤塘，事成立此幢纪念。石幢为方柱体，通高3.05米，面宽0.99米。正面镌王稚登《重修白公堤记》，另三面刻寒山拾得、大势至菩萨、五百罗汉和修堤捐助人名单。幢顶中心圆雕弥勒佛坐像，四边各浮雕坐佛四尊。幢座雕作须弥山。"
                }, {
                    name: "太平坊清真寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "太平坊清真寺位于苏州市姑苏区金阊街道三乐湾社区石路太平坊29号。1924年由阊门外穆斯林发起筹建，1926年建成八间半清真义学。1949年中华人民共和国成立初期，虽房屋失修，仍举行宗教仪式。1958年并入天库前清真经学。1959年起先后出租给民办小学和校办工厂。1982年收回翻建为清真寺。1958年政府拨款1万余元增建一层新楼。1995年政府又拨款50万元重建。天库前清真寺12方碑刻集中收藏于此。"
                }, {
                    name: "虎丘塔",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "虎丘塔又名云岩寺塔，位于苏州城西北郊山塘街西端。相传吴王阖闾就葬在此处。该塔始建于隋文帝仁寿元年（601）。最初为木塔，后来被毁。现存的虎丘塔建于后周显德六年（959）至宋建隆二年（961）。塔为七层八面，高47.7米，是砖结构为主的仿木结构楼阁式塔。底层每边长5.65米。塔体由外壁、回廊、内壁、塔心室组成。外壁八面辟壶门，内壁四面辟壶门。各层回廊顶以叠涩法砖构楼面将内外壁连成整体，形成双套筒结构。塔内壁面隐起柱、枋、斗拱、藻井、堆塑折枝牡丹等彩饰。第五层的湖石勾栏壁塑尤为罕见。由于塔位于南高北低的斜坡地基之上，加上塔自身的重力压迫和其他沉降、风化等作用，因此塔顶向北偏东偏离了2米。该塔也成为大运河苏州段著名的斜塔和标志性建筑。1961年被列为首批全国重点文物保护单位。"
                }, {
                    name: "桥梁",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    children: [{
                        name: "宝带桥",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "桥拱券采用纵联分节并列砌置法，中孔东西侧桥额阴刻“宝带桥，同治五年孟冬之月，水利工程总局重建”字样。桥南端有一对青石狮子，桥中西侧有一座八角青石塔，北端置青石狮一只及八角青石塔、四角方亭各一只。桥全长347.8米，桥面最宽处5.2米，桥主孔矢高3.5米，净跨7.1米；次孔矢高3米，净跨5.8米；缀孔矢高1.85米，净跨3.8米。其中三孔联拱极高，为方便通行大船，两旁各拱随路面下降，形成弓形弧线。2001年被列为全国重点文物保护单位。"
                    }, {
                        name: "盘门水关桥",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "盘门水关桥位于苏州市姑苏区南门街道瑞光社区盘门外内城河入外城河口处。现桥建于清同治十一年（1872）。桥东西向，跨内城河，单跨花岗石梁桥，长20.35米，中宽2.8米，跨6米，高3.1米。桥面由5块条石组成，侧梁铭文阴刻楷书桥名“水关桥”，两侧刻小字楷书“同治十一年嘉正月”“水利工程总局重建”，花岗石桥栏，金刚墙为花岗石间青石，两坡设条石踏步各15级。"
                    }, {
                        name: "吴门桥",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "吴门桥位于苏州市姑苏区南门街道瑞光社区盘门外。桥跨古运河（护城河），为陆路出入盘门的必经通道。宋《平江图》所载为三桥相接，下设三洞。清乾隆《盛世滋生图》所载为三孔石拱桥。今桥为同治十一年（1872）苏属水利工程总局重建。南北走向，单孔石拱桥，花岗石砌筑，杂有少量武康石，桥长66.3米，中宽4.8米，净跨16米，矢高9.85米，拱券石10排，纵联分节并列砌。南北落坡各砌条石踏步。吴门桥是苏州留存的最高的单孔石拱古桥。"
                    }, {
                        name: "灭渡桥",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "灭渡桥位于苏州市姑苏区葑门街道觅渡社区葑门外古城东南隅，跨京杭大运河。元大德二年（1298）始建，明清重修，1985年又修。桥为单孔石拱桥，东西向，长70.75米，中宽3.78米，净跨19.3米，矢高8.5米，两坡设踏步共90级。桥身武康石、青石、花岗石混砌，显示多次重修的痕迹。拱券纵联分节并列砌置，青石长系石端部刻有兽面纹浮雕，应为始建时物。拱顶与面石间不加填层，并尽量增加桥身坡长，使大桥平缓易行，为江南古桥梁中的成功作品。"
                    }, {
                        name: "义役仓桥",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "义役仓桥位于苏州市姑苏区双塔街道沧浪亭社区张思良巷、长洲路。又名仓桥、乐输仓桥、绿水仓桥，始建无考，明代已见记载。清同治六年（1867）重修，1984年又修。旧有义役仓，明改为长洲县治，故名义役仓桥。桥东西向，跨城内第三横河，东接长洲路，西连张思良巷。单孔花岗石拱桥，长13.9米，中宽2.85米，净跨4.7米，矢高2.4米。拱券分节并列砌置，桥栏阳刻带圈楷书“仓桥”，两侧阴刻楷书小字“长洲县正堂蒯重建”“同治陆年柒月吉日”。"
                    }]
                }, {
                    name: "城门",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    children: [{
                        name: "盘门",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "盘门位于苏州古城西南隅，西、南傍古运河，是大运河苏州段的重要节点。由水陆城门、瓮城及两侧城墙组成，总占地面积约1.28公顷。水城门由内外两重，纵深24.5米，外门显然早于内门。陆门也有内外两重，内周长约177米，城墙高8.1米。外门在瓮城东北方，门洞宽3米，深7米。内门偏于瓮城西南，门洞宽4米，深15米。盘门是运河沿线惟一保存较完整的古水陆城门。盘门始建于春秋时期吴国阖闾元年（前514），最初名为“蟠门”，后来因水萦环绕而改名“盘门”，现存的盘门乃元至正十一年（1351）重建。盘门内外两道城垣构成方形翁城。翁城为至正十六年张士诚增修。今天的城楼是1986年重建的，巍然耸立，上有匾额“中吴锁钥”。陆城门毗邻的是两道水城门，全用花岗岩石修筑，城门洞高大，可容两船并列而过，各门都有巨型闸门以控制水流。盘门也是目前全国惟一原址保留完好的水陆双城门，2006年被列为全国重点文物保护单位。"
                    }, {
                        name: "胥门",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "胥门位于苏州市姑苏区胥江街道万年社区古城西(胥门路南)。为春秋吴国都城八门之一，现存为元至正十一年（1351）重建，明清重修。城门东西向，由三道砖砌拱券组成。拱门高4.65米，宽3.3米，纵深11.45米。东向(城内)尚存横额，“胥门”二字已毁，砖雕边花甚古朴。城门左右尚残存古城垣百余米，砖石混砌，为明清维修遗迹。原有至正十六年张士诚增建的瓮城，已于民国时期拆去。"
                    }, {
                        name: "阖门",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "阊门位于苏州市姑苏区桃坞街道阊门社区西中市西首。初为春秋吴王阖闾令伍子胥建造都城时所辟八门之一。门作东西向，水陆并列，陆门城台上原有重檐歇山顶两层三开间楼阁。外有元至正十六年（1356）张士诚加筑的城，称瓮城或月城。阊门瓮城辟有三门。阊门现存水门金刚墙，瓮城墙基等遗迹，水门东西向，纵深12米。南北两岸以青石顺砌，高出水面约20米。瓮城墙基以青石与花岗石间杂叠成，自钓桥东堍下南北引桥台阶即可见。陆门南尚存砖石城墙一段。"
                    }]
                }, {
                    name: "会馆",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    children: [{
                        name: "安徽会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "安徽会馆位于苏州市姑苏区虎丘街道西园社区来凤桥桥堍，又名东廊堂。原存朝南两路，建筑面积774平方米。东路三进为头门、仪门、大殿，均为五开间。大殿面阔18米，进深六檩11米。扁作梁架。前鹤颈轩，后船棚轩。西路两进有1915年吴县县政府布告石刻和银杏、罗汉松等老树。2002年西环路拓宽时，将该组建筑向东平移约100米。"
                    }, {
                        name: "武安会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "武安会馆位于苏州市姑苏区金阊街道阊门社区舒巷38号。建于清光绪十二年（1886），为河南商人在苏州所建的丝业会馆。这些商人穿梭于苏州和开封之间，专门从事丝绸生意，在苏州的绸缎业中具有相当的地位和实力。会馆坐北朝南，中轴线上依次为照壁、头门、戏台、正殿。头门东连一厅，正殿西接一楼。头门与照壁之间有东西高墙相连，自成庭院。头门南向，前设石狮一对。现仍存会馆的两门外侧门垛下各嵌石刻门墩一个，高约0.8米，上刻“河南武安会馆”六字。右门楼额嵌石刻方石，上刻“夕阳”两字。左门已被砖石封闭，其门楼石刻已损毁，影壁后正中有一个石制香炉底座，与头门相对。壁间嵌有碑刻五方，记述会馆建立情况。其中《武安会馆揖资碑》详细列出揖资商号及银两数目。现存苏州碑刻博物馆的《武安会馆碑记》记言：“我豫武安业锦绮纨觳者，置邸大梁，贾贸滞鬻于苏，盖有年矣。顾未有馆舍，光绪十二年春阎君步锦等谋于众。”随后集资营建，至光绪十五年落成。戏台与头门相连，歇山顶。北向正对大殿，殿为硬山筒瓦顶，梁架扁作，雕花贴金，面阔三间8.85米，进深8.6米，前有轩廊，并以两廊与戏台、头门相连，殿柱承以雕花石鼓墩。"
                    }, {
                        name: "全晋会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "全晋会馆位于苏州市平江路中张家巷14号，又称山西会馆。原在阊门外山塘街的半塘，是19世纪大运河带来的南北经济文化交流的产物，由山西商人始建于清乾隆三十年（1765），后来在咸丰十年（1860）毁于战火，光绪五年（1879）重建于今址。全晋会馆老馆已不存，只留下《全晋会馆众商捐厘碑》和《全晋会馆应垫捐输碑记》两块碑，现藏于苏州碑刻博物馆的经济碑廊。新的全晋会馆占地约6000平方米，坐北朝南，分为东、中、西三路。中路为正路，从前至后依次为门厅、戏台、大殿等。门厅为单檐歇山顶，面阔三间，进深五界。脊柱间各设将军门一座。明间两扇黑漆门扉绘有工笔重彩门神，并置抱鼓石一对。以脊柱为界，前为海棠轩，后为鹤胫轩。梁枋饰以戏文浮雕。门厅墙下承青石须弥座。中路存戏台，为整个会馆建筑群中的经典，既是当年皇帝诞辰、国家大庆之日举办庆典活动的场所，也是苏州现存古戏台中最为精美的一座。东路有鸳鸯厅、楠木厅等。其中中路大殿原为关公殿，晋商在此供奉关公。1976年大殿被烧毁，后重修。大殿有正对戏台的露台，正是观戏的场地。2006年被列为全国重点文物保护单位，现挂牌为中国昆曲博物馆。"
                    }, {
                        name: "山东会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "山东会馆门墙位于苏州市姑苏区虎丘街道桐星社区山塘街552号。山东会馆为清顺治年间胶州、青州、登州等地商人创建，乾隆时重修。咸丰十年（1860）战火后，未能修复。现仅存大门两侧门墙，高大巍峨，通体水磨细砖贴面。瓦檐下饰以砖斗拱，间以花卉纹垫拱板，下额枋为山水动物图案，雕镂极精。其东北尚存一五开间偏厅。该门墙檐口高5.22米，宽20.75米，花岗石基座高1.02米，墙宽0.73米。"
                    }, {
                        name: "汀州会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "汀洲会馆位于苏州市姑苏区虎丘街道山塘社区山塘街192号。清康熙五十七年（1718）福建上杭纸业游苏会商集资创建，光绪年间重建。原位于上塘街，2003年移建至山塘街192号。坐北朝南。头门及戏台已废，现存仪门、大殿及两廊。大殿面阔五间17米，进深七檩13米。扁作梁架，前船棚轩，外檐列桁间牌科，额枋刻双龙戏珠。"
                    }, {
                        name: "岭南会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "岭南会馆头门位于苏州市姑苏区虎丘街道山塘社区山塘街136号。为明万历年间广州商人创建，清代重建，是苏州最早的会馆之一。原建筑仅存三间头门，五山屏风墙硬山顶，八字墙瓦檐下饰有砖雕抛枋，面阔7.3米。"
                    }, {
                        name: "潮州会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "现存头门北向，外墙高约10米，面阔15米。两侧呈八字形，通体以磨细方砖斜角贴面。辟石库门三，砖额题“潮州会馆”“河清”“海晏”。入门为过道。上层即为朝南戏楼。戏台向前突出，纵深10米，歇山顶，内部八角形藻井、垂莲柱、额枋镂雕精致。台下为通道。"
                    }, {
                        name: "嘉应会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "嘉应会馆位于苏州市姑苏区沧浪街道万年社区枣市街9号。南向临枣市街、胥江，占地约960平方米。存头门、戏台、大殿、楼厅一路建筑。头门面阔五间，石库门上嵌砖刻横额“嘉应会馆”。上层为戏台后台，向北伸出为前台。戏台卷棚歇山顶，鱼龙脊，四周鹤胫一支香轩，重昂丁字枫拱。大殿坐北朝南，与戏台隔庭院相望。面阔三间，南有廊，前船篷轩，圆作四界梁，后双步。殿北为楼屋三间，楼前有砖雕门楼。另尚有会馆所附办事和生活用房数间。会馆建筑布局基本完整。"
                    }, {
                        name: "冈州会馆",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "冈州会馆墙门位于苏州市姑苏区虎丘街道山塘社区山塘街92号。清康熙十七年（1678）义宁（今广西桂林）商人创建。嘉庆年间重修，俗呼“扇子会馆”，因贩芭蕉扇而得名。现正殿已毁，其他建筑已改，仅存门墙，总长17.5米，进深4.9米。砖刻门额有“居仁”“圣母殿”“攸叙居”。建屋用砖大如城砖，且印有“冈州馆”三字，可知窑上为其定制。"
                    }]
                }, {
                    name: "历史文化街区",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    children: [{
                        name: "山塘街历史文化街区",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "山塘街历史文化街区山塘河位于苏州城西北，是大运河自西北进入苏州的主干道，也是大运河苏州段的主航道之一。与山塘河伴行的山塘街也是明清时期苏州著名经济文化中心。唐宝历元年（825），苏州刺史白居易主持开凿山塘河，并沿河驻堤，人称白公堤，全长约7里，东起阊门渡僧桥附近，西至虎丘望山桥，俗称“七里山塘到虎丘”。山塘街与山塘河在阊门与运河相接。自唐代以来一直是商品集散地，明清时期更是繁华一时。徐扬创作的《盛世滋生图》中就描绘了当地的繁华富贵景象。山塘街的商贸市场主要位于城乡结合处和游览胜地，这样既方便农副产品的集散，又利于吸引游客。店铺主要是手工业作坊和饮食店。街区内有泉州会馆、冈州会馆、山东会馆等多个商会会馆，数量之多、涵盖之广极为罕见。山塘街西段还有明末安葬颜佩韦等义士的“五人之墓”遗址。街区共占地约56公顷，2015年被列为第一批中国历史文化街区。"
                    }, {
                        name: "平江历史文化街区",
                        lineStyle: {
                            color: "#C19A62"
                        },
                        itemStyle: {
                            color: "#C19A62"
                        },
                        value: "平江历史文化街区平江路位于苏州城东，古称为“十泉里”。南起干将东路，北越白塔东路与东北街相接，全长约1600米，宽约3米。西侧有平江河与平江路平行，属于纵贯苏州古城南北的第四直河北段。早在南宋《平江图》中就可以看到当时的平江路被作为古城的南北主干水道。河上有众多桥梁，是城内桥梁最为密集的地区之一。北宋时苏州被称为平江府，平江路与平江河因此而得名。平江河通过第四直河与护城河、大运河相连，宽5～6米，长期以来是城内重要的水上交通线。两侧有众多历史悠久的小巷，如中张家巷、卫道观前、钮家巷、大儒巷、潘儒巷等。巷内有众多名人故居和历史文化遗迹，如潘世恩故居（现为苏州状元博物馆）、顾颉刚故居、全晋会馆（现为中国昆曲博物馆）、耦园等。当地基本保留了《平江图》中“水陆并行，河街相邻”的苏州古城传统风貌，且较为完整地保留了众多历史文化遗迹，2015年被列为第一批中国历史文化街区。"
                    }]
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋战国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "吴王夫差元年（495），伍子胥主持修建了胥溪，经苏州境内而入长江，此为现在江南运河的雏形。苏州也因此而兴，成为吴国政治、经济、军事中心和东南著名都会。吴王阖闾元年（514），伍子胥建造了苏州城的前身，即阖闾大城。城内河网密布，河道纵横，水上交通发达。春秋时期，吴王阖闾元年（前514），伍子胥“相土尝水，象天法地，造筑大城”①，这就是今天苏州古城的原型。阖闾大城周边约47里，共8个城门，每个城门均有水门，外有护城河，内有水道，外河与内城河相连便是苏州的运河最早的前身。"
                }]
            }]
        }
    },
    vuOR: function(e, l) {
        e.exports = [{
            name: "宁波",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "浙东运河",
                    value: "浙东运河位于中国大运河最南端，是内河与外海连接的纽带，古代海上丝绸之路的重要起点之一，也是中国出现、形成最早和连续运用时间最长的运河之一。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "贺循",
                    value: "贺循（260～319），字彦先，会稽山阴（今浙江绍兴）人，历两晋，先后任阳羡令、武康令、太子舍人、会稽内史、中书令、太子太傅、左光禄大夫等职，著有《丧服要记》《会稽记》等著作。"
                }, {
                    name: "齐澣",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "齐澣（675～746），字洗心，唐代诗人。历武则天、唐睿宗、唐玄宗三朝，曾任蒲州司法参军、中书舍人、汴州刺史、尚书右丞、吏部侍郎、江南东道采访使、河南道采访使、平阳太守等职，《全唐诗》《全唐文》均存其作品。"
                }, {
                    name: "钱镠",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "钱镠（852～932），字具美，五代十国时期吴越国开国皇帝，在位期间重用人才，鼓励垦殖，修建钱塘江海塘保护民田与百姓生命安全，并修建一系列堰、闸,用以调节水源，进行灌溉与分洪，使吴越国经济繁荣、社会稳定，被百姓誉为“海龙王”。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "大西坝遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "大西坝遗址大西坝古称西渡，又名十字港。位于宁波市海曙区高桥镇以北的大西坝村，地处姚江江畔，是宁波连接浙东运河，通往杭州，远接京杭大运河的航道要津。南宋宝祐元年（1253），沿海制置使吴潜于当地兴建。现存的大西坝是1962年于宋代遗址上复建的，却也残破不堪，只余一座不到10米的卡口。"
                }, {
                    name: "庆安会馆遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "庆安会馆遗址位于宁波市区三江口东岸，始建于清道光三十年（1850），于咸丰三年（1853）建成。既是祭祀妈祖的宫庙，也是同业联络发展的场所，占地约5000平方米，建筑群沿中轴线分布。2001年，庆安会馆被列为第五批全国重点文物保护单位。2008年，宁波加入大运河申遗，庆安会馆作为运河的附属遗存成为世界文化遗产。"
                }, {
                    name: "永丰库遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "永丰库地处宁波市区唐宋子城西北隅，元《至正四明续志》载，其原名“常平仓”，始建于南宋庆元元年（1195），元时，在其旧基之上重筑仓储，名为“永丰库”，明代更名为“宏济库”。永丰库南北长120米，东西宽80米，总面积9600平方米，甬道、明沟、水井、河道排列有序，规模宏大，布局清晰。2006年永丰库遗址被列为第六批全国重点文物保护单位，现已开发为遗址公园。"
                }, {
                    name: "宁波水利航运遗址碑",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "宁波水利航运遗址碑属线性文化遗产，由位于庆安会馆内的清代甬东天后宫碑、天一阁东园游廊壁的元代庆元绍兴海运达鲁花赤千户所记碑、元代移建海道都漕运万户府记碑和郑氏十七房的清代澥浦水运管理碑四块碑组成。甬东天后宫碑保存完整，主要记载了天后宫的兴建始末与大运河（宁波段）作为河海联运、物资集散的重要水运枢纽地位。庆元绍兴海运达鲁花赤千户所记碑和移建海道都漕运万户府碑记述了古代宁波在漕粮海运中的特殊地位和重要作用。澥浦水运管理碑则详细记载了清代内河航运的诸项管理章程。宁波水利航运遗址碑是对历史时期浙东运河（宁波段）的地位及其所发挥功能的有力佐证。"
                }, {
                    name: "澥浦水城门",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "水城门又名月洞门，始建于元明之际，位于宁波市镇海区澥浦镇。现存有清光绪七年（1881）的“沙碗塘”碑，是一座拱形的石砌建筑，保存完好，被列为镇海区文物保护单位。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "春秋越时，临近甬江水系的宁波平原，逐渐形成了句章、鄞、等城邑。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "至秦之世，并百越，罢侯置守，分天下为三十六郡。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "两汉而下，越皆为会稽郡，魏晋以来没有变更。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐代，明州的贡品就是取道运河，以达长安。唐代后期，明州成为内河航运和远洋贸易的枢纽。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "浙东运河真正发挥其水上运输效益当在两宋时期。北宋淳化三年（992），原设立于杭州的两浙路市舶司迁至明州，设于明州子城东南隅。其时，诸邦皆取道定海（今镇海）、明州，由运河至北宋都城汴梁朝贡。至南宋迁都临安，中原士民扶携南渡，“四方之民云集二浙，百倍常时”。南宋庆元元年（1195），升明州为府，“以所以改元者名之，曰庆元”，故名庆元府。南宋宝祐元年（1253），沿海制置使吴潜修大西坝，阻咸蓄淡，兼通舟楫。终宋一朝，浙东运河作为连接杭州、越州、明州的内河交通线，备受朝廷重视，沿河各州县、市镇定期都要对河道进行全面疏浚，南宋时期更成为朝廷的生命线。宋元鼎革，随着政治中心重新北移，南宋时期处于王畿腹地的浙江地区，虽仍保持着相当的繁荣，但诸多地区的发展开始出现停滞的迹象。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "宋元鼎革，随着政治中心重新北移，南宋时期处于王畿腹地的浙江地区，虽仍保持着相当的繁荣，但诸多地区的发展开始出现停滞的迹象。加之元代以海运为主，辅以少量河运的运输方式，运河沿线的市镇开始衰落。庆元府（明州）却因地处河、海交汇之所，成为元代漕粮北运的重要枢纽。元初即在此设有专门管理漕粮海运的机构，城内还设有仓储。因此，元朝占领浙江后，便在该城设立市舶司。且元代海外贸易繁盛，随着海外贸易的持续发展，庆元港在全国对外贸易中的地位日益上升，庆元市舶司的管辖范围也不断扩大。是以，宁波作为明初造船、军饷北运的中心，虽经元末动荡，仍未见衰落。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明初，朱元璋改庆元路为明州府。洪武初年，明朝循元旧制，仍行海运之法。永乐十三年（1415），明朝正式罢海运，实行内河漕运，在淮安、徐州、临清、通州设置转运仓，实施支运法。出于海防和海禁的需要，明初即实行“片板不得下海”的国策，严禁民间的私人贸易，只允许官方的朝贡贸易。明中期以后，朝廷不再实施严格的海禁政策。取消海禁的一大原因，与明代东南沿海的倭患有关。宁波自唐宋以来就是海外贸易繁盛的城市，而明代的海禁政策，迫使民间走私和海盗活动的不断加剧，倭患也愈演愈烈。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明末清初，浙江地区历经战乱，民人亡散，城镇废弛，社会凋敝。但随着清末轮船和杭甬铁路的出现，浙东运河日渐衰落。"
                }]
            }]
        }, {
            name: "绍兴",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "浙东运河",
                    value: "浙东运河位于中国大运河最南端，是内河与外海连接的纽带，古代海上丝绸之路的重要起点之一，也是中国出现、形成最早和连续运用时间最长的运河之一。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "夫差",
                    value: "夫差（前528～前473），吴国末代君主，姬姓，吴王阖闾之子。在位期间，在军事上重用孙武、伍子胥等名将，接连打败越、楚、齐等强国，与中原诸国会盟黄池，成为一代霸主。夫差好大喜功，连年兴兵，导致国库空虚，人民困苦，最后被越王勾践所灭。"
                }, {
                    name: "贺循",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "贺循（260～319），字彦先，会稽山阴（今浙江绍兴）人，历两晋，先后任阳羡令、武康令、太子舍人、会稽内史、中书令、太子太傅、左光禄大夫等职，著有《丧服要记》《会稽记》等著作。"
                }, {
                    name: "孟简",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "孟简（？～823），字几道，唐代德州平昌（今山东德州）人，后寓居吴中。孟简自幼聪颖，敬宗贞元年间考中进士，再参加博学宏词科考试，榜上有名。贞元九年（793），孟简担任浙东观察使皇甫政的助手，十三年随皇甫政入朝任职，先后担任仓部员外郎、吏部员外郎、司封郎中、谏议大夫等职。后被贬为常州任刺史。长庆三年（823），病逝。"
                }, {
                    name: "康熙帝",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "康熙帝（1654～1722），名爱新觉罗玄烨，是清朝入关后的第二位皇帝。他八岁继位，15岁亲政，在位61年，是我国历代皇帝在位时间最长的一位。他继位以后，智擒鳌拜，平定三藩、驱逐沙俄、收复台湾，为维护国家主权、巩固国家统一做出了重要贡献，其在治理黄、运方面亦取得显著成效。清康熙六十一年（1722）十一月，康熙帝去世。"
                }, {
                    name: "陆游",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "陆游（1125～1210），字务观，号放翁，南宋越州山阴（今浙江绍兴）人。年少成名，以恩荫授仕郎，在参加锁厅试时被推举为第一名。孝宗时，陆游参加科举考试，赐进士出身，历任福州宁德县主簿、敕令所删定官、隆兴府通判等职。乾道中，朝廷命陆游入蜀，相继担任夔州（今重庆奉节）通判、四川宣抚司干办公事、成都府路安抚司参议官，后出蜀任福州、江西提举常平茶盐公事、江西常平提举、军器少监等职。嘉泰二年（1202），召陆游入京，主持编修孝宗、光宗《两朝实录》和高宗、孝宗、光宗《三朝史》，官至宝章阁待制。书成后，陆游定居家乡山阴，直至嘉定二年（1210）冬十二月去世。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "会稽山大禹陵",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "大禹与绍兴渊源颇深。《史记》记载：“禹会诸侯江南，计功而崩，因葬焉，命曰会稽”。历朝历代对禹庙多有祭祀。南宋时期，因为皇室南迁，原本相对于中原地区边陲的越州，一跃而变为王朝统治的核心地区，成了南宋朝廷的依靠。其“南镇”的地位由此改变。绍兴之于朝廷，不复南镇之于“天下”的“镇服”意义，而成为南宋统治者赖以维持统治的中心地带。明太祖遣人探访历代帝王陵寝，浙江省进献大禹陵图，并修建大禹庙。清代继承了绍兴大禹祭祀，康熙帝南巡时亲临大禹庙祭祀，并写下了禹陵颂。1996年，大禹陵被列为第四批全国重点文物保护单位。其登记清单为：绍兴会稽山禹陵为大禹的葬地。禹陵坐东朝西，有棂星门、甬道、大禹陵碑亭。相传墓内原有“苇椁桐棺”，早已无存。"
                }, {
                    name: "马臻墓和马太守庙",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "马臻墓位于绍兴市区偏门外跨湖桥直街。墓葬朝南向，封土四周用条石砌筑，高约2米，墓前正中横置墓碑，铭曰“敕封利济王东汉会稽郡太守马公之墓”，清康熙五十六年（1717）知府俞卿所立。碑前立四柱三间青石牌坊，明间额坊上刻北宋嘉祐初仁宗所赐“利济王墓”四字。马臻墓在1963年被列为浙江省文物保护单位。马臻墓旁有马太守庙。南宋嘉泰《会稽志》云马臻：“创湖之始，多毁冢宅，有千余人怨诉，臻被刑于市。及遣使按覆，总不见人，籍皆是先死亡者然。越人至今庙祀之”。"
                }, {
                    name: "大王庙",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "大王庙位于绍兴市柯桥区钱清镇江南村虎象自然村。始建年代不详，现存建筑为清代重建，2011年被列为浙江省文物保护单位。整组建筑依山而建，由戏台、韦陀殿、山门、大王殿等建筑组成，大王殿主供奉“马臻夫妇”，是山阴百姓纪念马臻太守所建，乡民尊称马臻为“大王菩萨”。绍兴现存规模最大的马臻庙有两处，另一处是在绍兴城偏门外鉴湖之滨，跨湖桥之南的马太守庙。南宋嘉泰《会稽志》卷第六“祠庙”条记：“山阴马太守庙，在县西六十四里”。清乾隆《绍兴府志》卷三六称此庙“在广陵斗门，隶山阴”。嘉庆《山阴县志》谓：“在县西六十里广陵陡门上……案旧志，有利济王庙，在县西南五十里，祀太守马臻，疑即此县西之庙”。"
                }, {
                    name: "八字桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "八字桥位于绍兴市区直街东端。八字桥建于宋代，南宋嘉泰《会稽志》卷十一载：“八字桥在府城东南，两桥相对而斜，状如八字，故得名”。可见在嘉泰年间之前，八字桥业已建成。在八字桥主桥孔下的第五根石柱上刻有题记“时宝祐丙辰仲冬吉日建”。宝祐丙辰年是南宋宝祐四年（1256），当为八字桥重建之年。清乾隆四十八年（1783）曾对八字桥进行大修。八字桥地处三条街、三条河的交汇点，主桥跨越南北向稽山河主道。主河两侧原有东西两条小河，今存一小段。在八字桥登桥踏步下还筑有梁式桥洞，东西两侧均有这种踏跺桥洞，相互对称，形象地构成一个“八”字造型。桥下的水四通八达，东西南北都可通船，解决了三街三河复杂的交通问题，被誉为中国最古老的“立交桥”。正桥为梁式结构，净跨4.5米，桥高5米，桥面条石并列，微微拱起，两侧辅以石栏。"
                }, {
                    name: "古纤道",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "古纤道又称官塘，旧称新堤、运道塘、武林孔道等。唐元和十年（815），浙东观察使孟简始建绍兴西郭门外向萧山方向的“运道塘”，即运河堤岸，既保证了运河本身的安全，也便于船只牵引，习惯上称为纤道。宋、明、清各代都有增筑。明代，将原土筑纤道改为石砌。明弘治年间、清康熙年间均重修。20世纪80年代，随着交通形式的改变，浙东古纤道逐渐失去其原有功能，1983年与1989年进行重修。1988年，古纤道被列为第三批全国重点文物保护单位。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "绍兴滨海，发展制盐业的条件便利，早在春秋时期就有盐业。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦始皇行郡县制，以故吴越地置会稽郡，郡治吴（今江苏苏州），原越地称大越。秦始皇帝三十七年（前210），秦始皇东巡至会稽，更名大越曰山阴，山阴县名始于此。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "东汉永建四年（129），析会稽郡为二：浙江以西为吴郡，治吴；浙江以东为会稽郡，治山阴。东汉永和五年（140），会稽郡太守马臻纳山会平原36源之水，兴建了鉴湖。宋《太平御览》记载：“《会稽记》曰汉顺帝永和五年，会稽太守马臻创立镜湖，在会稽、山阴两县界。筑塘蓄水，高丈余，田又高海丈余。若水少，则泄湖灌田。如水多，则开湖泄田中水入海，所以无凶年。堤塘周回五百一十里，溉田九千余顷。又《会稽记》云，创湖之始，多淹冢宅。有千余人怨诉于台，臻遂被刑于市。及台中遣使按鞠，总不见人。验籍，皆是先死亡人之名”。"
                }, {
                    name: "晋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "从鉴湖初创至晋代，山会平原的主航线就是鉴湖，但自贺循疏凿西兴运河后，鉴湖西段（山阴县）的航线逐渐被西兴运河替代。西晋太康二年（281），改会稽郡为会稽国。东晋太宁二年（324）又改国。西晋永嘉元年至三年（307～309），会稽内史贺循主持疏凿了西兴运河。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐代山阴县置而复废凡三次。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "宋代是浙东运河最辉煌的时期。鉴湖原称镜湖，后亦称贺家湖、南湖、长湖、大湖、贺监湖，北宋始称鉴湖、照湖，是我国古代著名的蓄水灌溉工程。北宋中期，两浙路向朝廷转运的粮食、布帛和赋税，主要通过鉴湖和西兴运河的航运。北宋末，明州知州蔡肇称赞浙东运河“三江重复，百怪垂涎，七堰相望，万牛回首”。南宋时期，由于宋室南迁，北方大片领土丢失，浙东地区对朝廷的重要性进一步提升。越州在南宋王朝有重要地位，按照陆游的说法，“今天下巨镇，惟金陵与会稽耳”。当时的浙东运河，沟通了首都临安与经济发达的绍兴、明州等地，南宋朝廷所需的大量物资通过这条水道运输。同时，对于重视海外贸易的南宋来说，联通对外贸易的重要港口明州意义也十分重大。但鉴于运河的淤塞，为了保证其通畅，南宋朝廷也着力对运河进行整治：“绍兴初，高宗次越，以上虞县梁湖堰东运河浅涩，今发六千五百余工，委本县令佐监督浚治。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元代虽然定都于北方，但财政上依赖经济发达的两浙地区。元代实行行省制，初绍兴府改为绍兴路，隶属于江淮行省，后改江淮行省为江浙行省。元代海运发达，朱清、张瑄专掌海运，江南地区的漕粮大多从海上输送，但是内河航运并没有完全弃用，浙东运河仍然承担着输送漕粮的任务。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明代与元代一样，对产盐地划区管理，绍兴地区属于两浙都转运盐运司。明代盐法属于开中法体系，为了刺激给边地运送军粮，明初规定，商人可以通过输送粮食换取盐引，然后凭引领盐运到指定地点售卖。明代还在绍兴设置了卫所，主要有绍兴卫，领三江所等。然而，卫所制在明代中后期也有松动，绍兴地区甚至还发生过负责海防的三江所去协助负责漕运的绍兴卫之类的事。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明清两代浙东运河地位有所下降。钱清场在清代前期甚至成为浙东地区最大的盐场，并且兼理西兴场。清代在浙江省城杭州设两浙都转盐运司，绍兴府设立绍兴批验所。清代也会给商人发放盐引，绍兴地区的商业用盐同样是通过运河来行销的，其盐在钱清、三江、曹娥等盐场捆运，然后再通过运河运输。"
                }]
            }]
        }, {
            name: "嘉兴",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "江南运河",
                    value: "江南运河，又称江南河、浙西运河，是京杭运河在长江以南的一段，北通长江，南达钱塘江，连通长江、太湖、钱塘江三大水系，至今仍全线通航。江南运河位于长江三角洲地区，以太湖水系为中心，北起长江南岸的江苏镇江京口，东南经常州、无锡，绕太湖东岸达苏州、吴江、平望，然后进入浙江嘉兴，折而西南，又经崇德、长安、临平，最终到达杭州，全长340 千米。江南运河是富庶的江南地区与北方相通的水运干道，航运条件良好，也是京杭运河运输最繁忙的航道。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "钱镠",
                    value: "钱镠（852～932），字具美，五代十国时期吴越国开国皇帝，在位期间重用人才，鼓励垦殖，修建钱塘江海塘保护民田与百姓生命安全，并修建一系列堰、闸,用以调节水源，进行灌溉与分洪，使吴越国经济繁荣、社会稳定，被百姓誉为“海龙王”。"
                }, {
                    name: "秦始皇",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "秦始皇（前259～前210），嬴姓，名政，秦朝开国君主，完成了中国历史上的第一次大统一。秦始皇三十二年（前215），中央政府颁布疏浚开河令，“决通堤防”，希望增强中原各地的交流。三十三年，秦始皇派大将屠睢率军50万征伐南越，因南越地区山峦起伏，烟瘴密布，军队、粮食运输非常不便，严重阻碍了军事行动的开展，于是命监御史禄开凿灵渠，直接沟通了湘水与漓水，从而使长江与珠江两大水系得以贯通。灵渠的开通，不但方便了秦王朝统一南越地区，设置了桂林、南海、象郡，加强了中央政府对这一地区的管辖，而且对于南越与中原地区的政治、经济、文化交流也有着重要的意义。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "分水墩",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "分水墩位于嘉兴市解放街道芦席汇旁，东北西南走向。据地方志记载，此墩明清以前即有，是开浚城河时留下的土堆或堆土而成，对于减缓大运河水流有一定的作用，是嘉兴古运河上的一种水利设施。明清时曾是一个很热闹的蔬菜集散地。分水墩保存完好，结构清晰，墩上现存水天庵古迹。水天庵始建于唐，清同治年间重修，2002年重新修葺，保存较好。2009年，分水墩被列为嘉兴市文物保护单位。"
                }, {
                    name: "秀城桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "秀城桥嘉兴市仅存的单孔石拱桥之一。据《竹林人圩志》记载，桥始建于明景泰元年（1450）。桥身楹联北侧上联为“帝到遐昌，兴水利而济涉”，下联为“皇口巩固，乐民便以成梁”。南侧上联已风化，字迹不可辨；下联为“凭跳一濠，是号秀城之胜概”。可见，桥当时因跨秀水并傍城廊而得名，是解放街道通往市中心的主要行人桥。桥拱孔圈石纵联砌置，桥身长35米，桥面宽3.8米，拱矢高约9.5米，南北桥垛各有台阶36步级。今存望柱共7根，其中桥顶方形望柱3根，素面无雕饰，桥南北堍莲花状，圆柱4根，栏板、砷石素面无雕饰。桥顶面栏板刻有花草纹饰，并有阳刻楷书铭文“重建秀城桥”。桥南踏垛因缸髼甏汇河岸狭窄，不能伸展，则在桥堍石阶起步处筑有小平台，平台台阶石沿街平行铺伸相连，构造巧妙。桥整体保存尚可。东侧桥面望柱缺损，桥身多处有水泥修补痕迹。桥身长有植被，台阶石板部分有缺损。"
                }, {
                    name: "秋泾桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "秋泾桥位于嘉兴市解放街道闸前街，据明万历《秀水县志》记载，“秋泾桥，明崇祯十四年重修”，清嘉庆十一年（1806）再修，1981年被列为嘉兴市文物保护单位。秋泾桥是一座单孔石拱桥，桥全长60米，桥面宽4.8米，桥孔拱矢高约11米，拱孔圈石纵联分节砌置，金刚墙错缝顺砌，桥南北堍斜长26.7米，今存望柱7根，其中方形望柱5根，分别在桥南北堍，狮子望柱2根，在桥顶西侧，栏板、砷石均素面无雕饰。桥整体保存完整，桥拱现有钢结构加固。东西桥墩有水泥修补，护栏望柱有缺失，桥身长有部分植被，楹联字迹已风化。"
                }, {
                    name: "落帆亭",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "落帆亭是古代嘉兴运河边杉青闸旁的一处名胜，因船只过闸后落帆的实景命名而建。落帆亭在民国时园林建筑规模颇大，是嘉兴主要运河风景点之一。登上假山顶的落帆亭，极目远眺，运河上长虹卧波，帆影点点，水乡美景一览无余，展现了其独具江南水乡特色的文化魅力。落帆亭始建年代不详，地方志只记载宋神宗熙宁初重建。清光绪六年（1880）再次重建，增筑太白亭，旁有花神及闸神像。1921年，嘉兴酒业公所出资再修。园内假山玲珑，亭轩幽雅，池塘遍植荷花，清香四溢，风光优美。园内建筑面积2500平方米，现代编写的《江南园林志》将落帆亭列为名园。“文革”期间，落帆亭遭到严重破坏，仅存部分假山和太白亭等旧迹。2009年8月，落帆亭修缮工程设计方案编制完成并通过市级论证，2010年对落帆亭实施全面修缮。现有太白亭、帆影亭、六角亭等，保留的历史建筑有前厅和后室两处建筑，建筑整体保存较好。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "据说春秋时期的槜李城便位于王江泾区域内。相传春秋时吴国设防御越国之所，唐会昌垒土为城，设新城税课局。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦始皇二十四年（前223），秦灭楚，定荆江南地。《越绝书吴地传》中有早期在浙西开凿运河的记录：“秦始皇造道通陵，南可通陵道……治陵水道到钱塘越地，通浙江”。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "罗马尼亚人尼斯米列斯库曾于清康熙时任沙俄使节赴北京，归后作《中国漫记》一书，对17世纪嘉兴城市的物产、风情进行了细致的描绘：本省第二大城市名嘉兴，秀丽而土壤肥沃。这里养蚕业十分发达，几乎没有一家是不养蚕的。城市位于一条河上，城里河网密布，河岸铺有经过雕凿的石块，河上架有许多石桥，船只可以在全城各处通行。这座城市闻名遐迩，不仅是由于它的秀丽风光、物产丰富和人民生活的安乐富足，还因为这里所有的街道都遮有石砌拱顶，使行人免遭雨淋之苦，街上亦无泥泞。城里有许多功德牌坊，城外也有不少，均以汉白玉砌成。这里也建有许多大桥，其中一座尤其雄伟。离桥不远有一座九层宝塔，非常壮观。所有从这里出发的运河都用大石块砌成，这些运河上有四十座大石桥，至于小石桥就不计其数了。府城下辖六个小城镇。这里的池沼广泛生长一种水果，中国人叫荸荠，圆形，大小如栗子，薄薄一层红皮，肉白色，味道如苹果，但略甜。这里还有一种小鸟，人们把它用酒灌醉后拿到市场去卖，一年四季都有，而且数量很大。这里盛产丝绸。河里生长一种大螃蟹。离湖不远有一座山，它替代了作为城市的防御工事的护城河，山上有五座大宫殿，中国人在这里寻欢作乐，筵宴宾客。城市附近有广阔的平原，大海离此不远，这里盛产食盐。"
                }, {
                    name: "晋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "据传，“王店”之名始于五代后晋天福间，时有王逵者，官嘉兴镇遏使，后晋升为柱国大夫、工部尚书，于大彭都官滩里构屋定居，“聚货贸易，因名王店”。后晋高祖天福五年（940），因吴越王钱元瓘之奏请，在嘉兴置秀州，领嘉兴、海盐、华亭、崇德四县。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐代，海盐、崇德、华亭等县开始分立，五代后晋天福年间设秀州，统辖嘉兴、海盐等四县。唐代之前，杭州至嘉兴段运河已有设闸，定时启闭以通运河之流。唐代大规模围垦浅沼洼地，屯垦造田，经过整治水道、浚治塘浦、梳排水潦、修筑圩岸，形成河渠纵横、圩田棋布的塘浦圩田体系。经过唐代后期的这次屯田经营，嘉兴地区得到真正开发，逐渐形成“畎距于沟，沟达于川……浩浩其流，乃与湖连。上则有涂、中亦有船，旱则溉之、水则泄焉，曰雨曰霁，以沟为天”的圩田系统。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "两宋时期非常注重太湖流域水系闸堰的管理，并设专官巡视、修固、启闭。宋代由于自然条件变迁和影响，吴淞江淤滞，东南海港浦渐塞，致使嘉境之水迂回绕道，水流缓慢。北宋改秀州为嘉禾郡，南宋庆元元年（1195）升郡为府，后改嘉兴军。北宋都城汴京，京师及周边地区物资供应十分仰赖运河。北宋灭亡之后，绍兴八年（1138）二月，南宋朝廷以杭州为行在，嘉兴成畿辅之地，位置尤其重要，各县水路要冲皆设立巡检司。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元代江浙漕运以海运为主，起初大多由刘家港（今江苏太仓市浏河镇）聚集起运，后多辗转到澉浦港起运大都。清雍正《浙江通志》中记“嘉兴，浙省大府，而松江在元初为华亭，府乃嘉兴属邑，而升为府者，是海漕之利，惟浙中之粟独多。观顺帝至正时，海漕不至，征粟于张士诚、方国珍更可见矣。则元时海运，其为浙江之漕运无疑也”。元末江南运河经历了一次改道。元代王江泾始设巡检司，是嘉兴境内所设6个巡检司之一。元末张士诚意欲南下时，元兵先锋“吕才以七千众屯王江泾”，结果导致“商旅不行，川途严肃”。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明初，吴淞江海口愈向东移，江身淤塞更加严重。明清两代对太湖水利的治理颇为频繁，疏浚吴淞江不下二三十次之多，其他河湖港汊的疏浚亦几乎年年都有，对设闸和增修圩堤颇为重视。明初，朱元璋定都南京，由于运河并不十分畅通，故北运漕粮大多仍走海道。明代时漕运司治为守御千户所所取代，嘉兴所设于郡城内，隶属苏州卫，“通共有旗军一千一百二十名，前各官户下人丁即为舍人，随军操练，防守四门，内：各军又为马军、步军、操军、运军各若干名”。明代中期倭乱期间，由张经、俞大猷指挥的“王江泾大捷”也发生于该地。至明末，王店重新繁荣起来，“市多贩粜……所织绸最著名”“盖一方大都会”。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明清易代战争对嘉兴城影响很大。北面是明清时期的江南巨镇盛泽，是浙西运河嘉兴段的起点。该镇至明清而极盛，成为可以和盛泽相埒的江南丝织业大镇之一。王江泾乡农因此也多以纺织为业，镇上百姓多从事丝绸贩卖，居民“多织绸收丝缟之利……不务耕”，明清时期成为江南丝绸交易的重要商业市镇。明清时期，该镇丝绸棉布贸易非常发达，“其民男务居贾，与时逐利，女攻纺织，居者可万余家”。"
                }]
            }]
        }, {
            name: "镇江",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "江南运河",
                    value: "江南运河，又称江南河、浙西运河，是京杭运河在长江以南的一段，北通长江，南达钱塘江，连通长江、太湖、钱塘江三大水系，至今仍全线通航。江南运河位于长江三角洲地区，以太湖水系为中心，北起长江南岸的江苏镇江京口，东南经常州、无锡，绕太湖东岸达苏州、吴江、平望，然后进入浙江嘉兴，折而西南，又经崇德、长安、临平，最终到达杭州，全长340 千米。江南运河是富庶的江南地区与北方相通的水运干道，航运条件良好，也是京杭运河运输最繁忙的航道。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "曹操",
                    value: "曹操（155～220），字孟德，东汉末年沛国谯县（今安徽亳州）人，著名政治家、军事家和文学家。他以镇压黄巾起义而起家，后兴兵讨伐董卓，迎汉献帝赴许县（今河南许昌），“挟天子以令诸侯”，采取抑制兼并、广兴屯田的政策，实行“唯才是举”的政治方略，消灭了袁术、袁绍、刘表等割据势力，统一了北方。位至大将军、丞相，后封魏王。在统一北方的过程中，曹操先后开挖了许多运河。"
                }, {
                    name: "陈勋",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "陈勋（生卒年不详），三国吴人，曾担任典农校尉一职。"
                }, {
                    name: "林则徐",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "林则徐（1785～1850），字元抚，又字少穆、石麟，晚号竢村老人，福建侯官（今福州）人。清嘉庆十六年（1811）进士，改翰林院庶吉士，散馆授编修。后任监察御史、浙江杭嘉湖道、江苏淮海道、署浙江巡盐使。道光三年（1823），迁江苏按察使。后任江宁布政使、河东河道总督、江苏巡抚、署两江总督、湖广总督、两广总督。鸦片战争爆发后，被发配伊犁。道光二十五年，流放结束，署陕甘总督。道光三十年十月，受诏赴广西平定天地会，途中病卒，谥“文忠”。著有《使滇吟草》《林文忠公政书》等。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "西津渡遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "西津渡遗址位于镇江城西的云台山麓。时代自唐至晚清，是一处以船渡江的大型渡口遗址，以管理渡口官署建筑为中心，包括交通、宗教等多功能区域。经考古发现有北宋、南宋至元及清代几个时期码头平台遗迹和唐、宋、元、明、清各个时期的官署建筑遗迹，反映了历代渡口完整时空演变，对于研究古代交通史、渡口史具有重要意义。渡口处建有待渡亭一座，现亭于清同治七年（1868）重建，1982年被列为市级文物保护单位。"
                }, {
                    name: "小码头遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "小码头遗址位于镇江市润州区金山街道西津古渡社区蒜山游园东侧200米处。西津渡小码头清康熙年间始筑。同治至光绪前期，随着江淤上涨，码头改向上发展，光绪二十六年（1900）前后，码头被淤填成陆地。据考证，该码头是清代救生会、义渡局的专设码头。2008年4月，小码头遗址由镇江市古城考古所和西津渡建设发展公司合作考古发现，9月修复展示。"
                }, {
                    name: "西津渡历史文化街区",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "西津渡历史文化街区位于镇江市区西北，占地0.5平方千米。第二次鸦片战争期间，中英签订《天津条约》，镇江被开为商埠。清咸丰十一年（1861），英国将西津渡银山门一带辟为租界，直到1927年国民政府收回租界。西津渡历史文化街区即是在英租界基础上改造而成的，英租界旧址内现存英国领事馆、美国领事馆、英工部局大楼、税务司公馆、亚细亚火油公司、美孚火油公司等建筑。租界旧址被辟为鉴园，以史为鉴，英国领事馆则成为今镇江博物馆的一部分。街区内现有3处全国重点文物保护单位、14处省市级文物保护单位，保存着自唐朝以来大量的历史遗存和成片的传统民居，被誉为“中国古渡博物馆”。"
                }, {
                    name: "镇江英国领事馆旧址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "镇江英国领事馆旧址位于镇江市润州区金山街道小街社区伯先路85号。1858年，镇江被辟为通商口岸。同治三年（1864），英国于云台上建筑领事馆，划滨江一带为租界。领事馆整体是以红砖间夹青砖叠砌的砖木石结构，由5幢楼房组成，属19世纪后半叶券廊式建筑，为欧洲古典建筑的变种。光绪十四年（1888）曾被毁，光绪十六年重建竣工。1927年3月，英领事将租界行政交镇江商会商团接管，关闭了领事馆。领事馆由5幢楼房组成，办公主楼占地面积458平方米。东立面三层，局部两层，有券廊。上层用红砖砌成山花、线条，青红砖木结构，三面有券廊，长28米，宽22米，高13.5米。朝南正立面为正门，共九级台阶。门前有阳台，檐、窗等均用水磨砖砌成，内部共有大小房间18间。现属镇江博物馆，进行了多次维修改造，保存情况较好。1996年被列为全国重点文物保护单位。其近现代重要史迹及文物具有很高的历史价值。"
                }, {
                    name: "京口救生会遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "京口救生会遗址位于镇江西津渡街元代昭关石塔旁侧，屋五椽，两层，砖木结构。门额石刻上题“京口救生会”4个大字，旁署“光绪乙未二十一年冬重修”。清康熙四十一年（1702）以蒋乃鼐为首的“京口善士十五人，劝邑中输钱以救涉江覆舟者”，并在云台山观音阁正式成立“京口救生会”，筹募经费，购石塔旁晏公庙旧址建办公会所，造救生红船10余艘，并修筑有1座救生专用码头。"
                }, {
                    name: "昭关石塔",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "昭关石塔位于镇江市云台山北麓通往江边义渡小码头的古街道上，是西津渡的过街石塔，因塔上刻有“昭关”两字，故名“昭关石塔”，又称观音洞喇嘛塔、瓶塔，系元武宗海山皇帝命画塑元大都白塔寺工匠刘高仿京刹梵相而作的金山般若禅院的一部分。竣工于元至大四年（1311）或稍前。塔的下半部用块石垒砌，成四根石柱，顶部铺满条石，筑成一个框架形的台座。台座东西长3.8米，南北宽3.2米，石柱间形成4扇圭形门。门高2.5米，宽1.8米，南北两门叠石为墙，下面可以通行人马。石塔即建于这个台座上。塔高4.69米。塔座、塔身、塔顶三部分皆用青石雕刻建成。塔座用2个相同的须弥座叠成，须弥座上为覆莲圆座和扁鼓形塔身。再上有13圈带形浮雕，象征十三层天，上置法轮和圆形仰莲小座，轮上刻有“八宝”，其上便是塔顶。石塔台座的东西两面横额上有相同的刻字，左右分别镌刻着丹徒、镇江的知县、知府等题名，落款刻“万历十年壬午十月吉日重修”。2006年被列为全国重点文物保护单位，是我国现存惟一完整、时代最早的喇嘛塔式过街塔，具有重要的历史文化价值。"
                }, {
                    name: "广肇会所",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "广肇会所位于镇江市润州区金山街道京畿路社区伯先路82号，是一座古典式建筑，坐东向西，房屋10余间，占地面积近600平方米。公所原址在运粮河畔，由明代在镇江经商的广州、肇庆两府的商人集资修建，因而被称为“广肇”。由于年久失修、地渐偏僻，因而将旧会所移建于此，厅前南侧厢房中墙内嵌有“京江广肇公所记”石碑一方，详细记述了广肇公所的由来及重建始末。民国初年，孙中山辞去临时大总统后，从上海至南京途经镇江，曾在公所住宿一夜，在此召集各界人士，发表演讲。2011年被列为江苏省文物保护单位，为研究近代镇江会馆史提供了鲜活的历史资料。"
                }, {
                    name: "镇江商会旧址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "镇江商会旧址位于镇江市城西伯先路73号。于1929年建成，由陆小波等人用北伐军归还镇江工商联借款20万元银洋中的4万元建造。整体形制为中西合璧式的两层楼房，南部供镇江商会办公，北部租给中央银行镇江支行。该建筑为砖木结构，青砖叠砌，有房屋78间半，占地面积约1891平方米。正门朝南，门上嵌白石横额，上镌刻有“镇江商会”4个大字，落款为“于右任题”。其内部为中式三进，第一进为走廊、天井，中为大厅，两旁为厢房，后为西式的两层楼，第三进为一座三层楼房。整幢建筑中西结合，是镇江历史风貌的优秀载体。"
                }, {
                    name: "新河街",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "新河街位于镇江市京口闸以东。南北向，200多米长，建筑均系砖木结构。石子铺街面，雕花门楼、石额。两边临街建筑大多为晚清房屋，现有建筑有同善堂（慈善机构）、米业公所、安仁堂泾太公所、陈公馆、黄公馆、徐（保山）公馆、静瑞堂、清真寺等。其中，米业公所在新河街112号，俗称“牙行”，是米业界的同业公会。现存前后四进穿堂式建筑，有水磨雕花门楼，存石额1块。晚清时新河街因临长江、古运河边缘而成为客货运繁忙之地，商业尤其发达。1987年被列为镇江市文物保护单位。新河街反映了运河沿岸商业活动的历史，具有一定的历史价值。"
                }, {
                    name: "大运河丹徒段",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "大运河丹徒段位于镇江市丹徒区辛丰镇石城行政村东石自然村至刘家村。秦始皇三十七年（前210），凿丹徒河，使赭衣徒3000人凿京岘南坑，于云阳凿北中冈，始有丹徒运河雏形。隋再疏浚。大运河丹徒段自区北辛丰镇东石村入境，纵贯区境中部，从辛丰镇刘家村出境。境内流程约13.5千米，最宽处17米，最窄处3米，最深处7米，最浅处2米。大运河义渡碑位于丹阳市陵口镇庙段行政村上栅口自然村南大运河堤上。碑为青石质方形，高1.8米，宽0.95米，厚0.35米。碑面朝西，碑首刻有“捐造义渡碑”，左下方刻“嘉庆二十一年仲冬上浣”。碑文记载了上栅口渡口在清代修建新渡船，因资金缺少，由普信僧化缘，附近村民捐款人的姓名、数量及所住村庄。碑文清晰，有部分文字不清，有风化迹象。"
                }, {
                    name: "练湖闸",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "练湖闸位于丹阳市云阳街道北环路提香花园街提香花园小区东。练湖闸经河道西连练湖，东由老西门运河与京杭大运河相连，用于调节练湖水位高度。1935年由民国江苏省建设厅聘专家设计。1935年7月动工，1936年8月竣工，建堤16千米，受益田亩达5万公顷。为钢筋水泥混凝土结构五孔泄水闸，闸门木制，长约18.75米。"
                }, {
                    name: "张官渡遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "张官渡遗址位于丹阳市云阳街道张官渡社区张官渡自然村东。现遗存码头遗址石板路一条，长约50米，宽约0.6米。路南北两侧有残破晚清、民国民居二三十处。码头于1996年大运河拓宽工程中被拆除。张官渡历史悠久，据史料显示，最晚在宋代就有古渡口存在，是宋至清代大运河东西两岸人民生产、生活交通的重要渡口。张官渡遗址对研究丹阳人民古代社会生活、交通状况以及练湖水域与大运河关联的济漕、农业灌溉等功能有较高的价值。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "春秋属吴，谓其地为朱方，故朱方亦常指称镇江。吴灭，属越；越灭，属楚。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "原丹徒水道南段为直道，“地势高亢，涸溢弗常”，秦始皇截直取曲后，开凿出一条新的通江河道，元人俞希鲁在志书中称“漕渠之凿自秦始，历代因之”，“秦凿丹徒、曲阿，齐通吴、会，隋穿使广”，秦朝开凿的这段河道实际上成为后来江南运河北段的雏形，故镇江的历史在建城最初之时就与运河息息相关。为避开长江之险，赤乌八年（245）孙权发屯田将士3万人，凿句容中道，号破冈渎，起自句容小其（今江苏句容西南），横越高阜，东通云阳西城（今江苏丹阳延陵），与原丹徒水道衔接，西连淮水（今秦淮河），直抵建业，沿途修建“上下一十四埭，上七埭，入延陵界；下七埭，入江宁界”，用以蓄水，极大地扩展了丹徒水道的辐射范围，“于是东郡船舰不复行京江矣”。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "汉初因荆王刘贾都于此，为荆国，后更为吴会稽郡。东汉属吴郡，顺帝分会稽置吴郡，统丹徒、曲阿。东汉建安十四年（209），孙权为防曹操曾一度迁都于此，号曰“京城”，亦称“京口”，亦称“徐陵”，起城池，城形如瓮，亦名“铁瓮城”。京城依北固山，因山为垒，北邻长江，缘江为境，运河向西由此延伸至京口入江。"
                }, {
                    name: "晋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "东晋咸和二年（327），历阳内史苏峻反。西晋末永嘉之乱，北方人口大量南移，东晋元帝时在京口侨置徐兖二州。时北中郎府驻地在京口，号称北府。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "北宋开宝八年（975）八月，宋军占领润州，十月，宋廷下诏改镇海军为镇江军，这是镇江得名的开始。北宋末政和三年（1113），润州升州为府，改称镇江府。镇江作为江河交汇交通枢纽的作用在宋代进一步突出。南宋期间镇江城内外沿河一线便建有一批粮仓。南宋嘉定六年（1213），镇江闸口河道淤塞，“不复通舟，凡有纲运，悉自江阴宽转，由五泻堰以入运河”。"
                }, {
                    name: "明清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明清两朝更是江南漕粮的转运枢纽，史称京口为“江淮之粟所会，是诸郡咽喉处”。从组织机构来看，明初，于丹徒置巡检司，负责巡察、管理江防。其巡司区域上游到高资港，巡司70里；下游到安港，巡司亦70里。清前期因袭明制，雍正八年（1730）划江宁府之溧阳县辖于镇江。清末光绪三十年（1904），在丹徒县东北长江中太平洲设置太平厅。"
                }]
            }]
        }, {
            name: "扬州",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "淮扬运河",
                    value: "淮扬运河连通淮河、长江两大流域，串联洪泽、高邮、邵伯等湖泊；干支航道蛛网交织，衔接上海、连云港两大海港；水运辐射面可达鄂、湘、赣、苏、皖、鲁、浙、沪等省（市），为我国南北水运大通道的重要河段。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "曾国藩",
                    value: "曾国藩（1811～1872），湖南湘乡（今属湖南双峰）人，初名子城，字伯涵，号涤生，与胡林翼并称“曾胡”，与李鸿章、左宗棠、张之洞并称“晚清四大名臣”，官至两江总督、直隶总督、武英殿大学士，封一等毅勇侯，谥曰“文正”。曾国藩未曾专任河漕之官，担任直隶总督期间，对永定河屡加修治；重任两江总督时期，对漕政有所革新。"
                }, {
                    name: "王安石",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "王安石（1021～1086），字介甫，北宋抚州临川（今属江西）人。王安石少年时爱好读书，过目不忘，得到欧阳修的欣赏。仁宗时，科举中进士，名列上等，任签书淮南判官，后调任鄞县（今浙江宁波）知县，舒州（今安徽安庆）通判、群牧判官、常州（今属江苏）知州、提点江东刑狱、度支判官等职。神宗在做颍王时，时常听到左右谈论王安石的革新言论，非常赞同，即位后立即加以重用。熙宁二年（1069），王安石被任命为参知政事（副相），负责实施变法，当时称为“新法”。因新法触犯了当权者的实际利益，遭到他们的激烈抵制与反对。神宗开始动摇，熙宁七年罢免了他的宰相职务，任命为观文殿大学士、江宁知府。次年虽又重新召王安石为相，然而新法已经大多遭到破坏。长子王雱的去世，也令他备受打击，他多次托病请求离职，出任镇南军（今江西南昌）节度使、同平章事、判江宁府等职。元丰二年（1079），王安石被任命为左仆射、观文殿大学士，封荆国公。哲宗即位后，加王安石为司空。元祐元年（1086），王安石去世，朝廷追赠为太傅，谥号“文”，配享神宗庙庭。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "盐务会馆",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "盐务会馆位于扬州市广陵区东关街道东关街社区东关街396号、398号、400号。占地面积1374平方米，建筑面积370平方米。入内为楠大厅，通面阔三间，大厅前有三面回廊拱卫，于1983年拆除，移建于北门外街卷石洞天内。在大厅后面至今还保存三进古宅。第一进面阔五间，进深三檩。第二进朝南一顺五间，前置走廊，两旁置厢廊。其窗门槅扇灯笼锦式及堂屋方砖、卧室地板、壁板一应俱全。第三进是明三暗五格局，主房面阔14.5米，进深七檩。后有小园1座，有水井1口。"
                }, {
                    name: "普哈丁墓园",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "普哈丁墓园位于扬州城区解放桥南，古运河东岸高冈之上。相传普哈丁为伊斯兰教创始人穆罕默德第十六世裔孙，南宋咸淳年间来扬州传教，建仙鹤寺，在扬州生活10年。德祐元年（1275）去世之后，郡守将其安葬于运河畔今址。墓园大门及主建筑皆为西向，上有“西域先贤普哈丁之墓”石额。园内阿拉伯式和中国传统式建筑有机地形成整体，门额题为“天方矩矱”，意为阿拉伯楷模人物。墓筑于墓亭中央地下，地面为五层矩形墓塔，雕有精美花纹，第三层侧面阳刻阿拉伯文《古兰经》摘录。墓亭为砖石结构，方形平面，四出拱门，内为波斯风格，砖砌圆穹顶，外为中国传统四角攒尖顶，是融合阿拉伯文化和中国传统文化的典型实例。墓园内还安葬有宋元明清时期先贤及虔诚教徒，共有30座墓塔。另有元代阿文篆刻的阿拉伯人墓碑数通，有明代扬州卫籍昭勇将军张炘墓石、神道、牌坊和石羊一双，有甲午战争中在平壤抗击日军侵略的将领左宝贵衣冠冢，并保存有清代和民国多方碑刻及碑铭拓片，如清道光年间的《普哈丁先贤墓礼拜寺义学膏火碑识》、光绪三十四年（1908）的《先贤历史记略》、1932年的《韩阿衡遇春碑铭》等。"
                }, {
                    name: "仙鹤寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "仙鹤寺位于扬州市广陵区汶河街道旌忠社区南门街111号。占地面积1740平方米，建筑面积690平方米。寺因整个建筑与古柏布局如鹤形，故名。大门东向，有门厅、礼拜殿、水房、望月亭、诚信堂、配房等建筑。门厅三楹，有门簪，上悬“礼拜寺”匾。礼拜殿在垂门内，坐西朝东，为勾连搭式，前后两部分。前殿面阔三间17.9米，进深9.25米，高8.2米，歇山顶，前有廊轩。后殿重檐歇山顶，面阔五间17.9米，进深5.9米。诚信堂位于中心院落的南侧，硬山顶。院内存有古银杏一株。"
                }, {
                    name: "宝轮寺禅堂遗构",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "宝轮寺禅堂遗构位于扬州市邗江区城北乡黄金村、黄金坝桥东北侧大王庙广场。宝轮寺禅堂遗构，原为邗沟大王庙，建筑面积286平方米，面阔五楹21.65米，进深九檩12.1米，高11米，硬山顶。在大殿两侧新建廊房。邗沟大王庙俗称邗沟财神庙，始建年代不详，旧在邗沟故道旁。殿中主祀吴王夫差，配祀汉初吴王刘濞，建筑北向。2006～2007年，建大王庙广场，移南门外宝轮寺大殿，复建大王庙于此。在大殿内塑造二王像，并祀其间，更制匾额、楹联、壁画等，又建“借沙取银”池以传其故事。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "春秋末期，吴王夫差开挖中国最早的运河—邗沟，筑邗城，开启了扬州的建城史，使得扬州凭借便利的水运条件，成为区域中心城市。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "汉代广陵先后为淮南国、吴国、江都国、广陵国等诸侯王之地。西汉时吴王刘濞曾疏浚邗沟，开凿运盐河，其都城广陵商业贸易活跃，聚集大量的财富，优越的地理条件使其成为南方物资北运的枢纽。东汉建武十八年（42），置广陵郡，属徐州。"
                }, {
                    name: "三国",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "三国时期，广陵城介于南北之间，为江淮军事重镇而遭到争夺，东吴政权曾在旧城址上再次修筑广陵城。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋开皇九年（589），改北周的吴州为扬州，置总管府，杨广任扬州大都督，从此始称为扬州。”。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐代宗时，刘晏改革裴耀卿的转般法，遣兵将漕粮由扬州运至河阴，再由河阴运至渭口，由渭口运入太仓，节级转般，“江南之运积扬州”，扬州成为东南物资集散地，因此日益繁荣，逐渐成为江淮流域富甲天下的城市。由于地理位置的重要，唐代的扬州不仅是江淮流域的政治经济中心，也是东方世界的著名通商港口，经济繁荣，对外贸易昌盛，吸引了各国的商人云集于此。扬州城的规模因此空前扩大，形成了蜀冈上的“子城”和蜀冈下的“罗城”。城址从蜀冈之上逐渐向运河之滨转移，以适应转运贸易的需要。唐宝历二年（826），盐铁转运使王播因扬州城内旧漕河水浅，遇旱易阻滞漕船，于是“自城南阊门西七里港开河向东，屈曲取禅智寺桥通旧官河，开凿稍深，舟航易济，所开长一十九里”。自此扬州段运河主干不由城内官河，改为沿罗城东南城垣而行，因此扬州城逐渐向城东部的运河边发展，罗城西部逐渐萧条。由于运河改道带来的扬州城向东南发展的趋势一直延续至南宋、明清时期，影响了其后1000多年扬州城池的发展。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "宋代最盛时的扬州依然是南北水上交通的要道，不过与唐代相比，北宋时扬州失去了通海的机会。所设立的8个市舶司并不包括曾是通商口岸的扬州，对扬州的商业经济造成了很大的影响，使其失去了向东延伸的交通线，缩小了扬州经济辐射的范围。北宋时期，扬州城在后周“周小城”的基础上扩建，更向东边运河方向发展，称为“宋大城”。南宋时期，江淮之间为宋与金元军事对峙区域，扬州既是南宋防御金兵的前哨要塞，也是江南物资转运前线的交通命脉，形成了“一地三城”的格局，以军事防御功能为主，城市经济稍逊于前代，不复往日辉煌盛景。宋代分原后周扬州都督府为四，分别是扬州、泰州、通州和高邮军，扬州领江都等四县。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明代设扬州府，直隶于京师，领三州七县，治于江都县。在扬州城东门外，明代设有两淮都转运盐使司，管理两淮盐区的食盐转运贸易；还设置了南京户部分司，作为扬州钞关的管理机构，向运河上来往的船只征收商税。明代扬州设有扬州卫指挥使司，隶属于中军都督府，所辖有前、后、左、右、中5个千户所，在府治西南。扬州卫是漕运卫所，自永乐年间确立漕运制度后，扬州卫的官军要负责转运漕粮。扬州在明代中后期屡遭倭寇侵扰，嘉靖时期在扬州府设置了海防道、参将等军事机构和军官，参将操练水陆军队，并可以节制卫所官兵，以防御倭寇。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明清时期的扬州再次因河而兴，成为重要的食盐供应基地和南北漕运要冲，并且在城市经济和社会文化领域达到了极高的成就，是全国数一数二的大城市。尤其是清代，扬州盐商的巨额财富不仅推动了扬州园林、艺术的勃兴，而且在全国的经济格局中都占有独特地位。清代扬州地方志中曾说：“东南三大政，曰漕，曰盐，曰河，广陵本盐䇲要区，北距河淮，乃转输之咽吭，实兼三者之难，其视江南北他郡尤雄剧”，直接总结了扬州城市发展的三大关键要素，以及扬州在长江南北的重要地位。"
                }]
            }]
        }, {
            name: "湖州",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "江南运河",
                    value: "江南运河，又称江南河、浙西运河，是京杭运河在长江以南的一段，北通长江，南达钱塘江，连通长江、太湖、钱塘江三大水系，至今仍全线通航。江南运河位于长江三角洲地区，以太湖水系为中心，北起长江南岸的江苏镇江京口，东南经常州、无锡，绕太湖东岸达苏州、吴江、平望，然后进入浙江嘉兴，折而西南，又经崇德、长安、临平，最终到达杭州，全长340 千米。江南运河是富庶的江南地区与北方相通的水运干道，航运条件良好，也是京杭运河运输最繁忙的航道。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "苏轼",
                    value: "苏轼（1037～1101），字子瞻，北宋眉州眉山（今属四川）人。宋嘉祐二年（1057），参加礼部考试，列为第一，殿试时又考中进士乙科。中举后，先后担任福昌主簿、秘阁、大理评事、签书凤翔府判官等职。熙宁二年（1069），苏轼回朝任告院判官，时值王安石推行新法，苏轼上书论新法不便，被外放，先后任杭州通判、密、徐知州，又被贬为黄州（今属湖北）团练副使。苏轼在黄州东坡修筑房屋，自号“东坡居士”。哲宗即位后，苏轼先后任朝奉郎、登州知州、礼部郎中、定州知州、英州知州、宁远军节度副使、琼州别驾等职。徽宗即位后，苏轼改任舒州团练副使等职，建中靖国元年（1101）逝世。南宋高宗即位后，追赠苏轼为太师，谥号“文忠”。"
                }, {
                    name: "殷康",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "殷康（生卒年不详），东晋人。曾担任武康县令、吴兴太守等职。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "小西街历史街区",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "小西街历史街区位于湖州古城中心地段，为东西向市河所穿越。主街道长约150米，河道两旁建筑鳞次栉比、庭院深深，呈现出典型的运河历史街区风貌。街区内有清道光时期状元钮福保的宅第“状元厅”，文物保护单位杨宅、温宅、许宅，以及大量的台门院落、传统民居等历史建筑。街区有小西街、勤劳街，沿市河两岸一南一北横穿街区，水乡风貌突出。"
                }, {
                    name: "衣裳街历史街区",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "衣裳街历史街区西邻小西街，是湖州古城主要的商业街。除各类店铺外，周边还有许多配套的场所和设施，以及体现湖州府城市职能的建筑。如临河处有接官厅，有驿馆、客栈，临街的小巷口有茶楼、当铺，北面不远处即湖州府衙、钱业会馆、钱业公所等。馆驿河头有碧澜堂（接官厅）、王安申故居、赵景贤故居，以及与之隔河相望的红门馆等建筑。钦古巷、九曲巷、馆驿巷、积善巷、当弄、竹安弄、包家弄等巷弄仍保持着传统肌理，是一处保存完好的水乡风貌街区。"
                }, {
                    name: "湖州子城遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "湖州子城的范围大致在今人民路以西，爱山街以东，公园路（子城巷）以南，府西街以北。这个范围内的地面高于四周，被称为“高墩头”。遗址位于今爱山广场内，留存者为子城东段城墙。呈南北走向，残长88米，宽约12米，晚唐、五代十国之吴越国、南宋三大时期的墙体相互叠压。衙东门遗址位于城墙遗址的南段，亦是唐、五代十国、南宋三个时期遗址叠压，门址为排叉柱形式。因爱山广场步行街建设，2008年3月～7月对子城遗址进行了考古发掘，2010年原址建展览馆保护展示。"
                }, {
                    name: "頔塘",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "頔塘又名“荻塘”“吴兴塘”，是古代大型水利、航运设施，对南浔乃至湖州的社会经济发展尤其是古代农业的开发做出过重要贡献。頔塘最早为东晋吴兴太守殷康所开，自湖州东门迎春桥经南浔至苏州平望，全长40余千米，沿线又开十数条溇港与太湖沟通，既排水患，又利灌溉、漕运。因两岸多生芦荻，故名“荻塘”。唐贞元年间，湖州刺史于頔进行大修，民怀其德，故改名“頔塘”。此后历代官府多有修缮。中华人民共和国成立后，頔塘又经多次拓浚和整修，继续发挥着不可替代的作用。1952年，为改善航运条件，在南浔镇北另开一段航路与塘贯通，给南浔镇保留了一段“頔塘故道”。1997年，頔塘被列为浙江省文物保护单位。"
                }, {
                    name: "丝业会馆",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "丝业会馆位于南浔镇南东街、广惠宫北侧，是晚清至民国年间南浔丝业公所办公、议事之处。清光绪二十八年（1902），从广惠宫购得隙地5亩，宣统二年（1910）动工营造，1912年落成，耗银8万两。丝业会馆主体建筑为大厅“端义堂”，三开间，抬梁式歇山顶，前檐置抱厦，通高约15米，是南浔现存最高的厅堂建筑。南浔丝业公会对当时丝业经营和对外贸易发挥了重要作用。1989年被列为湖州市文物保护单位。"
                }, {
                    name: "南浔坝桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "南浔坝桥　又名纪家坝桥。位于南浔镇运河下塘西街、鸣凤桥南侧。该桥始建年代失考，周庆云《南浔镇志》记“坝桥，清同治七年修，宣统三年又修”。南浔坝桥系单孔石梁桥，桥较小，长仅7米余，桥体跨度4米，宽2米。清代文人纪磊有《浔溪杂咏坝桥诗》：“小桥流水近门墙，笑语朝朝趁晚凉。我亦当时旧子弟，不堪回首问斜阳。”"
                }, {
                    name: "百间楼街区",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "位于湖州市南浔区南浔古镇东百间楼河两岸。百间楼河东起东吊桥，北至栅桩桥。百间楼沿河蜿蜒而建，长约400米，为明代万历中礼部尚书、南浔人董份所建，是董份回乡后给女眷们居住的地方，建成时约有100间楼房，故称“百间楼”。"
                }, {
                    name: "安澜桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "安澜桥位于菱湖镇北栅，横跨西河港，东西向。为三孔石拱桥，全长50.5米，高7.6米，宽4.55米。错缝砌置金刚墙。拱券石采用纵联分节并列砌置法，设6对间壁石加固，每端挑出金刚墙50厘米，其中有3对雕凿成兽头纹样。清乾隆四十二年（1777）始建，1921～1924年重建。"
                }, {
                    name: "长寿桥",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "长寿桥位于菱湖镇南商林村，横跨寺前港，南北向。系单孔石拱桥，全长13.0米，宽2.7米，高4.3米。风格上反映了明代桥梁的特征。据清同治《湖州府志》记载，北宋时建造后经重修，现桥为明晚期所建。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "秦汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "湖州立城的具体时间，文献中有两种说法：一说秦汉乌程县治在菰城，晋安帝义熙元年（405）始移今地；一说则认为秦汉乌程县治已在今地。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "菱湖镇古名秀溪，又名凌波塘，聚落形成的历史可以追溯到唐代。武周天授二年（691），因武康县东乡低地枕临溪泽，有舟楫之利，析置武原县。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "北宋太平兴国三年（978），南浔东57里的地区划归平江，成为湖州东境之门户。北宋太平兴国三年（978）置镇，设镇将戍守。南宋时湖州平原上至少有三条运河，其一是湖州城与平望间的荻塘运河，其二是江南运河杭州与嘉兴段北部的吴兴塘，其三则是唐末已修建的凌波塘。南宋时连接下塘运河经过凌波塘的运河在江南运河中的地位极其重要，杭州至嘉兴间的上塘运河淤浅难治，南宋朝廷从杭州北面新开一条运河，通过凌波塘这条西线运河：“新开河在余杭门外新桥之北，通苏湖常秀润等河，凡诸路纲运及贩米客舟，皆由此达于行都”。南宋时往来湖州、杭州的许多商船都要经过菱湖，今菱湖地区在当时的运河水网中是一个连接苏州、湖州和杭州几大城市的枢纽地带。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明代南浔镇仍属震泽下乡，洪武十四年（1381），后潘村巡检司署移至南浔，名称不改。明代庞太元所修《菱湖镇志》记：“菱湖非舟车孔道，汪洋浩瀚，古未成聚，自筑凌波塘以后，民始聚庐于塘之东”。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "南浔位于杭嘉湖平原北部、湖州市东部，是明清时期最为著名的水乡古镇之一。"
                }]
            }]
        }, {
            name: "淮安",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "淮扬运河",
                    value: "淮扬运河连通淮河、长江两大流域，串联洪泽、高邮、邵伯等湖泊；干支航道蛛网交织，衔接上海、连云港两大海港；水运辐射面可达鄂、湘、赣、苏、皖、鲁、浙、沪等省（市），为我国南北水运大通道的重要河段。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "陈瑄",
                    value: "陈瑄（1365～1433），字彦纯，合肥县（今安徽合肥）人。自幼颖敏不凡。成年后以武臣之子选侍大将军蓝玉，因他熟知兵法、勇武善射，很得蓝玉赏识。陈瑄多次从征西南，屡建战功，洪武末年袭父职为四川行都司都指挥同知。建文末年，迁右军都督佥事，命总舟师严守江防。燕王朱棣的“靖难”大军到达时，陈瑄以舟师迎降。永乐元年（1403）封平江伯，任总兵官，总督海运，后改掌运河漕运。陈瑄主持漕运30年，多有建树：开清江浦，导管家湖水流入淮河，浚通会通河河道，兴筑南旺湖长堤和高邮湖堤，在运河上按水势设闸47处，以保漕运畅通。宣德八年（1433）十月卒于任上，追封平江侯，赠太保，谥号“恭襄”。"
                }, {
                    name: "王宗沐",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "王宗沐（1523～1591），字新甫，别号敬所，浙江临海（今属浙江台州）人。明嘉靖二十三年（1544）考中进士。次年，授刑部主事，三年后升员外郎。历任广西按察司佥事、广东布政使司左参议、江西提学副使、江西左参政、江西按察使、山西右布政使、山东左布政使、都察院右副都御史、南京刑部右侍郎、工部右侍郎。官至刑部左侍郎兼都察院右佥都御史阅视宣大山西边防。万历九年（1581），因京察时被言官拾遗弹劾致仕。万历十九年病逝家中，朝廷追赠其刑部尚书。天启初年，追赐谥号“襄裕”。著有《王宗沐奏疏》《敬所文集》《海运志》《海运详考》《三镇图说》《樱宁语录》《尼山随笔》《象山粹言》《十八史略》《朱子大全私抄》《南华经别编》《宋元资治通鉴》《江西大志》等书。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "末口遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "末口遗址位于淮安市淮安区淮城街道新城社区。该遗址吴越时期为古邗沟入淮处，后于此设堰，称北辰堰。元末修筑新城时，留此为北水关，今湮塞。1982年，在此建牌坊一座，单间双柱，面阔3.5米，柱高5米，六面体，混凝土材质，上部匾额题“古末口”三字。"
                }, {
                    name: "流均口旧址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "流均口旧址位于淮安市淮安区泾口镇泾口村涧河北岸。清代淮安关机构庞大，辖区范围较广，有三关十八口，流均口是其中的一个子口，设在涧河北岸，河中设卡。关房有房屋两进，现存一进，面阔三间10米，进深5米。据《续纂淮关统志》卷五《关口》记载，流均口原设于盐城县流均沟地方，乾隆二十年（1755）因该处地势低洼，屡遭水患，移驻于山阳之泾口，距大关80里，新筑民房6间。因距离流均不远，故名称不变。清末漕运废止后，此房屋变为民居。"
                }, {
                    name: "林家码头遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "林家码头遗址位于淮安市淮安区林集镇林集社区新河东岸。明清至民国时，林集镇曾作为漕运之路，南北货运的集散地。码头由长条石砌成，规模较大。"
                }, {
                    name: "矶心闸",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "矶心闸位于淮安市淮安区淮城街道勺湖社区沿河街运河东堤上，又名响水闸，由长1～1.2米、宽0.3～0.4米、厚0.4～0.5米的火山岩石砌成。闸首在河堤西侧，闸尾在河堤东侧，闸道长40米，宽1.6米，出口宽1米，闸塘面积约50平方米，呈八字形向东接西水关。该闸是淮安城内文渠从大运河取水的源头，保存完好，至今仍在发挥作用，是古代运河沿线重要的文物遗存之一。"
                }, {
                    name: "淮安城墙遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "淮安城墙遗址位于淮安市淮安区淮城街道楼东社区东长街63号楚州中学东侧。据清同治《重修山阳县志》记载，淮安城墙始建于东晋永和八年（352），重建于东晋义熙七年（411）。到明嘉靖三十九年（1560）扩建为三座城。清《淮安府志》记载，元末史文炳守淮安，筑土城，明洪武十年（1377）外包砖，周长3.5千米，高9米，城设5门，水门3处。嘉靖三十九年为抵抗倭寇，在新旧两城之间，筑东西两面城墙，把两城连接起来，称为“联城”。"
                }, {
                    name: "总督漕运部院遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "总督漕运部院遗址位于淮安市淮安区城区中心，今镇淮楼东西路之间，其主体建筑与分居南北的镇淮楼、淮安府署在同一中轴线，是明清两代统管全国漕运事务的官署。总督漕运公署长300余米，宽100余米，建筑高出路基150厘米左右，四方格局，总面积超过3万平方米，是在南宋乾道六年（1170）由录事陈敏兴修的楚州州署基础上不断发展变化而来的。明清的总督漕运公署建筑规模宏伟，布局严谨，整个建筑群计有房213间，牌坊3座，中轴线上分设大门、二门、大堂、二堂、大观楼等。清光绪三十年（1904），漕运总督被裁撤，次年，江北提督刘永庆在旧总督署建立江北陆军学堂。民国初，总督署东侧后花园改建为淮安体育场，主体建筑则在20世纪40年代逐渐被毁，仅存房基础石埋于地下。"
                }, {
                    name: "勺湖碑园",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "勺湖碑园位于淮安市淮安区古运河畔的勺湖园。碑园运用了中国园林传统建筑手法，随形就势，回廊曲折，体现了以小见大的特色，碑园占地600多平方米。碑园收有淮安自唐以来寺庙、墓志及其他相关碑刻60余块，还有清代康熙、雍正、道光御碑。园内康熙御碑“雪作须眉”是康熙帝第五次南巡时，途经淮安，为淮安府山阳县籍官员刘谦吉亲笔题写的，保存完好。另外一块碑是乾隆二十七年（1762），乾隆帝第三次南巡过淮，亲笔诗书一首，赐予漕运总督杨锡绂的诗文碑刻。另外，有数块驻扎于淮安城的漕运军官的墓志铭，颇能反映明代漕运的实际情况。如《昭勇将军江北把总都指挥佥事崔公墓志铭》，展示了明代中叶江北把总都指挥佥事督理江北八卫粮运，遇河决时奉命清理河道的经历；《大河卫功升正千户阶武德将军田公墓志铭》陈述了明成化年间的大河卫崔姓千户催攒浙江等处粮储、建造驳船等履历；《戴恭人墓志铭》《戴母太夫人张氏墓志铭》等墓志铭则讲述了大河卫一个运官家族的故事。淮安市楚州博物馆也收藏有一些与明清漕运相关的碑刻，如清嘉庆年间漕运总督铁保所撰《漕运事宜碑》、继任漕运总督吉纶所作跋文；还有一些关于淮安地方民间信仰的祠庙碑刻，如清乾隆年间的《新城右营关帝庙碑记》、乾隆年间的《三元宫置田碑记》、道光年间的《福建天后宫碑记》等。"
                }, {
                    name: "天妃宫遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "天妃宫遗址位于淮安市淮安区淮城街道天后宫巷地震局。天妃宫位于月湖之滨，明宣德年间为祷天妃神后保佑漕船平安而建，有君子堂等共十余间。清康熙时又称为天后宫。1949年之前，因战火等原因被毁。"
                }, {
                    name: "东岳庙",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "东岳庙位于淮安市淮安区岳庙东街。始建于唐代贞观间，相传程知节守御于此时所造。明永乐间，都指挥施文重建；宣德间，平江伯陈瑄修葺；成化三年（1467），知府杨㫤增修。历史上的东岳庙占地面积达20余亩，有房屋百余间，由前殿、乐楼、东岳大殿、玉皇大殿及娘娘殿等主殿及附房组合而成。1949年后，东岳庙已破烂不堪。1958年，庙房被改造为淮安织布厂。“文革”期间，东岳庙塑像被毁坏殆尽。1996年，淮安市人民政府对东岳庙进行了部分维修。现存殿三座，占地面积约4000平方米，均为硬山抬梁式结构。东岳大殿面阔三间12.7米，进深九檩15.3米，檐高4米，殿正中上方高悬一块“天齐仁圣大帝”金匾。玉皇大殿，面阔五间15.8米，进深九檩15.8米，檐高4.2米。大殿梁枋雕有云、草等花纹，精美绝伦。两大殿中有部分石柱础为唐代遗存，部分木构件为明代制作。另庙宇内有两棵四百年银杏树和一眼古井。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "春秋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "春秋时期鲁哀公九年（前486），吴王夫差为了能舟师北进，与中原的齐国、晋国一较高下，开凿了沟通长江和淮水的运河—邗沟，东北通射阳湖，西北至末口入淮，作为运送军粮的水道。"
                }, {
                    name: "魏晋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋炀帝在魏晋南北朝数次整治及其父开凿的基础上，继续整理邗沟故道，使之较吴王夫差遗迹稍偏西，再次连接了江淮，并构成了全国性的大运河。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐朝初年，置楚州，治山阳县，天宝年间曾一度改称淮阴郡。唐代中后期，裴耀卿、刘晏等人改革转漕之法，将江南粮食经淮水、汴水、黄河等河道运至洛阳、长安。唐代的楚州城商业繁盛，甚至吸引了大食、日本、新罗等国的商人来此贸易，城内还有新罗坊，为新罗商人聚居之地。诗人白居易曾称赞楚州为“淮水东南第一州”。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "到了北宋时期，为了将东南地区的粮米供应都城开封，宋廷在真州、扬州、楚州、泗州等地设置转般仓，收纳各路输送的纲粮，同时调派粮船到转般仓运米，溯流入汴水，以输京师，形成了以转般仓为中心供应京城的漕运转输体系。楚州为楚扬运河入淮处，与地处通济渠入淮处的泗州，并为汴河漕运的两大要津，楚州开始成为运河上重要的节点之一。北宋末，曾有直达法和转般法的两次反复，导致转般诸仓皆被拆毁，运法日坏。①古运河在楚州城东北入淮，而入口山阳湾风涛险急，常常难以行舟。北宋时的转运使乔惟岳曾在淮城西北30里一带开凿沙河，又名乌沙河，可以直达清口入淮河，但后来岁久淤塞，船只入淮仍需盘坝。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元朝建立之后，以朱清、张瑄专掌海运，江南输送至大都的漕粮大多从海路运输，辅以少量的内河航运。海运之道，以平江刘家港为起点，使得“淮扬运河堙废不修，史志甚略”。元代对于淮安这个地控南北的重镇经营得并不充分，十分疏略。元末，江淮地区在张士诚的控制之下，海道也被阻断，海运难以为继。至正十五年（1355），元廷“遣使以御酒、龙衣赐士诚，征海运粮”，于是张士诚每年只运10余万石粟到大都，待其称王之后，就不再为元朝征粮，使元日渐坐困。②彼时淮安被张士诚部将史文炳所占据，其在旧城北的北辰镇临淮河筑城，是为新城。此地靠近古末口遗迹，交通条件更为便利，更有利于转输军事物资和粮食商品。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明初，曾因循元代旧法，实行海陆兼运。海运粮从山阳出发，入淮河出海。平江伯陈瑄督海运时，在淮安城的仓巷，即宋代上供仓的旧址上，设置转般仓，以为海运漕粮储存之所。明代漕运总兵官是漕运卫所军队的最高指挥官，驻扎于淮安。淮安城有两座漕运总兵府，旧城南门内以西的一座为第一任总兵官平江伯陈瑄镇守时知府所创，称为南府，后多居于府治东的另一座府邸，称北府。自陈瑄总管漕运，开府淮安之后，都是以武将督运。直到景泰二年（1451），由右佥都御史王竑总督漕运，开启了明代文官总漕的体制，并且随后还兼任巡抚南直隶江北地区，以加强对南直隶的行政管理，形成了文武双轨总理漕运的制度。因此，明代漕运系统的最高机构是设于淮安的都察院衙门，系景泰初年王竑督漕后，淮安知府改造旧城南门内陈瑄旧居而成，后曾改建迁移，常被称为“漕运衙门”或“漕司”。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "漕运都御史兼巡抚江北常简称“总漕”或“漕抚”，亦开府于淮安，又称“淮抚”，清朝大体延续明朝所建立的体制，设立漕运总督一人总理漕务，驻扎淮安，故称“漕督”。清代漕运沿袭明代旧制，有漕各省卫所军继续挽运漕粮，淮安、大河两卫运丁挽运本府州县漕粮，另外，驻扎淮安府的总督漕运部院军门下设有7个营，乾隆元年（1736），增设了漕标3个营。在淮安城中居住的不仅有卫所官军，而且还有军卫衙门的胥吏衙役，包括官军家属，其人口规模总计有3万～4万人，这部分人口具有一定的流动性，常常参与商业贸易，对淮安城镇的繁荣起到了很大的推动作用。光绪三十一年（1905），当地士绅在修路碑文中记述道：“自黄河北徙，漕艘停运，江海通轮，舟车罕至，遂日即凋敝，而莫之或恤”，淮安从清朝中期开始渐渐丧失了繁华，日渐凋敝。"
                }]
            }]
        }]
    },
    "w3+O": function(e, l) {
        e.exports = {
            name: "沧州",
            itemStyle: {
                color: "#F39801"
            },
            label: {
                fontSize: 20
            },
            children: [{
                name: "相关河道",
                lineStyle: {
                    color: "#29A7E1"
                },
                itemStyle: {
                    color: "#29A7E1"
                },
                children: [{
                    lineStyle: {
                        color: "#29A7E1"
                    },
                    itemStyle: {
                        color: "#29A7E1"
                    },
                    name: "南运河",
                    value: "隋代开水济渠，沟通华北平原的骨干水道形成。唐宋元时期，永济渠之名已经少用而多称御河。元代京杭运河全线贯通，御河临清以北段纳入其中。明清时期，京杭运河山东临清至北京通县统称北河，因水源不同分为卫漕和白漕。清代，京杭运河山东临清至天津段称南运河。南运河南起山东省临清枢纽，与大运河会通河相接，自南而北经山东省德州，河北东光、泊头市、沧县、青县，至天津静海县三岔口与北运河相连，水道全长446 千米。南运河为南北流向，河道纵比降0.03/1 000。南运河沟通海河南系各支流，是海河南系干流，至今仍在发挥防洪、排涝等作用。南运河河流比降大，丰枯流量变幅也比较大，主要通过弯道、减水坝和减河控制水量，有效地减缓了河道纵比降，降低了流速，并节制了运道水量，提高了通航质量。弯道特性的有意保留体现了古代运河在工程规划方面的科学性。南运河是今黄河以北运河最早设置分洪工程的河段。为节制运河水量，满足低水位壅水和汛期行洪的综合需求，南运河沿线自南而北依次设置有四女寺、哨马营、捷地、兴济和马厂等水量节制枢纽，通过减水坝分洪，经减水河东排入海。这些枢纽坝闸结合的工程形式反映出古代在水工建筑规划、设计与结构方面的科学性。为解决南运河汛期堤防防洪压力大、易出险的问题，沿线险工段设置有制导工程，河道工程管理过程中一度利用含沙量较高的漳河洪水冲淤、泥沙固堤等措施，这些都体现出古代河工技术中以堤治河、以河治河的特点。"
                }]
            }, {
                name: "相关人物",
                lineStyle: {
                    color: "#1D805B"
                },
                itemStyle: {
                    color: "#1D805B"
                },
                children: [{
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    name: "姜师度",
                    value: "姜师度（约653～723），唐代魏州（今河北大名）人，水利专家。曾担任易州、沧州、陕州等地刺史及御史中丞、大理卿、将作大匠等职。"
                }, {
                    name: "马之贞",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "马之贞（约1250～1310），字叔，元代沧州（今属河北）人，一说为汶上（今属山东）人。马之贞青年时期熟读历代水利著作，立下以国计民生为念的抱负，好友商瑭向丞相伯颜举荐，称其熟知水利，家中有许多这方面的书籍。伯颜对其极为重用。至元十七年（1280），马之贞出任泗、汶都漕运副使，负责开凿山东境内运河，实现漕运南北贯通。开河成功后，马之贞又先后担任都水少监、都水大监等，负责全国水利工程及运河的管理。约在至大三年（1310）去世，葬于汶上县城南三里处，沿河民众感念其功劳，又在墓旁立石碑以记之。"
                }, {
                    name: "张缙",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "张缙（1442～1524），字朝用，别号玉雪，山西阳曲人。祖籍山西太原府阳曲，至张缙移居沧州。明天顺六年（1462），考中举人，成化五年（1469），进士及第，步入仕途。初任河南钧州（今河南禹州）知州，后补北直隶河间府沧州知州，又任南京工部都水清吏司郎中，擢升南京工部郎中，后出任浙江杭州府知府，再任山东布政司左参政，管东兖道事，驻扎寿张县。因治河有力，晋通政司右通政，提调沙河至德州一带河道，驻扎张秋镇。弘治十三年（1500）八月，升都察院右佥都御史，巡抚保定等地方兼提督紫荆关。十四年四月，提升右副都御史，巡抚宣化、大同等处地方。十一月，总督漕运，兼巡抚凤阳等处。正德元年（1506）五月，擢升户部左侍郎、南京户部尚书。六年八月至九年九月，复召为右都御史，仍督漕运。后复任南京户部尚书，以老乞休，七次上疏，乃致仕。嘉靖三年（1524）六月病逝。"
                }, {
                    name: "陈鹏年",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "陈鹏年（1663～1723），字北溟，号沧州，湖南湘潭人。清康熙三十年（1691）考中进士，历任浙江西安（今属浙江衢州）知县、山阳知县、江宁知府、河道总督等职，雍正元年（1723）正月因病去世。著有《道荣堂文集》《沧州诗集》《历仕政略》《河工条约》等书。"
                }, {
                    name: "杜充",
                    lineStyle: {
                        color: "#1D805B"
                    },
                    itemStyle: {
                        color: "#1D805B"
                    },
                    value: "杜充（？～1141），字公美，北宋相州（今河南安阳）人。杜充好功名，性格残忍，短于谋略。宋哲宗绍圣间，考中进士，先后出任考功郎、光禄少卿、沧州知州等职。南宋建炎元年（1127），担任天章阁待制、北京留守，后任枢密直学士。次年，东京留守宗泽去世，杜充代为留守兼开封尹。杜充在开封，中断了宗泽先前对北方民间抗金武装的联系和支援，并对宗泽招抚的抗金武装加以排斥，甚至予以消灭，导致北方抗金武装纷纷解散。同年冬，金兵南下，杜充弃城南逃，并掘开黄河大堤，使黄河水决而南流，自泗水入淮，企图以此阻挡追兵。建炎三年，金军再次南侵，杜充弃守南逃真州（今江苏仪征），后降金。先后担任相州知州、燕京三司使、签书燕京行台尚书省事、行台右丞相等职。绍兴十一年（金皇统元年，1141），宋金签订《绍兴和议》，结束战事，同年杜充去世。"
                }]
            }, {
                name: "名胜古迹",
                lineStyle: {
                    color: "#C19A62"
                },
                itemStyle: {
                    color: "#C19A62"
                },
                children: [{
                    name: "沧州旧城",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "沧州旧城位于沧县旧州镇东关村，旧州原为汉浮阳县，隋改名清池。北魏设沧州始治饶安，唐沧州治于清池，宋元因之。此城修于隋唐，呈不规则圆形，南北长约2500米，东西宽约2000米。城墙遗存西、南两面较多，北面较少，南门缺口明显可见，西门瓮城依稀可辨。城墙夯土筑成，基宽30～40米，残高1～8米。城内文化遗存丰富，残存三座夯土台建筑基址，现可见开元寺、铁钱库、铁狮子等遗址遗物。1982年该城址被确定为河北省文物保护单位，2013年被列为第七批全国重点文物保护单位。"
                }, {
                    name: "沧州铁狮子",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "沧州铁狮子位于沧州旧城内，原开元寺遗物，铸于后周广顺三年（953），身长6.3米，高5.3米，宽3米，重约40吨。其气势雄伟，造形逼真，是我国现存最大的古代铸铁工艺品。铁狮头部及项下各有“狮子王”三字，颈部右侧有“大周广顺三年铸”七字，右胁处有“山东李云造”五字，狮腹内壁为隶书《金刚经》，字迹已模糊不清。清乾隆《沧州志》称：“铁狮，在旧城开元寺，今寺废，相传周世宗北征，有罪人善冶，输金铸狮以镇城赎罪”①。有观点认为此说不可信，称铁狮俗名“镇海犼”，推测是当地居民为镇海啸所铸异兽。又有传言，铁狮立于开元寺前以壮寺观，腹内有经文，背负莲花宝座，应为文殊菩萨的坐骑。铁狮的铸造工艺为泥范明浇法，至今已逾千年，饱经沧桑，口吻腹尾均有残缺。1961年被列为第一批全国重点文物保护单位；1984年新建2米高的混凝土台座，移狮于台上；1995年起在铁狮外围安装了保护性的钢管支架。"
                }, {
                    name: "沧州码头遗址",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "沧州码头遗址位于沧州市新华区解放桥北，为运河航运码头，明代长芦转运使司驻地。现码头与转运使司遗址无存，河道内可见陶瓷残片、清代铜钱等。"
                }, {
                    name: "长芦运使题名碑",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "长芦运使题名碑位于沧州市运河西岸，明崇祯七年（1634）立。青石质，碑首、碑座均佚，碑身高2.27米，宽0.87米，厚0.26米。碑文楷书，首题“长芦运使题名碑”，内容为崇祯七年敕长芦转运使司运使的钦奉敕书。碑文多漫灭，具体内容不详。"
                }, {
                    name: "清真北大寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "清真北大寺位于沧州市新华区解放中路南侧，明永乐二年（1404）由沧州白、马、吴、代等九姓回民捐地为资创建，永乐十八年落成。清同治十二年（1873）修葺，民国初年重修，20世纪60年代遭到破坏，80年代后又多次进行维修。该寺位于运河东岸，距沧州码头约400米，明清时期不仅是当地回族民众举行宗教活动的场所，也是运河往来船只中穆斯林休息、诵经之所，每年冬季有很多回族船民在寺中居住等待开航。清真北大寺坐西朝东，东西长120米，南北宽50米，占地面积6000平方米，建筑面积1607平方米。主体建筑为礼拜大殿，前有卷棚，后为窑殿，建筑风格具有典型的民族特色，庄严肃穆。该寺为中国四大清真寺之一，1982年被列为河北省文物保护单位。"
                }, {
                    name: "清真女寺",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "清真女寺位于沧州市新华区解放中路北侧，与清真北大寺隔路相邻，始建于清康熙十六年（1677）。该寺为女穆斯林活动场所，坐西朝东，占地面积1288平方米，现存门殿、礼拜堂、沐浴室等。"
                }, {
                    name: "捷地减河闸碑",
                    lineStyle: {
                        color: "#C19A62"
                    },
                    itemStyle: {
                        color: "#C19A62"
                    },
                    value: "捷地减河闸碑位于沧县捷地回族乡捷地村北减河闸北侧，清乾隆三十六年（1771）立。捷地减河由明户部侍郎白昂于弘治三年（1490）奉敕开挖，用以分泄南运河洪水入海，原于减河口处筑石堰一道，明嘉靖十四年（1535）改建为减水闸。清雍正四年（1726）怡亲王胤祥主持在减河口处建五孔石闸一座，乾隆三十六年又改闸为坝，此碑即记此事。碑为汉白玉质，螭首，方座，通高3.66米，宽1.1米，厚0.3米。碑额楷书“御制”二字，碑阳为乾隆帝撰书关于改捷地、兴济二闸为滚水坝及罢芥园滚水坝工程的议定经过，碑阴为乾隆御笔五言诗一首，内容主要为改闸易坝的缘由。"
                }]
            }, {
                name: "建置沿革",
                lineStyle: {
                    color: "#E53427"
                },
                itemStyle: {
                    color: "#E53427"
                },
                children: [{
                    name: "周",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "西周时属青州。"
                }, {
                    name: "秦",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "秦朝时属巨鹿郡和洛北郡。"
                }, {
                    name: "汉",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "汉代属冀州和幽州。"
                }, {
                    name: "隋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "隋初废浮阳郡，后分属河间郡、渤海郡和平原郡。"
                }, {
                    name: "唐",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "唐朝贞观元年（627年）属河北道，天宝元年（742年）改沧州置景城郡，治清池县（今河北沧州市东南）。辖境相当天津市海河以南，静海县和河北省青县、泊头市以东，东光县及山东省宁津、乐陵、无棣等市县以北地区。乾元元年（758年）复改为沧州。"
                }, {
                    name: "宋",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "北宋改为景城郡，后废，属河北东路河间府。"
                }, {
                    name: "元",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "元代属中书省河间路。"
                }, {
                    name: "明",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "明代属北直隶省河间府。"
                }, {
                    name: "清",
                    lineStyle: {
                        color: "#E53427"
                    },
                    itemStyle: {
                        color: "#E53427"
                    },
                    value: "清代，初属直隶省河间府，后大部分属天津府。"
                }]
            }]
        }
    }
});
//# sourceMappingURL=4.70834fd807aa97122e6e.js.map
